{
 "nohorny": [
  "https://cdn.discordapp.com/attachments/648141423446851614/700470003002114148/image0-117.jpg",
  "https://cdn.discordapp.com/attachments/648141423446851614/700470002750324837/image0-4-1.jpg",
  "https://cdn.discordapp.com/attachments/648141423446851614/700470002154864710/0a63569b-9800-4fd6-ba3d-2f89e0cf1aba.png",
  "https://cdn.discordapp.com/attachments/648141423446851614/700470001844486144/5f32c31f-c00f-411b-84c9-d6d8c7da1ff7.png",
  "https://cdn.discordapp.com/attachments/648141423446851614/700470001366204457/5eaaf78f-701d-4459-adab-0b6bd09c3b92.png",
  "https://cdn.discordapp.com/attachments/648141423446851614/700470000716349440/741142b8-d1c4-4b1a-a1ee-97315ae707c1.png",
  "https://i.imgur.com/NFsfyRB.png",
  "https://i.imgur.com/FoHQYXn.png",
  "https://i.imgur.com/DSdfDFH.jpg",
  "https://media.discordapp.net/attachments/507388259165536263/699740211663339671/08b12908-dce6-47a0-88fc-2ffc54b6591d.png",
  "https://media.discordapp.net/attachments/507388259165536263/699739144326479892/5c217492-b38e-4ed4-b34a-3c52a1bdff40.jpg",
  "https://i.imgur.com/DFW7nFY.png",
  "https://i.imgur.com/vM9l8H7.png",
  "https://i.imgur.com/fYwiH1I.png",
  "https://i.imgur.com/Cu6BgzV.png",
  "https://i.imgur.com/YgEF30d.jpg",
  "https://i.imgur.com/FQ7aKCB.png",
  "http://imgur.com/a/IH3CyxD"
 ],
 "what": [
  "ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ\nᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ ᘛ(    ᕐᐷ"
 ],
 "highlanderlocke": [
  "**Highlanderlocke Run:**\n> 1. You start with 20 points. \n> 2. Every gym or trial you complete gets you 6 additional points.\n> 3. When a pokemon faints, it dies. You may spend 5 points at any time to make it no longer dead. It must be revived at a pokemon center or with an item as normal.\n> 4. Throwing a ball costs 2 points.\n> 5. Gift pokémon (such as fossil pokemon or pokemon you buy at a casino) cost 2 points to keep. This does not apply to starters.\n> 6. Dynamaxing, Z moves, and mega evolutions cost 1 point to use in battle.\n> 7. Consumable items (potions, status restoring items, x items, bitter medicine, vitamins, etc.) each cost 1 point to use on a pokémon. This does not apply to TMs, HMs, berries, or evolution stones.\n> 8. No trading with other players, XP share, pokémon refresh, pokémon amie, super training, or anything in that vein.\n> 9. You lose when you white/blackout."
 ],
 "google": [
  "https://www.google.com/"
 ],
 "rav-ability": [
  "**Graft** <:GU:233095244332138497>\nGraft N (This creature enters the battlefield with N +1/+1 counters on it. Whenever another creature enters the battlefield, you may move a +1/+1 counter from this creature onto it.)",
  "***Radiance*** <:RW:233095204649828352>\nExample:\n*Radiance* — Target creature and each other creature that shares a color with it <effect>.",
  "**Dredge** <:BG:233095174572605440>\nDredge N (If you would draw a card, instead you may put exactly N cards from the top of your library into your graveyard. If you do, return this card from your graveyard to your hand. Otherwise, draw a card.)",
  "**Replicate** <:UR:233095125914484737> \nReplicate <cost> (When you cast this spell, copy it for each time you paid its replicate cost. You may choose new targets for the copies.)",
  "**Haunt** <:WB:233095081316319244>\nOn creatures:\nHaunt (When this creature dies, exile it haunting target creature.)\nOn nonpermanents:\nHaunt (When this spell card is put into a graveyard after resolving, exile it haunting target creature.)\n\nThe exiled card is haunting the creature.",
  "**Convoke** <:GW:233082340417601537>\nConvoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for <:1_:233087941465997312> or one mana of that creature's color.)",
  "**Bloodthirst** <:RG:233082296717017099>\nBloodthirst N (If an opponent was dealt damage this turn, this creature enters the battlefield with N +1/+1 counters on it.)",
  "**Forecast** <:WU:233082066831409162>\nForecast — <cost>, Reveal this card from your hand: <ability>. (Activate this ability only during your upkeep and only once each turn.)\n\nForecast is a keyword ability, not an ability word.",
  "**Transmute** <:UB:233082236444868618>\nTransmute <cost> (<cost>, Discard this card: Search your library for a card with the same converted mana cost as this card, reveal it, and put it into your hand. Then shuffle your library. Transmute only as a sorcery.)",
  "***Hellbent*** <:BR:233082275330392064>\n*Hellbent* — <effect> as long as you have no cards in hand."
 ],
 "reveallands": [
  "**Shadowlands / Reveallands**\nShadowlands are a cycle of dual lands that get their name from the set they were first printed in — Shadows Over Innistrad. Each taps for one mana of two colors, and enters the battlefield tapped unless you reveal a land card with at least one of two basic land types from your hand (e.g. Forest or Mountain).\n**Allied shadowlands:** Port Town, Chokes Estuary, Foreboding Ruins, Game Trail, Fortified Village"
 ],
 "shadowlands": [
  "**Shadowlands / Reveallands**\nShadowlands are a cycle of dual lands that get their name from the set they were first printed in — Shadows Over Innistrad. Each taps for one mana of two colors, and enters the battlefield tapped unless you reveal a land card with at least one of two basic land types from your hand (e.g. Forest or Mountain).\n**Allied shadowlands**: Port Town, Chokes Estuary, Foreboding Ruins, Game Trail, Fortified Village"
 ],
 "trilands": [
  "**Trilands**\nTrilands are a cycle of 10 cards, printed across the Shards of Alara and Khans of Tarkir blocks. Each enters the battlefield tapped and can be tapped to add one mana of any three colors.\n**Allied (shard) trilands:** Arcane Sanctum, Crumbling Necropolis, Savage Lands, Jungle Shrine, Seaside Citadel\n**Enemy (wedge) trilands:** Sandsteppe Citadel, Mystic Monastery, Opulent Palace, Nomad Outpost, Frontier Bivouac"
 ],
 "bondlands": [
  "**Bondlands**\nBondlands, EDHlands, or Multilands, the allied half of this cycle was printed in Battlebond. As such, they’re tooled towards multiplayer games — entering the battlefield tapped unless you have two or more opponents.\n**Allied bondlands: **Sea of Clouds, Morphic Pool, Luxury Suite, Spire Garden, Bountfiul Promenade"
 ],
 "colored": [
  "deserts” **Colored Deserts**\nPrinted in Hour of Devastation, the second set of Amonkhet block, the cycle of colored deserts all enter the battlefield tapped, tap for one a man of a certain color, and can be cycled for 1 generic and 1 mana of the color they produce. In addition to this, they have the Desert subtype. Each takes its name from one of Amonkhet’s five mono-colored god’s titles.\n**Colored Deserts:** Desert of the: True, Mindful, Glorified, Fervent, Indomitable"
 ],
 "cyclelands": [
  "Cyclelands\nCyclelands are two mono-colored land cycles originally printed in Onslaught and Urza’s Saga. The Onslaught ones were brought to Modern in MH1, and Historic through one of the Anthologies. They each enter the battlefield tapped, add one mana of a certain color, and can be cycled away for a small cost. Onslaught ones cost one mana of the color they tap for, and Urza’s ones 2 mana of any color.\n**Onslaught cyclelands:** Secluded Steppe, Lonely Sandbar, Barren Moor, Forgotten Cave, Tranquil Thicket\n**Urza’s Saga cyclelands: **Drifting Meadow, Remote Isle, Polluted Mire, Smoldering Crater, Slippery Karst, Blasted Landscape"
 ],
 "bikelands": [
  "**Bicyclelands**\nBicyclelands are a cycle of duals printed in Amonkhet. Each of them have two basic land types, enter the battlefield tapped, and have Cycling <:2_:233087976723185665>, allowing you to pay 2 and discard them to draw a card.\n**Ally bikelands:** Irrigated Farmland, Fetid Pools, Canyon Slough, Sheltered Thicket, Scattered Groves"
 ],
 "bicyclelands": [
  "**Bicyclelands**\nBicyclelands are a cycle of duals printed in Amonkhet. Each of them have two basic land types, enter the battlefield tapped, and have Cycling <:2_:233087976723185665>, allowing you to pay 2 and discard them to draw a card.\n**Ally bikelands:** Irrigated Farmland, Fetid Pools, Canyon Slough, Sheltered Thicket, Scattered Groves"
 ],
 "canopylands": [
  "**Horizonlands / Canopylands**\nHorizonlands are a cycle of dual lands that require a payment of 1 life to tap for mana, but allow you to pay <:1_:233087941465997312>, tap it, sacrifice it to draw a card. The first was Horizon Canopy, the green and white dual, printed originally in Future Sight, and later in Iconic Masters. Modern Horizons gave us the enemy half of the cycle. As of the 23rd of October, 2019, the ally cycle hasn’t been completed.\n**Ally horizonlands:** Horizon Canopy (Future Sight, reprinted in Iconic Masters)\n**Enemy horizonlands:** Silent Clearing, Fiery Islet, Nurturing Peatland, Sunbaked Canyon, Waterlogged Grove (MH1)"
 ],
 "horizonlands": [
  "**Horizonlands / Canopylands**\nHorizonlands are a cycle of dual lands that require a payment of 1 life to tap for mana, but allow you to pay <:1_:233087941465997312>, tap it, sacrifice it to draw a card. The first was Horizon Canopy, the green and white dual, printed originally in Future Sight, and later in Iconic Masters. Modern Horizons gave us the enemy half of the cycle. As of the 23rd of October, 2019, the ally cycle hasn’t been completed.\n**Ally horizonlands:** Horizon Canopy (Future Sight, reprinted in Iconic Masters)\n**Enemy horizonlands:** Silent Clearing, Fiery Islet, Nurturing Peatland, Sunbaked Canyon, Waterlogged Grove (MH1)"
 ],
 "temples": [
  "**Scrylands / Temples**\nTemples, or scrylands, are a cycle of dual lands, originally printed in Theros block. They enter the battlefield tapped, and you get to scry 1 when they do!\n**Ally scrylands:** Temples of: Enlightenment, Deceit, Malice, Abandon, Plenty (Reprinted in Theros: Beyond Death)\n**Enemy scrylands: **Temples of: Silence, Epiphany, Malady, Triumph, Mystery (Reprinted in Core Set 2020)"
 ],
 "scrylands": [
  "**Scrylands / Temples**\nTemples, or scrylands, are a cycle of dual lands, originally printed in Theros block. They enter the battlefield tapped, and you get to scry 1 when they do!\n**Ally scrylands:** Temples of: Enlightenment, Deceit, Malice, Abandon, Plenty (Reprinted in Theros: Beyond Death)\n**Enemy scrylands:** Temples of: Silence, Epiphany, Malady, Triumph, Mystery (Reprinted in Core Set 2020)"
 ],
 "checklands": [
  "**Checklands**\nChecklands are a land cycle first printed in Innistrad and Magic 2010. They can tap for one mana of either of two colors, and enter the battlefield tapped unless you control a land with one of two basic land types (i.e., a Mountain or a Forest).\n**Ally checklands:** Glacial Fortress, Drowned Catacomb, Dragonskull Summit, Rootbound Crag, Sunpetal Grove (First printed in M10, reprinted in M11-13 and in Ixalan)\n**Enemy checklands:** Isolated Chapel, Sulfur Falls, Woodland Cemetery, Clifftop Retreat, Hinterland Harbor (First printed in Innistrad, reprinted in Dominaria)"
 ],
 "fetchlands": [
  "**Fetchlands**\nFetchlands are a land cycle originally printed in Onslaught and Zendikar. They have no mana abilities, but you can pay 1 life and sacrifice them to search your library for a land card with one of two basic land types and put it onto the battlefield.\n**Ally shocklands:** Flooded Strand, Polluted Delta, Bloodstained Mire, Wooded Foothills, Windswept Heath (Reprinted in Khans of Tarkir, __Banned in Pioneer__)\n**Enemy shocklands:** Marsh Flats, Scalding Tarn, Verdant Catacombs, Arid Mesa, Misty Rainforest"
 ],
 "shocklands": [
  "**Shocklands**\nShocklands are a land cycle originally printed in the Ravnica block. They have two basic land types and tap for one of two colors. They enter the battlefield tapped unless you pay 2 life. They were reprinted in Return to Ravnica block, Zendikar Expeditions, and in Guilds of Ravnice/Ravnica Allegiance.\n**Ally shocklands:** Hallowed Fountain, Watery Grave, Blood Crypt, Stomping Ground, Temple Garden\n**Enemy shocklands:** Godless Shrine, Steam Vents, Overgrown Tomb, Sacred Foundry, Breeding Pool"
 ],
 "painlands": [
  "**Painlands**\nPainlands are two land cycles originally printed in Ice Age and Apocalypse. They can tap for either colorless mana, or one of two colors. However, whenever you tap them for colored mana, they deal 1 damage to you.\n**Ally painlands:** Adarkar Wastes, Underground River, Sulfurous Springs, Karplusan Forest, Brushland\n**Enemy painlands:** Caves of Koilos, Shivan Reef, Llanowar Wastes, Battlefield Forge, Yavimaya Coast"
 ],
 "triomes": [
  "**Triomes**\nTriomes are a cycle of lands printed in Ikoria: Lair of Behemoths. They each have three basic land types, enter the battlefield tapped and have \"Cycling <:3_:233087977377628160>\". Their names each line up with one of the plane's five in-world \"triomes\".\n**Enemy (wedge) triomes:** Indatha, Ketria, Raugrin, Savai, Zagoth"
 ]
}