[
"```Windy: I plan to get married eventually\nGrish: Pretzels!```",
"```Amelia: I also really like Rings of Brighthearth.  Admittedly, I haven't used it much, but that's because it's like 17 bucks.\nAmelia: Splinter Twin is neat as well.\nAmelia: And no, I don't care if anyone's a lesbian or anything.```",
"```Neo: Undoer of Bras would make a really weird Eldrazi creature```",
"```Amelia: If there ever were a good case for genocide...```",
"```Fluffy: one's motivations have no bearing on the nature of the act itself, herzi. feelings are immaterial and, when compared to the material reality of actions, insignificant.\nFluffy: also, cool banner```",
"```Amelia: (Then again, I'm not entirely sure what a vagina looks like either...)```",
"```Neo: is it floppy?\nShifty: that's none of your damn business```",
"```Amelia: .\nShifty: I agree.```",
"```Shifty: Forget legalizing gay marriage, it's time to weaponize it```",
"```Fluffy: pledge five bucks to my patreon and I will kill all dog breeders with my orbital gay cannon```",
"```Korakhos: everything is rare there```",
"```Shifty: The trick is to play it extremely fast and incredibly loose, like an old hairband sellotaped to a fighter jet```",
"```Fluffy: weird time zones... hellbeasts roaming around...\nFluffy: Australia is Time Spiral-era Dominaria```",
"```Jacqui: you can feel my hot fuzz any time bb```",
"```Sylpha: A snail hat is just another way to say Hail Satan```",
"```Fluffy: Machiavelli: the original AAA developer```",
"```Naz: Obviously all artists are to not be trusted```",
"```Hobbez: Well it was the size that made it nice```",
"```Shifty: NSFW for occasional TV-head sex```",
"```Shifty: Young Man Experiences A Whole Bunch Of Surreal Bullshit, Becomes Disgusting Mutant, Gets Penis Stolen By Raven```",
"```Jacqui: the similarity to S&M in our sexy angelic flavor is pure coincidence.```",
"```Egg: hey anyone want any \"erotic asphyxiation video seks\" before I delete this thread```",
"```Sylpha: Congrats people using the hashtag for making Nazis feel attacked```",
"```Jacqui: liar. i'd beat your mother senseless. i really would```",
"```Shifty: frustraighting (adj.) loudly, obnoxiously heterosexual```",
"```Herzi: brisela is only grimdark if you're a lesbophobe #trufacts #onelove```",
"```Fluffy: it becomes a shadow game\nHerzi: they squirt```",
"```Jacqui: My tits are strictly frontal```",
"```Shifty: The fucking was meant to inject sarcasm```",
"```Jacqui: Liverpool is in Manchester, right?```",
"```Fleur: the fuck are you saying, you little shit, I like new new world order designs```",
"```Fluffy: theoretically a creature can die twice too```",
"```Shifty: Did you know there are people running for election in the UK who legitimately want to bring back the monarchy?\nWindy: That would explain why I thought it was balanced```",
"```Herzi: Kevin \"The Kevin Yan\" Kevin Yan```",
"```Daij: I had to fight five kids for nearly two hours```",
"```Matt: What is going on here\nFluffy: full queer communism, Matt```",
"```Jacqui: well kiku doesn't want to fuck a bird, so```",
"```Egg: let's talk about League of Legends\nShifty: oh fuck do we have to```",
"```Shifty: 7-color control\nFluffy: how do I delete other people's posts```",
"```Shifty: I'm so ready\nHerzi: ive never been less ready```",
"```Shifty: uwu'mrakul```",
"```Herzi: WH4TS 4 ST3V3N```",
"```Fleur: wait, it's not nonland\nFleur: uh oh```",
"```Fluffy: you can lead the horse to water but you can't make it design good cards```",
"```Herzi: is the first verse of avril lavigne's classic 'best damn thing' problematique? discuss amongst yourselves```",
"```Shifty: Snow's definitely black in personality```",
"```Herzi: UBBBR or bbbust```",
"```Neo: there can never be enough polygrams```",
"```Sylpha: Theyire're\nFluffy: whom'st'd've```",
"```Fluffy: you can't really be a ruleless rebel if you're trying to fit a result someone else requested, can you, you piece of cum```",
"```Fluffy: it's an upside-down floating pyramid. very important distinction```",
"```Herzi: James Cameron's Polyamory with Smurfs```",
"```Herzi: aww the giant shapeshifting monstrosity had a hiccup```",
"```Jacqui: i am 100% honest and also not gay```",
"```Fluffy: nothing's worse than watching prison v prison```",
"```Shifty: what else am I here for if not gross mutilation of the truth?```",
"```Sylpha: What can black instants even do?\nWindy: Uh... Yes?```",
"```Shifty: What's that from?\nFleur: nowhere```",
"```Matt: Dark Studies needs no buffing\nEgg: Dark Studies needs disappearing```",
"```Shifty: oh well, my kitchen's full of toxic waste but at least it's not in my bathroom too!```",
"```Krow: HAIVJABGVRV_THE_FOVJAHVUD\nKrow: LEGERBTRY CRFGHHAR\nEgg: LEGERBTRY CRFGHHAR - GODI```",
"```Egg: 10 lines is too many for a common isn't it```",
"```Fluffy: huw, jacqui, I'll hyperkick you both if you don't start working on your shit```",
"```Jacqui: how does your body maintain its structure\nFluffy: spite and coke```",
"```Fluffy: split second can make like a banana and fuck its own asshole```",
"```Fleur: sylph do you have more holes that need filling\nSylpha: yeah I have a lot of holes that need to be filled```",
"```Shifty: Someone's the Archenemy\nFluffy: it's me```",
"```Fluffy: huw has chaos magic and will manifest arcuns into your house physically if you make fun of Talking Heads```",
"```Korakhos: always ooze```",
"```Herzi: jojo and metal gear are the equality we need```",
"```Shifty: ah AHAH ah uh ah AH\nFluffy: ooooo WA-A-A-A```",
"```Fluffy: in the United Kingdom, we fuck flashback cards```",
"```Fluffy: damn goo```",
"```Fluffy: you take the ice cube\nFluffy: you shove it in your ass```",
"```Windy: Sideboard in 1200 lands in MTGO\nShifty: that was ONE TIME```",
"```Jacqui: For reference Matt\nJacqui: wait fuck you're offline```",
"```Fluffy: you know, nya```",
"```Fluffy: monoblue suicide aggro```",
"```Shifty: that's Spud, you fucking heathen```",
"```Shifty: Fluffy, are you trying to become a vampire again for purely utilitarian reasons? We've talked about this\nFluffy: the 24 hour Bob Ross streams beckon me, huw```",
"```Shifty: Shit, what if goblins are water-soluble?```",
"```Jacqui: better idea\nJacqui: ignore flavor altogether\nJacqui: make a set w/ no flavor```",
"```Fluffy: you have three cows, there is a sports car inside one of them```",
"```Windy: Bzzt```",
"```Jacqui: Leonard of Pisa was not alive in Dominaria```",
"```Amelia: Small children.\nWindy: Don't think you'd be able to dual wield those\nShifty: That's quitter talk```",
"```Shifty: That's still more than the ideal number of krakens for a Greek set, which is zero krakens```",
"```Shifty: I can tell you from experience that the historic Welsh did not have wings and insect legs```",
"```Herzi: i want fluffy's character to just absolutely wreck these penguins```",
"```Fluffy: reverse cretio created\nHerzi: >: |\nEgg: cretio destroyed\nHerzi: >: )```",
"```Fluffy: go to bed huw\nShifty: silence, Trotsky```",
"```Krow: Nothing's out of left field in huwville```",
"```Krow: Ok MSEfam, how do I safely unclog a sink?```",
"```Fluffy: magicjudge.tumblr.com manifests in your apartment and breaks the comprehensive rules over your head, killing you instantly```",
"```Shifty: I trust this person but I also feel like they're about to garotte me```",
"```Fluffy: huw, murder is against this chat's guidelines\nHerzi: since when\nHerzi: i don't remember that being clearly stated\nFluffy: okay, you got me```",
"```Fluffy: you know I don't know if anyone's ever told you this, but you're not supposed to shave the skin part```",
"```Matt: back hair?\nMatt: monobrow\nMatt: bald spot\nShifty: Necromancy```",
"```Matt: oh look at that we have a poll tab\nFluffy: holy fucking shit```",
"```Fluffy: what really activates my almonds```",
"```Windy: Every single creature in the multiverse recognizes that you get out of the way for hot soup```",
"```Fluffy: my romantic fulfilment also consists of being humiliatingly defeated in a card game```",
"```Fluffy: you'd be forgiven for thinking otherwise but they're not all Countermagic McBetterthanyou```",
"```Shifty: The xXboxOneXx comes with a professional sports driver and costs $14mil```",
"```Fluffy: you follow a series of clues to a rock in the Mojave and you find a One With Nothing and a picture of Matt Tabak flipping you off```",
"```Windy: Megaman is legendary artifact creature - Phyrexian. All will be one```",
"```Acid: But since I'm not using protection, well...```",
"```Shifty: yeah, my name's Huw Fakelastname, the Rectangle Sheriff```",
"```Fluffy: and as long as we're doing nonsequiturs I like nipples```",
"```Jacqui: if you were like, making a set based on internet culture and memes and shit```",
"```Herzi: pizza delivery guy who i must pay with alternative means```",
"```Fluffy: Friends, episode 2200: The One With The Pardners. Huw posts an indictment of the Woody Collective and subsequently gains its attention. Colin delves into philosophical dissertation on the nature of free speech. Jacqueline writes a Van-Pires fanfiction that one of the actors reads.```",
"```Shifty: battery torch\nHerzi: stop it??```",
"```Herzi: most people don't have the means to remove matter from existence\nShifty: We're not \"most people\", Herzi```",
"```Jacqui: by activating an ability on its backside```",
"```Egg: Huw I keked out loud at work```",
"```Fluffy: the god of art has decreed it to be so. commandment 1: thou shalt not easily find art of blond young men```",
"```Egg: Friendship is awful```",
"```Krow: I mean yeah but how did you know?\nHerzi: I have my sources\nKrow: Stop talking to my mum\nHerzi: i can't help it if chit chat is made at bingo night```",
"```Shifty: Enchant judge\nEgg: Enchant Vectron```",
"```Fluffy: shit, I make better characters, and my characters fucking suck```",
"```Fluffy: that's both interesting and disgusting huw```",
"```Egg: S P O T I G Y```",
"```Grish: I is a vowel\nShifty: a concession to filthy present-timers```",
"```Jacqui: like, aether revolt has the revolutionary intelligence of a twelve-year-old wearing a che guevara shirt```",
"```Egg: Also, the song's name is \"I'm a Little Teapot\" as far as I can tell anyways, so this doesn't align with the challenge guidelines either way.```",
"```Fluffy: \"average clan has 10% homoeroticism\" factoid actually just statistical error. average clan has zero homoeroticism. Tasigur Georg, who lives on a golden throne and causes 10 000 Sultai men to question their orientations each day, is an outlier adn should not have been counted```",
"```Krow: Dicking never dies~!```",
"```Herzi: landsknecht art is a niche thing in and of itself, let alone female landsknecht art```",
"```Grish: Maybe I'll start my own shit-mse-says.txt but with blackjack and hookers\nGrish: Although I'm not sure about the blackjack\nGrish: Or hookers```",
"```Sylpha: because I was having a conversation then you relate what I say to people who eat jam are more gay\nSylpha: ANd that fucking pissed me off```",
"```Shifty: Arthur C Clarke ruined my dress sense```",
"```Fluffy: how does having sex with the witch help anything```",
"```Windy: Sorry, I don't do shrooms```",
"```Shifty: \"Now, how many acute angles can I fit into his beard?\"```",
"```Herzi: yo war is bad but hell yeah indentured servitude```",
"```Acid: Elion is themed around lands, mana and colors```",
"```Herzi: gag me daddy gouda```",
"```Korakhos: it's not made of fire, it just spontaneously combusted when they took the picture```",
"```Herzi: token is the only word that still looks like a word to fluffy\nFluffy: that's my tragic backstory actually```",
"```Fluffy: uuuuuuuuh good design machine broke\nJacqui: understandable, have an 11/11 infect```",
"```Shifty: Like, you know how a lot of fantasy heroes can use cloaks to parry swords? Same principle, but for your balls```",
"```Krow: Huw's card is beating out a nakid man in a cardboard box by only a single vote and that concerns me```",
"```Fluffy: the Uran Combine will agonizingly melt you down into a conglomeration of flesh that can only scream for its own death, but at least they're not racist```",
"```Fluffy: you see a nightcore song in your mentions. you try to find the original. you can't find it on google. you make a post on facebook asking if anyone's heard of this song. next morning, you've been banned. the ban notice consists only of the words \"it's awake.\" you open youtube. every video on the front page is \"Summertime\" by Mungo Jerry v Bluestone Ft. Skibadee. the next morning, the faint sounds of terribly clashing rap are everywhere, everyone hears them. there is a man in hideous mutton chops on every street corner. watching.```",
"```Shifty: I'm a trendsetter\nShifty: Go-getter\nShifty: Bloodletter```",
"```Krow: I ain't dying to some freaky psychic clown shit tonight please and thank you```",
"```Cajun: today is a dark day for Sarpadian Empires, Vol. VII```",
"```Herzi: amonkhet is full of ten year olds suffering from their midlife crisis```",
"```Fluffy: Fatresya except every time she has a gay thought about Ishtari she ramps faster```",
"```Krow: ye\nHerzi: et\nShifty: alright thread cancelled everyone go home```",
"```Krow: More urabrask than all but the most urabrask urabrasks```",
"```Neo: \"Choose a number. We are the chosen number\"```",
"```Windy: So one of my characters is looking for up-ness\nFluffy: the hell is up-ness\nShifty: not much, what's up-ness with you?\nShifty: hold on```",
"```Shifty: If you can beat Tim Berners-Lee at Momir Basic he'll let you add a new TLD```",
"```Shifty: if he wants people to stop joking about his output he should stop putting Donald Trump in his sets and letting his OCs create the sun```",
"```Grish: It's for UU\nWindy: That's UU\nGrish: There is a difference\nWindy: There's a difference```",
"```Matt: be my enabler\nMatt: for auroch schlong```",
"```Shifty: Yeah but I was making an Unbreak My Heart joke and then you told me to show you my card and I panicked and had to give you something```",
"```Cajun: later one wipp ne 1 bigger```",
"```Egg: Phonoi? I hardly know noi```",
"```Matt: HUW DO ME DO ME```",
"```Shifty: I love the old place but it certainly has its... let's be charitable and call them eccentricities\nFluffy: I won't be charitable, I'll just call them shit```",
"```Shifty: I may not be the smartest, but I'm pretty sure I know what the fucking sun looks like```",
"```Fluffy: no this time I'm actually going to travel to italy myself for the sole purpose of giving the evil eye to neo's grandmother\nNeo: please don't```",
"```Neo: the lower part of the breast, colloquially referred to as the underboob```",
"```Fluffy: I mean if nothing else this demonstrates exhibitionism pretty well```",
"```Amelia: And fruitcake, though I don't get to taste and critique it that frequently.```",
"```Windy: Children OP```",
"```Neo: bird has tity because of THE REFRANCE```",
"```Fleur: tossing you an updoot```",
"```Fluffy: no one buys my shadow self so now it's just lounging on your sofa, eating all your currywurst and conspiring with Stevie to prank you```",
"```Krow: Daily reminder that geese are terrifying```",
"```Fluffy: I turned myself into a mindflayer, Agathi! I'm Mindflayer Arto!```",
"```Cajun: Whip the X's, Punch the O's\nShifty: What they're smoking, no one knows```",
"```Egg: Okay I can't get behind the werewolf sex first of all```",
"```Egg: Pro tip: necrophilia is 70% less weird if you're already cold and dead on the inside```",
"```Egg: we're still allowing the squirrel, eldrazi, cat, and construct to heist together which is a flavor fail anyways```",
"```Shifty: Netfuel Ecan't Rmelt Fsteelbeams\nCajun: No Energizer Reveals Foundations\nHerzi: Nerzi Eerzi Rerzi Ferzi\nEgg: Nario Eario Rario Fhuw```",
"```Fluffy: my least favourite star wars movie is all of them```",
"```Cajun: aw i was too slow somebody did hypodermics on the shore```",
"```Fluffy: *wears vibeo game t-shirt in concerts and doesn't shave* ah yes. prog rock```",
"```Matt: the salmon population is expected to recover by 2019```",
"```Amelia: If there's one thing a planeswalker hates, it's a shattered plane.```",
"```Neo: i'm going to WRITE\nNeo: now what the hell was going to happen in the beginning again```",
"```Herzi: blog via vlog but the vlogs are star wars scroll style and also are privately listed but used as youtube ads```",
"```Fluffy: sir daniel fortesque is obviously a liberal trying to reform monarchy from the inside```",
"```Fluffy: do not fuck the sexy knife```",
"```Shifty: It appears we've been scrombled, lads```",
"```Jacqui: the chat should have a rule against putting down the family golden retriever```",
"```Liz: DO ME NEXT, JACQUI```",
"```Neo: sorry but i don't have a lot of opinions about boobs. i'd say perhaps half a dozen?```",
"```Krow: No huw, Dash really loves you too```",
"```Egg: I'm blowing bubbles with chewing gum and it keeps popping all over my beard```",
"```Herzi: unless they go straight in the mouth\nHerzi: that's fifty points```",
"```Herzi: <<squadron hawk>>\nCajun: uh oh```",
"```Shifty: I drank a moth :(```",
"```Matt: My butt is nice and bouncy```",
"```Cyber: Fucking bring it, meatbag :P```",
"```Sylpha: treefolk make saproling```",
"```Cajun: this is what happens when people have thing names instead of people names```",
"```Cyber: I'm throwing money at the screen but the download won't start.```",
"```Neo: i was playing alpha protocol (you can already see my mistake here).```",
"```Fluffy: Fuck//Champion```",
"```Shifty: > sexiest woman alive\nShifty: > not a picture of Glassdust Hulk```",
"```Liz: May you rest in piss```",
"```Herzi: maybe you should include your home address in case they want to get in touch with you, personally\nHerzi: and social security number```",
"```Fluffy: fuck you for making me grieve a goddamn origami spider```",
"```Shifty: (also, the ascend is a downside against me, because, if you control ten or more permanents and one of them has ascend, I get up and leave)```",
"```Windy: Mono-black splashing black```",
"```Herzi: CHABBENGE BISSING```",
"```Herzi: but i'm back now and posting pretty young women on main```",
"```Herzi: without knights huw would sweep me off my feet and ride me bareback```",
"```Cajun: a pog-earther```",
"```Shifty: THAT'S THE DICK ANIMAL!!!!!```",
"```Fluffy: what if I put the counter on the player anyway and defined standard```",
"```Neo: i think i remember blowjob priest but what is chastity priest again```",
"```Herzi: deepweb hitman\nHerzi: it's like four words, but not```",
"```Fluffy: timespiraled milks a walrus```",
"```Oddsbod: sifting through terabytes of generic CGI stuff and shitty fetish hentai```",
"```Oddsbod: \"when death opens the door, man door hand hook car door\" --popular saying at orzhova```",
"```sdfkjgh: Nowadays, we'd just say that removing your clothing doesn't actually use the stack, so it can't be responded to.```",
"```Neo: Gardevoir was in the same set as Donald Trump```",
"```Sylpha: And I have fucking pissed```",
"```Fleur: This looks like tide but a hot steaming pile of shit```",
"```Shifty: 2020 presidential race: Oprah, Zuckerberg, The Rock, and Reuben Covington\nHerzi: and Jeb!```",
"```Cajun: why would you insult that poor dog's mustache\nNeo: i regret that with all my soul```",
"```Shifty: Featuring Dante from the Devil May Cryptofascist (TM) series```",
"```Cajun: According to all known laws of aviation, a two-tailed squirrel should not be able to fly.```",
"```Neo: fun fact: i am prone to having a stuffy nose and used to have asthma as a kid, so if i was into not being able to breathe properly, i'd probably be constantly horny. i mean, even more so than usual```",
"```Krow: Fuck man, can you imagine if Magic had interesting and complex main characters?\nCyber: Sure I can. I just have to go onto this discord or the forums.```",
"```Krow: DON'T HUWVE! ITS VISION IS BASED ON HUWVEMENT```",
"```Krow: THE ONLY WHITE PEOPLE IN THE MOVIE WERE THE WHITE PEOPLE AND THAT SUCKS```",
"```Krow: I have an issue with the smoochies```",
"```Neo: it refers to smashing faces together. yes... faces, obviously```",
"```Herzi: i'm not a fan of the logistics of profiteering```",
"```Jacqui: i am like stone cold steve austin if stone cold steve austin was an attractive female twentysomething who is sexually attracted to firetrucks```",
"```Herzi: you get bonus points for succintly defending a position that is obviously wrong, so they can hire you to cover their tracks when they mess up```",
"```Windy: Don't mind the walls of this ship\nHerzi: eyES ON T HE INSIDE\nFluffy: he just told you not to mind the walls, come on```",
"```Neo: all 'walkers are problematic```",
"```Fluffy: word on the street is Kalev Lovag stole bones from a cemetery for witchcraft purposes```",
"```Fluffy: is a loxodon not entitled to the cooling properties of her own ears```",
"```Herzi: 2tb of sid pictures on my external hard drive```",
"```Shifty: Kekai Kotaku```",
"```Umisa: Did you mean anal circumference roll?```",
"```Korakhos: I'm currently in that project: make a set with no flavor, no counters, no mechanics.```",
"```Fluffy: takes off clothes\nFluffy: takes off skin```",
"```Sylpha: Cretio created except it is cretio created```",
"```Shifty: I make one Obris nude alternate for every day the update isn't posted\nShifty: And each one has progressively worse typos```",
"```Herzi: somewhere, monogreen jund wakes in a cold sweat```",
"```Fluffy: I like how this implies that being a goblin 1) is a crime, 2) is considered a single deed and 3) stacks over time as the goblin just exists```",
"```Jacqui: actually it's\nJacqui: Specter\nJacqui: fucking leafwater scum```",
"```Neo: to be honest i'm not sure we have thicc humans in mtg either```",
"```Herzi: strip me down sakon\nKrow: I'll make you forget how to wear clothes```",
"```Korakhos: you know you start off nicely, a little bit of foreplay, then someone draws a pentagram and shit hits the fan```",
"```Ketsuban: Moist Mardu```",
"```Shifty: I wasn't going to shit it, I'm trying to shit myself less```",
"```Fluffy: the incel flamberge user vs the chad katar user```",
"```Sylpha: Trible\nSylpha: Give that card a trible```",
"```Cajun: misty legs```",
"```Matt: quick, a Saproling name!\nFluffy: Saproling```",
"```Cajun: Vorakhos```",
"```Fluffy: me for smash 2018\nFluffy: fluffy Brings the Death```",
"```Egg: seminal\nShifty: (heh)```",
"```Fluffy: do it or I print a card in my next set specifically to be something you hate\nKorakhos: \"A thousand ways to motivate people\" by fluffydeathbringer```",
"```Herzi: i live in a hellscape trapped with this veggie kink man```",
"```Fifth: just... getting a grindr hookup, having them come to your house, cook you a pizza, and then putting your feet up on them like a table as you eat it in front of them then just... \"get out of my house\"```",
"```Tamiyo: fuck: More evidence is needed to answer your query.```",
"```Amelia: As a corollary, I don't think it's possible for a song to have \"gangsta\" in the title and be at all good.```",
"```Fifth: don't kinkshame, fluffy. different quacks for different whacks```",
"```Shifty: I'm going back in time to that contest and giving myself a Vulcan nerve pinch so I never design Vectron and all this bullshit never happens```",
"```Egg: destroy all creatures that aren't flaccid```",
"```Fifth: idiot pig sorceror no wonder he gets his ass kicked by a Forever 21 employee every few thousand years```",
"```Krow: Banding (fuk)```",
"```Egg: I surrender because I want to, not because 300 pounds of pure muscle are bearing down on me```",
"```Cyber: To be fair, Obris is pretty attractive if you ignore everything he says.```",
"```Neo: Mmm tasty hair spaghetti```",
"```Jacqui: everyone here is like \"ugh why won't this sexy serial killer abduct me and make me her love slave\" but when I abduct men and crush them under my heel until they agree to be my eternal love slaves the cops come```",
"```Egg: A SINGLE EYE\nShifty: BLINDED BY BAD```",
"```Cajun: how do i even react to a conspiracy\nKorakhos: tinfoil hat```",
"```Cajun: Quick question, are orphans classified as animal companions?```",
"```Fluffy: tilt at this windmill motherfucker```",
"```Krow: and then we went to the grocery and then we went to the park and then we ate lunch and then we slayed ro'gothul the destroyer and then we got ice cream```",
"```Herzi: i wish i could get vored by the barn but alas```",
"```Shifty: It's a simple rock-paper-scissors: empath foils hat, hat aggravates monarchist, monarchist accidentally seduces empath```",
"```Fluffy: rowdy on mythic\nFluffy: absolutely rambunctious on mythic```",
"```Halian: I like Seer's Glass ._.```",
"```Neo: Whenever you gravecycle or discard a card, <effect>```",
"```Shifty: gears covered in masala sauce. Delicious```",
"```Jacqui: i will dominate you for $19.99 USD. this is NOT a joke.```",
"```Sylpha: Pizza is a pie\nFluffy: fuck dude it sure is```",
"```Fluffy: spill that tea, huw's mom```",
"```Cyber: Also, I now inflict two shots every time I speak, thanks to VRD@12:24.```",
"```Cajun: as long as you aren't dealing with absolute monsters, babies are the ultimate equalizer\nCajun: everyone hates them but doesn't want to say it out loud```",
"```Fluffy: two radhas\nFluffy: four thighs```",
"```Fifth: those boobs belong to neither the snake half or the cat half\nFifth: my rage is incalculable```",
"```Jacqui: WU tim spiral```",
"```Egg: this is a card I like\nKrow: this is a card\nCyber: this is\nJacqui: the story of a girl```",
"```Shifty: lose deathtouch and cannot have, gain, approach, or be in the same zip code as deathtouch```",
"```Cajun: the database is 1 line that's 11.2 million characters long```",
"```Herzi: sometimes ya just want to feel pretty in the privacy of your own god damn home, egg```",
"```Jacqui: i am very aware saying \"tolkien inspired settings are bad\" in an MTG chat is an unpopular opinion\nJacqui: several people are typing```",
"```Neo: Well, Jane 57821, you are a dirty computer, but you steam a good jam```",
"```Shifty: We gotta make sure the metal doesn't get fucked by encasing it in a nice thick layer of feta```",
"```Fluffy: ...fuck I should've said \"with one eye\" or \"without depth perception\". shit. fuck```",
"```Shifty: You felt your Sakons crawling down your back.\nFluffy: stop crawling down my back I haven't showered\nKrow: Stop putting me on people's backs huw```",
"```Matt: \"Charles, is it night or day\"\nMatt: \"No fucking clue\"```",
"```Fleur: whisper photomanip and sakon arrives, eyes burning with anger\nHerzi: herzi following close behind, menacingly holding a wiffle bat```",
"```Neo: too much nonmenstrual blood```",
"```Shifty: No I do not remember the \"Donald Duck is too hot\" conundrum, and once I've finished typing this message I'm going to forcibly forget it\nKrow: The only way Donald Duck would ever be too hot would be in an oven set to 350° for 45 minutes```",
"```Fleur: then she shows them the latest political cartoons on Occupy Democrats\nFleur: and they die```",
"```Cyber: Weaponized nerdsniping?```",
"```Jacqui: rl stine\nJacqui: ernest cline\nJacqui: trouble in the suez```",
"```Fluffy: hot take: most nuts are mediocre in taste```",
"```Herzi: [Yoshi-Yoshi] Yoshi Yoshi```",
"```Herzi: My next one will cost one grande and explode on your bedside table and require a dongle```",
"```Shifty: everyone on this server is a minor variation on the same person, the Ur-CMer\nJacqui: hey joseph campbell\nJacqui: shut the fuck up```",
"```Jacqui: rhode island isn't real```",
"```Matt: ah yes France\nMatt: inspired by Gary Gygax```",
"```Neo: Shout out to when Huw was Several people```",
"```Matt: well firstly, thats the manga Im reading and yeah thats hentai```",
"```Cyber: \"Nancy Drew and Zombies\" with wind waker style graphics would probably sell.```",
"```Neo: that jacket may not be objectively bad, but it does look bad on Phil```",
"```Krow: WHAT THE FUCK IS THIS\nKrow: IS THAT GOKU```",
"```Shifty: Mario has a great narrative because my choice not to jump when I'm supposed to jump has a genuine consequence in that I die```",
"```Jacqui: i think jesse mason put it best when he pointed out that all these are built around how players enjoy magic when a fairly large contingent of magic's audience doesn't enjoy magic as all\nCyber: Oh, like you.```",
"```Egg: I mad respect anyone who would want to put their face anywhere NEAR my ass but I super don't want it ate```",
"```Fluffy: it's him... john skyrim...```",
"```Fluffy: you're right, we actually osmose food through our butt cheeks```",
"```Fifth: the chat's collective parents, sitting playing Bridge and talking about sane things: oh yes, children these days sure are diverse and imaginitive\nFifth: huw, windy and fluffy, emerging from the table like demons from Hellraiser: cucumber discourse```",
"```Neo: what if a necrosavant broadcast an image of the lunarch in his undies to all of thraben thanks to a zombie radio network```",
"```Cyber: Tensor Product or bust.\nShifty: God, I love Kraftwerk```",
"```Shifty: ah yes, the C19 walker suite: Ajani, Tezzeret, Marsala, Lackeybot, and Pelakka Wurm```",
"```Cajun: so Flash isn't a good keyword cause you can't grant it with an Aura```",
"```Shifty: My invisibility not working against polar bears doesn't mean shit if I'm in Morocco```",
"```Shifty: why does everyone want me to make a set that's literally just The Office with pentagrams```",
"```Cajun: Google keeps giving me alcoholics anonymous```",
"```Cyber: Like, is it okay for me to play Elixir of Immortality control if I'm doing it \"as a satire piece\"?```",
"```Jacqui: raven man\nShifty: take me by the hand```",
"```Egg: I'm too straight to be gay```",
"```Cajun: you can't suppress my attack on titan squirrel explorers forever jacqui```",
"```Sylpha: None of the male pornstars I chat with on twitter followed me back```",
"```Egg: I'd love to get with Times but I think he's straight```",
"```Cajun: capsaicin is actively poison but the spice must flow```",
"```Shifty: All sets support 4-color if you believe in yourself```",
"```Egg: it turns out I'm kind of a uwu guy```",
"```Pipsqueak: Hufflepuff is UwU```",
"```Jacqui: you can have extort on anything if you're not a weenie```",
"```Oddsbod: if you hold it in your mouth while breathing in gulps of air you can detect a distant earthy taste of evasion```",
"```Egg: turns out this album is Zootopia furry porn but at least it has a couple of usable foxes```",
"```Zephyr: What language is MSE built in again?\nMatt: Ancient High Elven\nMatt: with a bit of Draconic```",
"```Zephyr: When you make hot dogs, make sure to get some honey djan mustard```",
"```Jacqui: we're talking spy fox from those cd-rom games from the 90's? he was arguably pretty sexy```",
"```Shifty: I can eat food with actual flavour in it now\nEgg: so you're leaving England??```",
"```Matt: I want to colonize so bad```",
"```Herzi: no ecosystem to fuck on mars so what's the damn point```",
"```Fluffy: what is a verista\nShifty: I think it's the person that makes you coffee at Starbucks\nFluffy: no, that's a vestal. a verista is the act of checking whether or not something is true or valid```",
"```Shifty: I don't shit myself unless someone tells me to```",
"```Fluffy: chat, what loadout should I use for huw's nan```",
"```Fluffy: tfw one year ago you were going to the mall with your buddies but now you're wielding the light of the stars themselves to straightup erase motherfuckers from reality and living each day within the horrors of war```",
"```Fluffy: \"okay, I've spent a good chunk of my life being an awesome warrior. what's my afterlife\"\nFluffy: \"you become a fucking lock. have fun with that. shithead\"```",
"```Shifty: the Shiftyverse is actually starting to look a bit less incestuous now```",
"```Cyber: The three Cs: Core Sets, Cars, and Commander Products.```",
"```Neo: Right so the good thing is that such a page does not currently appear to exist. The bad news is I found out about the Piss Christ```",
"```Shifty: lemme just whip out my Peace Knife```",
"```Neo: i have no idea what a garlic knot is. (mind you, until you said it, i had no idea what a furry knot was either)```",
"```Sylpha: is the tony the tiger twitter still up?```",
"```Fluffy: if you or a loved one listens to taylor swift you may be entitled to financial compensation```",
"```Herzi: Your Valid Stat is ever changing and decided by GM discretion```",
"```Herzi: You have two cows. They're being ridden by attractive women. It's a joust.```",
"```Jacqui: you have two cows, which is BULLSHIT because you should have two llamas instead and everyone else is a fucking idiot```",
"```Egg: how do you lose excepttocomboandaggro```",
"```Grish: I thought Drake Winter was some fringe magic player who got really good at the format```",
"```Fluffy: revs up katana\nCyber: I have several concerns.```",
"```Jacqui: huw when will you make a set about a demonic war studies professor named Kenjamin Madrigal```",
"```Neo: It's the zodiac sign between virgo and vriska```",
"```Shifty: I mean, it's not really uncommon but honestly who the fuck cares because this challenge is bad and there is no God```",
"```Fluffy: anybody in this thread smoke weed\nCyber: No but I know some people who do, I could pass on a question if you have one.```",
"```Cyber: Tezzeret isn't actually a cryptocurrency guy.```",
"```Jacqui: fluffy is bad >:(\nFluffy: that's what I've been telling people but no one listens and it's fucking weird and bad```",
"```Neo: welp i'm dead. guess my face is on my torso now. also i have a ghost flag and am understandably grumpy```",
"```Egg: I listen to exclusively the Bring it On! Broadway Musical soundtrack```",
"```Fluffy: I support your endeavours of getting screwed```",
"```Egg: did someone say PANGOLIN\nFluffy: constantly, in my head```",
"```Jacqui: i have ascended towards blip boop blip boop bzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzt chk chk chk BWMMMMMMMMMMMM fdfdfdfdfdfdfdf HEY aaaaaaaa```",
"```Matt: SCARAB GOD! THE MUSICAL```",
"```Shifty: God, London has produced so much good music, and Coldplay```",
"```Jacqui: i made a mistake\nJacqui: oh shit slave children```",
"```Korakhos: I can totally see Fulmen screaming Turn Down for What```",
"```Fluffy: italy's free real estate```",
"```Fluffy: now I just have the mental image of your dad in a suit, tossing raw meat at his coworkers```",
"```Neo: their cards (Jodah and Mairsil's, not Jodah and Neil Gaiman's)```",
"```Egg: How do I ass```",
"```Pipsqueak: Shaharazad should accompany me into my cellar, where I have a fine wine to show to her```",
"```Fluffy: godot coming fifteen minutes late with starbucks```",
"```Kino: hi huw what the fuck are doing awake past 2 in t```",
"```Shifty: Does this make me someone's Peppa Pig OC\nShifty: Huw Human```",
"```Shifty: Anyone who dislikes Chicken Run is banned from the forums effective immediately```",
"```Pipsqueak: Hey, Smash Mouth is a good band```",
"```monger: also I thought that gif said boostio and spent a solid 10 seconds trying to figure out what lucio had to do w a red alien weewee```",
"```Fluffy: you can arouse the wolf at instant speed```",
"```Shifty: my wallet is telling me no, but my body... my body is telling me yes```",
"```Fluffy: the watermaker, seeing a purified phage\nFluffy: \"o hai jeska\"```",
"```Fifth: So who else is really dissapointed that Ariana is getting married to Pete\nFluffy: what's a pete\nShifty: Pious Pete, from Runescape```",
"```Shifty: yeah, you're right, this is completely unplayable in Commander, the only Magic format that exists and the one all cards are primarily designed for```",
"```medusa: Design a Modern Counterspell variant\nPipsqueak: Legally speaking Gorgon, I think huw is allowed to kill you```",
"```Neo: Show morphsuit, cheese, or I will take away your voice with my dark magic```",
"```Neo: The most brutal wild animal is actually Boar Vessel, 600-500 BC, Etruscan ceramic```",
"```Grish: On the upside, the new Ravnica worms don't look like penises\nNeo: How is that an upside```",
"```Cajun: need this with more paper and less russian```",
"```Neo: Me, crashing into battle with a floating disco ball construct to appease my fans: \"are you ready, motherfrickers!?\"```",
"```Neo: Joel Travolteon is the best disco sniper in the Multiverse```",
"```Shifty: jawcuck```",
"```Cyber: See, that's the thing about big corporations. They love sending you those... uh... cease to desist letters? Not gonna lie, this joke looked a lot better in my head.```",
"```Fluffy: vote pope disaster 2020, everybody!```",
"```Neo: Chadgrath```",
"```Fifth: but still like. gorgon pussy. does it have snakes???\nJacqui: you know all this talk about gorgon vagina makes me shake my head. why can't we talk about wholesome things in nsfw radha thirst party? such as, spitballing here, our non-sexual fluffy desires to gaze lovingly into the eyes of an actress from a gothic horror themed power rangers clone of the 1990's and hear her tell me i deserve love and affection?```",
"```Neo: Harper: How to use ubiquity to stop orcs from revolting. Who the fuck is the stonesire. Obscure books that are bad enough to be hilarious to immortals who have already read all the good ones and all the popular bad ones. [27 redacted extremely explicit searches] Aqueducts but like for cheap and they work. How to invent new liquors. Purring sphinx network. Latest Uran Combine experiments. List of abominations that can't be killed with fire...```",
"```Korakhos: and you probably wouldn't enjoy Shal'Draen's butt stuff\nFluffy: does it involve fire\nKorakhos: a lot\nCajun: It's like eating peppers in reverse```",
"```Shifty: I am going to kill Descartes\nKorakhos: bad news buddy...```",
"```Neo: Ahah! Well, I guess my time travelling plague doctors were a set too early!```",
"```Shifty: \"deals 1 damage to Target, the superstore chain\"```",
"```Fluffy: and if you have trouble with a certain color there's always outsourcing```",
"```Korakhos: Mat'Selesnya is three kids in a trenchcoat```",
"```Egg: wow how the fuck did they not catch this\nEgg: fluffy would catch that at 3 am while half-plastered```",
"```Fluffy: cyber please do not date the genocidal mind-vampire```",
"```Korakhos: The Parent Trap but with shifty and God instead of Lindsey Lohan```",
"```Neo: after much time spent examinating the pokemon type chart i concluded that i am not a pokemon and do not have one```",
"```Kino: target player gains -3 life```",
"```Kino: paper maro: the thousand-year storm```",
"```Herzi: horny for obris is the best thing to come out of the battle boards```",
"**Etrata, the Silencer** {2}{U}{B}\nLegendary Creature - Vampire Assassin *GRN R*\nWhenever Etrata deals combat damage to a player, exile target creature that player controls and put a hit counter on that card. That player loses the game if they own three or more exiled cards with hit counters on them. Etrata's owner shuffles Etrata into their library.\n**3/5**",
"```Cajun: It wasn't the Planeswalker hat or flock of geese that crossed the line, it was unattributed quotes```",
"```Cajun: We all lose the Game.```",
"```Fluffy: winnie the pooh is honestly kind of annoying\nJacqui: shut the fuck up eeyore```",
"```Herzi: New cotw prompt: make a card boring enough to put shifty to sleep```",
"```Egg: winning is for cucks```",
"```Pipsqueak: It's one of those things that shifty invented\nPipsqueak: Archons```",
"```Pipsqueak: You are the bandit queen / swinging lethal for 19 / you are the bandit queen / kill them fast and do it clean / Oh yeah```",
"```Herzi: shifty keys\nShifty: If you press me five times I stay down```",
"```Egg: the aliens came, and they were racist```",
"```Herzi: Me and fluffy laising on extravagant couches carried by our adoring masses, throwing grapes at each other for dominance```",
"```Egg: I keep getting wet as I brush my hand across parts of my body but I can't figure out which parts of my body are actually wet```",
"```Egg: I got 860 kg\nEgg: is my scale broken?\nEgg: I mean, it certainly is now```",
"```Egg: this card is an EDH house\nPipsqueak: Ah, yeah, it truly is\nPipsqueak: Sorry, dunno what I was thinking, there is only one true format```",
"```Shifty: Cajun lives out in Tony Hawk's American Wasteland in a lean-to made of those oversized cards they put in LGSes, with Lackeybot and a cat who continually refuses naming```",
"```justnobody: The wild life of Cajun Avenger, dirt boy of Tornadoland```",
"```Shifty: day 23. Matt and Cajun caught a turtle today. Lily still won't leave his room. Lackeybot has died of influenza```",
"```Herzi: then the dalai lama vomits up the remaining $1.15```",
"```Shifty: Jesus Christ why did I let you people have keyboards```",
"```Fluffy: john madden is very sexual```",
"```Egg: whenever a zone you control dies,```",
"```Neo: my internet was assaulted by dragons sorry```",
"```Neo: Ghastly Mild Inconvenience```",
"```Foggy Harry: I know what you're thinking: \"Did he cast six counterspells or only five?\" Well, to tell you the truth, in all this excitement, I've kinda lost track myself. But being that I have two untapped blue mana, the most powerful mana in the world, which could turn your spell right back to aether, you've got to ask yourself one question: \"Do I feel lucky?\" Well, do ya, punk?```",
"```Grish: It's technically 8 lines so it meets my standards I can't officially condemn you for it\nGrish: But dear god does it make me want to shank someone in a back alley```",
"```Windy: At least Elon Musk is pretty consistent about being an anime girl```",
"```Ziolang: Why consider the details or design of something when you can just meme it out```",
"```medusa: Cretio is a plane made out of mixolydians```",
"```Herzi: does \"i'd fuck me\" count as a yugioh quote or...```",
"```Neo: Huw is now vore\nFluffy: hm. bad```",
"```Fluffy: the woman who looked at new phyrexia and went \"this is a good and cool thing actually, I want jin gitaxias to be my new daddy\"```",
"```medusa: don't drink and type\nmedusa: even if you're drinking tea```",
"```Grish: Honestly that's just really aesthetically pleasing to watch\nGrish: Not even for the jiggling boob part```",
"```Pipsqueak: He wasn't wearing a Kevlar condom? What a pleb```",
"```Matt: Welcome to voring```",
"```Neo: Wind, how is Japan relevant to dirt clown Satan```",
"```Korakhos: can a cyborg help a lich change and grow as a person?\nFluffy: find out in Matters of Grave Importance, the new romantic dramedy coming soon to a theater near you```",
"```Cajun: Update, all that's at the dirt source is a pile of gravel\nCajun: Think I've been sent on a snipe hunt```",
"```Cajun: mse honors the yoink system```",
"```Herzi: Me, carving my name and ideals onto hayley's comet: get fucked```",
"```Shifty: the Dimir equivalent of that flashy pen thing from Men in Black is just a pencil sketch of Lazav's junk```",
"```Windy: In general, breathing acid is bad```",
"```Egg: it's like a compromise\nEgg: except one where I win and everyone else is unhappy```",
"```Pipsqueak: Fifth, you are atypical amongst venomfuckers```",
"```Cyber: Ah yes, the very notorious Tranquil Giraffe Style.```",
"```Fluffy: I too end my name in ass when I join new churches```",
"```Cajun: Remember it with this simple mnemonic: Abjesularur```",
"```Neo: man door tap land Hot Springs```",
"```Egg: Enspirit (Sac creature reduce cost leave battlefield return creature hand hook car door)```",
"```Egg: [[Donald Trump]]\nLackeyBot: Demon of False Promises {3}{B}{B}```",
"```Fluffy: tubular. my first royal edict is to abdicate the throne and fuck off to herd goats or w/e```",
"```Fluffy: the ambient energy from the ciders I've purchased has seeped into my brain before even cracking any of them yet, apparently```",
"```Fluffy: can't believe the entire plane of lorwyn is trans```",
"```Neo: > not wearing a full body Kevlar condom```",
"```Matt: Czar. G. Optibus```",
"```Cyber: Arcanum Reforged\nCyber: Arkaynum Reforged\nCyber: Kaynum Forged\nCyber: Kay Forge\nCyber: Keyforge```",
"```Satel: you guys can't make me use protection```",
"```Herzi: no references only card```",
"```Fluffy: fish fillet breaks apart when biting so either I bite off more than intended or I collect bits off my lap like booboo the clown```",
"```Pipsqueak: Not doing anime this cube```",
"```Pipsqueak: Shaharazenfreude```",
"```Shifty: I need mess to function\nShifty: It's like shitty Feng Shui```",
"```Kino: today i was given this Sword Art Online mousemat for free and i still feel like i paid too much for it```",
"```Kino: my guess is \"good\" people in the alignment chart sense are characterised by optimism and goodwill and that is also their flaw, that they believe the world to be better than it is and so never consider the possibility that the question is cruel and deceptive. they simply dont believe anybody would lie about horse teeth```",
"```Windy: The amount of ways you can prepare rice is astonishing\nHerzi: you can boil it. you can eat it raw. you can... boil... it```",
"```Kayiu: That message should be framed\nKayiu: The Taco Bell one not the conservation of mass one```",
"```Shifty: Find an IHOP. The smaller branches work best. Go there on the third Thursday of May. Bring $3.75, no more, no less. Slap the change on the counter and ask for Rebecca. A man named Greg will answer. Order a fillet steak. He will give you a massive hunk of cheese and a receipt with a QR code. Scan that code. You'll be taken to a YouTube video. It's three hours long. Let it play. Do not heed the calls of the Red Voices. Then check your email.```",
"```Cyber: Time to redesign the crow!```",
"```Fluffy: microwave stopped working so I'm eating a cold kebab microwave meal defiantly\nEgg: fuck yeah\nEgg: live your truth\nFluffy: stopped halfway because I love myself\nEgg: fuck yeah\nEgg: live your truth```",
"```medusa: aa o truc\nKino: aa o truc\nShifty: aa o truc\nHerzi: aa o truc```",
"```Matt: Say hello to Carl\nDecembra: hi Carl!\nShifty: Hello Carl!\nFluffy: where's my fucking money carl```",
"```Neo: Both sort of reference the Last Supper. None of them reference ham and cheese sandwiches, unfortunately```",
"```Cajun: Provoke (Your opponent's creatures can help block this creature. Each creature you untap as this creature attacks makes it more blockable.)```",
"```Fluffy: does... does a classic wednesday night in east london typically involve furries killing each other```",
"```Decembra: is that a shark\nDecembra: a shark with a zippo\nShifty: Shark merfolk!\nmedusa: Sharkfolk\nmedusa: Shrekfolk```",
"```monger: I'm confused, why bother with pants?\nShifty: Need somewhere to keep my sideboard```",
"```Cajun: finally ham patch```",
"```Herzi: 1.111 patch notes\nHerzi: - we recognize we added too much ham\nHerzi: - we have not fixed it\nHerzi: - we will not fix it\nHerzi: - ham```",
"```Shifty: If you die at the circus, do you die in real life?\nCajun: not in my experience```",
"```Neo: Not just dick butt... Dickbutt mail, the successor of e-mail\nSylpha: D-mail coming after e-mail just feels wrong.```",
"```Fifth: IMMORTALITY is STORED\nFifth: ...\nFifth: in the TITS```",
"```Amelia: Now, seatbelts, those taste pretty bad.\nAmelia: And I would think balls probably taste a lot like seatbelts, just with a different texture.```",
"```Fluffy: \"can't remember anything. welp, time to become a nudist pirate\"```",
"```Fifth: vagina hands are just a little too much```",
"```Korakhos: loss works in every angle!```",
"```Shifty: \"No, it's fine, I've flown plenty of rocs before, it's not like this is anything I can't - and I've lost control of it already. CAPTAIN!\"\nShifty: smash cut to opening credits```",
"```Cyber: The Dimir are basically the Vriska of Ravnica.```",
"```Shifty: Korakhos killed the radio star```",
"```Egg: I think I just lost my virginity to that Tamiyo```",
"```justnobody: Who the heck is Vriska?```",
"```Korakhos: Windy's translation of Japanese makes the cards sound as if they were written by Tommy Wiseau\nAmelia: You're tearing me apart, Nikya!```",
"```Neo: Kawasaki Luigi, who is both a kind of motorcycle and the newest JoJo antagonist```",
"```Windy: Tchaikovsky, what the hell```",
"```Cajun: what is the definition of god if they can be mortal```",
"```Fluffy: immortality is stored in the anti-tits```",
"```Cajun: there's a certain awe that an 8 billion/8 billion trygon predator inspires```",
"```Shifty: me, cackling with fevered glee, apparently: IGNITE THE DISCOURSE BRAZIER```",
"```Windy: See, I like showing just how big my thing is```",
"```Fluffy: I feel like if you're assassinating someone, it helps to not have really distinctive crystal horns sticking out```",
"```Shifty: Surprisingly, Britain's only ever had one PM assassinated\nJacqui: AMERICA HAD FOUR\nFleur: Weird flex but okay```",
"```Egg: my coworker tried to name it the \"dangly\" but I was able to compromise```",
"```Jacqui: i love your big dongle egg```",
"```Egg: Britain's claim to fame is that they're worse at sexual assault than America```",
"```Cajun: plagiarism and murder both legal :3c```",
"```Cyber: Doesn't really seem in character for Jesus, though.```",
"```Pipsqueak: Fifth confirmed for Yoshi (sorry Yoshi, you don't commit enough tax fraud to be Yoshi)```",
"```Cajun: i wasn't expecting to see a kraken dancing the macarena this early in the morning```",
"```Herzi: you're all banned for politically charged crimes and also the murder of archduke ferdinand```",
"```Jacqui: Peter's Study 2WW\nJacqui: Enchantment - Archive (rare)\nJacqui: Hey Lois, remember when I shuffled the top five cards of my library into a face-up pile?```",
"```Cajun: that's my secret pip\nCajun: i'm always @bad and shameful```",
"```medusa: the incredible force of chandra's bowels```",
"```Windy: Huh\nWindy: Nuts are good```",
"```Krow: I can't believe you have the audacity to use the yugioh gods, phyrexian mana, and graveyard order in the same set```",
"```Neo: kino's one of the cool kids, what kind of lame murder cult wouldn't invite him in, smh```",
"```Shifty: Since Tom Clancy has now been dead for six years, I propose that the games bearing his name are transferred to people with vaguely similar sounding names\nShifty: - Hugh Dancy's Ghost Recon: Wildlands\nShifty: - Nancy Reagan's H.A.W.X.\nShifty: - Ted Danson's Rainbow Six: Siege```",
"```Fluffy: two girls, chilling in a planeswalker card, one side apart cause they're not gay```",
"```Amelia: I feel like I am not worthy of this blender.```",
"```Neo: wow can't believe waluigi is the selesnya parun```",
"```Egg: seven mana cards aren't limited issues\nEgg: thanks for coming to my TED talk\nPipsqueak: Griselbrand at common in my next set\nPipsqueak: thanks Egg\nEgg: wait```",
"```Matt: what's a monodrama\nHerzi: One person shows up at the kissing booth with mono and it spirals from there```",
"```Fluffy: this is why I eschew dating in favour of forming parasocial relationships with eastern european municipal leaders```",
"```Herzi: also im sitting acroas from a guy with a manbun in a plaid short sleeved short, swim trunks, socks n sandals, and whos reading a well worn copy of the anarchists cookbook and im clearly seconds away from being trapped in a portlandia skit\nShifty: I feel like I've met this guy at a traffic light party```",
"```Pipsqueak: The league playerbase is nowhere near as bad as it was 3-4 years ago\nFluffy: present company excluded```",
"```Krow: speaking of vore\nKrow: what the fuck```",
"```Matt: Maybe the clowns at my show will murder me\nMatt: Who knows```",
"```Herzi: Eggo's dead\nCajun: this is what happens when i mute serious```",
"```Herzi: its just held back by pikachu quoting atlas shrugged every time he uses a move```",
"```Fluffy: chuck e cheeses were banished from finnish soil by a crack team of vodka shamans in 1955\nFluffy: every year we renew the ritual```",
"```Fluffy: it's too late. I am already hollering to passersby in beijing about the ancient mysticism```",
"```Cyber: I regret that union busting has become my legacy.```",
"```Cajun: he did attack Ravnica for the lulz\nFluffy: that's gamer culture\nFluffy: it was a heated gaming moment```",
"```Grish: 2 is 3.\nCajun: okay that's going three far```",
"```Jacqui: i have a B.A. in D.\nJacqui: that's me spelling BAD\nJacqui: i have no bachelors in penis```",
"```Fluffy: I'm exclusively romantically attracted to mediocre webcomics from the 2000's```",
"```Fluffy: siri how can I put live crabs in matt timespiraled's apartment send tweet```",
"```Pipsqueak: Kino you never fail to impress and mildly disgust me```",
"```Egg: oh if it tastes like sage, it's probably a locust\nEgg: Which as I understand means Ra has cast a plague upon you```",
"```Fluffy: how do you type with talons\nCajun: i put on boxing gloves first```",
"```Fluffy: I'm only into 69-year-old throat singers. 68 or 70 is a no go and if you're a yodeler I will personally murder you```",
"```Shifty: I'm online right now anyway\nShifty: Watching\nShifty: Waiting\nShifty: Shitting```",
"```Fluffy: I'm a tim allen main, his toolbox is just too diverse```",
"```Fluffy: man it still fucks me up that hebrew has no vowels\nPipsqueak: gt fkd\nFluffy: --hebrew teachers, to their students```",
"```Egg: I'm sorry my desire for consensual missionary sex is cramping your style fluffy```",
"```Matt: and if he deems you worthy, you get shat on```",
"```Matt: I think snorting capsaicin is a good way to die```",
"```Matt: I know some kids who snorted rock candy and yeast\nMatt: that did not go well for them```",
"```Neo: The word 'eventually' personally shanked me with a knife in a dark alley then hoisted me up a crucifix```",
"```sdfkjgh: I wonder if they'll actually follow my headcanon, borrowed from elspethsunschampion.tumblr.com, and reveal that Ral is bigtime unrequited gay for Jace.```",
"```Shifty: Catch me in eight hours having finished Steel Refrain, entirely fixed the railway, and systematically catalogued and eaten every single pastry in the Costa round the corner```",
"```Herzi: cmon tingles do me dirty```",
"```Shifty: someone give me back my crown of poo```",
"```Fluffy: there are no pancakes in canada. they were hunted to extinction in 1995\nMatt: And yet, I ate one two days ago\nFluffy: that was a really dedicated performance artist```",
"```Cajun: time to slap seeing Athena wearing a diaper on my \"suffering for the art\" list```",
"```Jacqui: thank you all for letting that message say \"poops\" for ten whole minutes unedited without tagging huw```",
"```Pipsqueak: That's actually why they killed Socrates\nPipsqueak: He kept yeeting the children```",
"```Pipsqueak: Please do not fuck your horse```",
"```Matt: \"Body odor is just another way for me to win. Can't lose if my opponent chokes to death\"```",
"```Cajun: devart if you could please just give me art of machinery and not mice dressed as french maids```",
"```Herzi: no questions allowed, only omniscience```",
"```Gurf: That feel when Mark Rosewater is just Todd Howard spelled backwards```",
"```Krow: A haiku for you:\nAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAA```",
"```Krow: Do you pack an assload of extra underwear on the off chance you shit yourself every day you're on vacation?\nEgg: I'm going for four days, so... yeah I'm gonna need 18 pairs\nEgg: one for each time I have diarrhea, plus one for every time I wet myself, plus two to wear on my head in case I run out of hats```",
"```Matt: In the meantime, please refer to Herzi if there are any issues\nHerzi: youre all banned for ten days to avoid any problems```",
"```Herzi: some guy in burger king, crunching nuts: do you know where the nearest playstation is?\nHerzi: me: uh, like where to buy one?\nHerzi: him, still nut crunching: ...\nHerzi: me: theres, uh, an eb games in the bay center down that way?\nHerzi: him: ... (leaves)```",
"```Krow: You met a god\nKrow: Be lucky your nuts were spared```",
"```Fleur: redshifting?\nFluffy: it's when you cut the red stripe off your colgate toothpaste and snort it to get high```",
"```Krow: Kuvira is also hot\nSeveral people are typing...```",
"```Matt: Finally watching Kong Skull Island\nMatt: I'm actually really enjoying it\nHerzi: does it have style\nMatt: Style, as in?\nHerzi: does it have grace\nMatt: uh\nHerzi: does this kong\nHerzi: have a funny face```",
"```Krow: I did not have sexual relations with that emrakul```",
"```Fluffy: in this universe you're impeached for not having sex```",
"```Pipsqueak: Do people have any name generators they like?\nCajun: behold the $namegen\nLackeyBot: Edl Etrpixtactreek Uhx```",
"```Neo: dildo woman sounds wild, if not extremely helpful```",
"```medusa: My drinks are produced by Pepsi Co. Ntract from Below Ltd.```",
"```medusa: Monster is basically gamer girl pee```",
"```Cyber: Yeah, I bet your dirt-science boss wouldn't send hitmen to keep people from blowing you up.```",
"```Grish: That would be quality shit if it wasn't so politically charged```",
"```Cajun: that's why our lord lovecraft invented the apostrophe```",
"```Amelia: Everyone knows there are only three genders: boy, girl, and goat.```",
"```medusa: someone pat me with a hammer```",
"```Pipsqueak: oof and boston are synonyms, this works```",
"```Herzi: hatsune miku is the wanderer```",
"```Fifth: oh also all your nagas have quadruple snake titties and thats just something i must oppose from a moral standpoint```",
"```Fluffy: cursed by... what\nPipsqueak: Australia\nFluffy: fair```",
"```Shifty: aaaaand it's Inattentive Toast coming around the back straight, keeping pace with Lethargic Crumpet, Lethargic Crumpet, gaining on Bipolar Jacket Potato, but it's Hallucination Pringle now! Hallucination Pringle, coming up on the inside!```",
"```Krow: catching up on everyone's latent sonic fetish has been a treat, thank you```",
"```Herzi: His fingernails erupt from my mouth like a locust swarm```",
"```Jacqui: i have no flaws\nJacqui: where is my position of power\nHolmishire: is lack of power not a flaw\nJacqui: jeez ayn rand chill the fuck out```",
"```Egg: fuck you jerry\nEgg: be more real```",
"```Cyber: DO NOT USE A SAXOPHONE TO SMOKE THINGS```",
"```Kino: oh boy homestuck updated!!! whats oviposition *googles*```",
"```monger: cat, snuggling deeper into the cavity of your ribcage: if I fits I sits```",
"```Egg: I had a dream last night that I punched a baby so hard it turned back into a fetus```",
"```Pipsqueak: @Sept'rakul reminder 12 hours say a slur```",
"```Pipsqueak: Catholics are automatically kosher```",
"```Shifty: [S] Shinji: Get in the fucking server.```",
"```Matt: I\nMatt: Am\nShifty: Hesiod, God of the Buns\nMatt: Dying\nMatt: FUCK```",
"```Fluffy: italian schoolgirls are ultimate lifeforms```",
"```Cyber: I unironically want those & thats not a good thing.\nFifth: the cargo hotpants or the anthropomorphic wolves\nCyber: The hot pants.\nCyber: Do I look like a furry?```",
"```Amelia: Whoever pulls Sorin out of the rock will become the king of Innistrad.```",
"```Herzi: the village people extorted my humble dispensary just last week```",
"```Neo: yeah i only speak lemonade```",
"```Herzi: in this metaphor the dog is furry gandalf```",
"```Herzi: in thirty four thousand years our micro-meteor ravaged probe will reach the least valid 6 year old you ever knew and hopefully get him right in his face```",
"```Windy: So question\nWindy: Who's this Sasuke and why's everyone choking him?```",
"```Shifty: You: this milk is past its use-by date\nShifty: Me, an intellectual: c h e e s e m i l k```",
"```Gurf: you and I have different tastes fluffy\nMatt: not everybody likes it soft\nGurf: The only thing that priest likes soft is his ice cream```",
"```Neo: More logically sound than the blowjob deckbuiilding hypothesis at any rate```",
"```Kino: had no idea what to make of this when i saw it in general since \"Strongbow Dark Fruit Fiasco\" accurately describes my entire college experience```",
"```Fluffy: if you getting laid more often will make you stop posting cursed image/phrase combinations then I will make that my life's work like a paladin\nKrow: Calm down there horn dog\nFluffy: oh I won't be doing it. I'll just be killing a bunch of people with my paladin sword```",
"```Egg: luckily I am entirely unaffected by laws regulating how one can and cannot have sex\nEgg: so nyehh```",
"```Fifth: the trick with laptops is it has to be dry\nFifth: so no lube```",
"```medusa: no, sorry, circles ain't kinky\nFluffy: not with that attitude```",
"```medusa: I don't wanna get political or anything but what the FUCK is a billy joel```",
"```Shifty: I can confirm that I only ever give critique immediately after orgasm because otherwise my brain replaces every other word with a randomly chosen kink```",
"```Jason: But anyways like I was saying, Medusa is like an anime girl with cat ears, but nagas are like the full on cat girls covered in fur with feline appendages.```",
"```Pipsqueak: Yet another card art ruined by fish nipple```",
"```Jacqui: unrelated question pertaining to a dollarhit - when the fuck did i write about wanting to fuck speed racer\nJacqui: what did i see in his smooth anime ass```",
"```Jacqui: stop\nJacqui: i will stab you guys for free\nKrow: Oooh Jacqui's prices have gone down```",
"```Egg: Yeah but he's in a skin thong so I'm good w it```",
"```Herzi: there's like a 50% chance the mermaid just drowned your gf```",
"```Pipsqueak: that's also not her whole ass\nPipsqueak: My apologies for anyone who I misled```",
"```Grish: Open your own LGS\nGrish: Work 60 hour weeks\nGrish: Work yourself to the bone\nGrish: Don't make dividends\nGrish: Fail to make ends meet\nGrish: Mortgage your house in an attempt to stay open\nGrish: Lose your house\nGrish: Spend every last cent on that store\nGrish: Invest your blood, sweat, and tears\nGrish: And then watch as it slowly burns to the ground\nGrish: As you stand in an alley across the street with a can of gasoline, hoping that they won't catch you and prevent you from getting your insurance money```",
"```Cajun: that was not the content i was expecting to be labeled Warning LEGO```",
"```Sylpha: it brings into question is amount of pants```",
"```Herzi: Matt Tabak, mecha pilot```",
"```Cyber: (I'm sure we'll get the hang of gay mouse dads eventually, it's just going to take a lot longer.)```",
"```Cajun: like if you got on a bus and saw a guy in nothing but a bathrobe and holding a fireman's axe, would you\nCajun: a) ask him about his day job\nCajun: b) call the cops\nCajun: c) find a new bus route\nCajun: d) find a new city to live in```",
"```Cyber: ... y'know, I can't argue with napalm.```",
"```Cyber: Regardless of the century, plane, or species, developing writers never fail to invent the Homestuck.```",
"```Cajun: it's god vs cyber in a battle of wills```",
"```Korakhos: he also killed dabbing, but that was more merciful than anything else```",
"```Cajun: do not lewd cthulhu```",
"```Cajun: dark confidant except every time you cast a spell it dark confidants 20% faster```",
"```Korakhos: But then Wind realized he screwed up the numbers\nKorakhos: And the difference became unsalvageable\nKorakhos: But then Wind realized he screwed up the numbers\nKorakhos: And the difference became unsalvageable\nKorakhos: And the difference became unsalvageable\nKorakhos: And when you leave you return to whenever you were\nKorakhos: But then Wind realized he screwed up the numbers```",
"```Herzi: Jace Beleren is a valid homestuck kid name\nFluffy: your interests include ERASING YOUR OWN MIND WHENEVER YOU DO SOMETHING AWKWARD, dating DEADLY DAMES OF SUSPECT MORALITY, and MORRIS DANCING.\nHerzi: >Those interests are awkward. Better start again.\nHerzi: You wipe your memory.```",
"```Krow: til I'm chandra's fursona```",
"```Krow: my superpower is making police shift uncomfortably in their seat```",
"```Popcornia: you know if a drug addict can exploit the universe to go infinite I think they deserve to```",
"```temawimag: Dude I fucking hate when I go to whack a spider and suddenly it turns into a volcano.```",
"```Kino: what a good design\nAys: not edh playable\nAys: tsk tsk\nKino: what a shit design```",
"```Matt: <<azusa, lost but streaking>>```",
"```Krow: Are we fetishising Matt again?```",
"```Herzi: oh no\nHerzi: his fingers are wearing airpods```",
"```Herzi: Theresa May is tournament viable```",
"```Gurf: Did you just assume I didn't want to fuck the krasnok?```",
"```Egg: I agree that it's prime shit but also 20% of our shits read exactly like that and we gotta diversify the portfolio to keep people coming back```",
"```Herzi: fluffy doesn't shitbait because all shitbaits are just trying to emulate fluffy's natural state of being\nHerzi: do you accuse a wolf of being a furry```",
"```Umisa: card design: [kar d dee sine] - V, the act of being better than WoTC```",
"```Fifth: He is performing MUMMIFICATION\nFifth: My kink alarms are shooting through the goddam roof```",
"```Shifty: DO NOT HURT THE TRAINS\nShifty: you MONSTER```",
"```Pipsqueak: now to design a good equipment\nCyber: Consider... gun.```",
"```Krow: oh god you're going to make me doom blade an otter\nMatt: The guilt will win me the match```",
"```Satel: storm crows forever? how broken can that be?\nCyber: Alfred Hitchcock, probably```",
"```morgan: Im team spaghetti```",
"```Jacqui: Simic are just Izzet with Mountain Dew instead of Doritos```",
"```Krow: I'm very upset you've put these words in my brain to bounce around for all eternity like the DVD screensaver\nKrow: But you're not wrong```",
"```Fluffy: the metaphysical concept of loyalty to another world-travelling entity goes great with ketchup```",
"```Neo: but to be fair it wasn't a full on \"holy shit\" but \"holy heck\" seemed too mild\nCyber: Ah, see, that's what \"holy balls\" is for.```",
"```Kino: what the fuck is a draft\nEgg: it's when the military tells you to go die for Big Oil```",
"```Fifth: ooof that orphan is hideous```",
"```Cyber: TIL space is made of horses.```",
"```Pipsqueak: it's more of the filthy tempo player in me\nPipsqueak: fish tiddies ain't really my thing```",
"```monger: there's no fun in interpreting statements correctly\nmonger: especially if \"correctly\" means \"without penises\"```",
"```Jacqui: ok so the white/black/artifact one was always gonna be noir themed. but WHAT IF - the red blue green one is based on romcoms and MGM musical comedies\nFifth: your mind horrifies me```",
"```Krow: I don't really know what my deck's doing but I'll be damned if I let your decks do anything```",
"```Fluffy: never say the word waifu again and I will grace it with my RW\nEgg: I made a new RW bridefu just for you```",
"```Krow: I hope you're ready for my secret technique pee fingers```",
"```Matt: what is happening\nGrish: Life, liberty, and the pursuit of tax evasion```",
"```Sylpha: why is all the male vampire art chiselled men\nSylpha: I want some skimpy dressed pretty boy vampires\nSylpha: without nipples```",
"```Krow: Wow nagas being medusa's fursona was not a take I was expecting to read today but here we are```",
"```Gurf: furries are reinstituting slavery\nGurf: looks like it's time for the gamers to rise up```",
"```Korakhos: Phyrexnun```",
"```Cajun: Bombadil is a bit like finding a lost book of the Bible where Jesus goes surfing with Thor```",
"```Jacqui: would you tap jesus```",
"```Herzi: Why have you put a primarily blue artwork in a BG frame\nPipsqueak: to hurt you in particular```",
"```Cajun: some days i wish i wasn't a hat```",
"```Cajun: Emrakul's true weakness\nCajun: A kindergarten playground```",
"```Neo: Children should be allowed peaceful childhoods unless they make me want to throw hands with them. Then anything goes```",
"```Cyber: If you ask a small child if she's an undercover cop, she has to tell you```",
"```Cajun: fortunately, hats and interns are exempt from that rule because they aren't real people```",
"```Jacqui: elves are fuckin forest nazis```",
"```Herzi: fluffy, sharpening knife: no parents in fiction allowed, fucker```",
"```Fleur: Young Pyromancer isn't young\nReality Glitch: Errata.```",
"```Matt: And the draft begins\nKrow: you've been in the US for like 11 minutes and already been conscripted into the military you poor thing```",
"```Fluffy: is olive garden a pvp enabled zone```",
"```Shifty: I don't understand why this poorly animated cow adds more impact to your statement but it does and I kinda hate that it does```",
"```Windy: Yeah but then you have to smell it```",
"```Neo: It's like an infinity gauntlet but instead of Thanos snapping it's the peanut butter bones```",
"```Herzi: my oversized kinky kneecaps```",
"```Pipsqueak: JN's combo being illegal has never stopped him before```",
"```Windy: Surprisingly, humans can have children```",
"```Kino: unrelated but what mechanical effect would you associate with being punched in the dick```",
"```Amelia: Imagine how much more square dancing with 60-year-olds I'd be doing if I didn't like my family.```",
"```Krow: A post apocalypse where we're all just too sexually aroused by robots to do anything wasn't a point I was considering today but here we are```",
"```Jacqui: i will ping every single person in this server one by one\nJacqui: and i will not stop\nJacqui: until you watch my video of a badly animated cgi baby shaking its diapered ass to the sweet strains of blue swede's \"hooked on a feeling\"```",
"```Simon: I now have the image of a pregnant lich in my head\nCajun: hide the phylactery in the womb```",
"```Popcornia: How long do you think it will take till we get a card with the FT making a joke about clapping ass cheeks (and alerting the guards)\nmedusa: While I nodded, nearly napping, suddenly, there came a clapping```",
"```monger: Virgins can't block Chads.```",
"```Shifty: I'm putting \"bishrekual\" on my OKCupid profile effective immediately```",
"```Windy: You could phone up the queen of England if you wanted to.\nWindy: Though if the response is taking too long you might get slow played```",
"```Cajun: 1-800-COCAINE sounds like the opposite of a help line```",
"```Amelia: FAIRIES!! (spasms)```",
"```Shifty: Might see if I can draft some shart designs too, who knows```",
"```Jacqui: Flametongue Kavu is just two eunuchs in a Godzilla suit```",
"```medusa: proper mythics:\nmedusa: 1. mox\nmedusa: 2. big```",
"```Fluffy: I am currently banned from a triple-digit number of airports. that's the price you pay. for success```",
"```Fluffy: finally, Rerun van Pelt joins the Wizards Cinematic Universe```",
"```monger: poll: which karn looks the most like a snack```",
"```Cyber: WOULD IT FUCKING KILL YOU TO DRAW A WOLF THAT'S NOT PARTIALLY OBSCURED BY A NAKED WOMAN?```",
"```monger: got that spongebob squarepants thigh gap\nShifty: You're right, but please never call it that again```",
"```Gurf: wait you don't have a bachelors in penis\nGurf: I thought I finally found a kindred soul```",
"```Shifty: (yes, I am still auditioning for a full-time position as Judith's hype man)\nKino: whats hype man a euphemism for here```",
"```Krow: I would love Aloy in overwatch. Honestly a lot of 3rd party characters would be cool in overwatch\nmonger: mario\nKrow: you're right I take it back\nmedusa: waluigi\nKrow: back on the table bois```",
"```Jacqui: what the fuck no\nJacqui: not everything has to be about krampus```",
"```medusa: As an additional cost to cast this spell, sacrifice 2,500 Russian soldiers```",
"```Fluffy: olive garden is a multiversal constant```",
"```Herzi: Lucien, eating an entire human person: so, want to do this again next week?\nHerzi: Sevid, cramming breadsticks into her pockets as she leaves: mhmm mhmm yeah bye```",
"```Matt: If we do granny, we need to do her now```",
"```Grish: I\nGrish: Waht\nGrish: But why\nGrish: Why is Thomas Edison superhero Ajani```",
"```Cyber: Okay, I'm a bit late, but I just realized this is exactly socialism but with dicks instead of money.```",
"```fluffy: in my tabletop game if you want to level up you must twerk well enough that your god is satisfied```",
"```Windy: Don't unionize your hogs```",
"```Mako: i drink sonic's bathwater, which is just day old pepsi blue```",
"```Jacqui: a triathlon but instead of biking running swimming it's biking running stabbing```",
"```Jacqui: me, guzzling carton of milk two years past its expiration date: suck it capitalism```",
"```Pipsqueak: its also what I say every time I am forcibly transformed into a cockroach as a metaphor for antisemitism\nPipsqueak: which has only happened twice but I'm glad I had a word for it both times```",
"```Fluffy: this not having \"until eot you don't lose this mana\" is homophobia```",
"```medusa: dragons of tarkir but there are landlords instead of dragons```",
"```Fluffy: have any of you actually had spotted dick, if so, is it any good```",
"```Kafkaesque: horses are just vehicles that can take a shit```",
"```Kafkaesque: imagine having your clothing removal countered and never being able to take your jeans off again without risking DCI sanctions```",
"```monger: (dr stuff is also on sale)\nCajun: what is dr stuff\nCajun: \"Discover the life of Dr Greenstuff, grow marijuana, coca, make meth, drugs and more\"\nCajun: i feel like not this```",
"```BluesEclipse: ...I kind of feel like the equip ability should somehow have split second?```",
"```Shifty: And this was despite a policy I adopted quite a way in of never shitting myself unless told to```",
"```Kayiu: Edge is an acronym for \"Edge Dark Grim Edge\"```",
"```Cajun: that man stole 9000 grams of children\nCyber: That's, like, one or two babies tops.```",
"```Fluffy: YOU POSTED CARDS?```",
"```Windy: 7 is not a color```",
"```Cajun: where do i get these magic adventuring pants\nMatt: Just ride the fucking bronto buckaroo```",
"```2wb: Well I would but he\n2wb: ate\n2wb: all\n2wb: of\n2wb: the\n2wb: cupcakes```",
"```Herzi: fifth it took me a good five seconds to even understand what i was looking at as my brain desperately tried to put me in a coma for my own safety```",
"```Egg: I'm a cat testicle savant\nEgg: And Garfield does NOTHING for me```",
"```Herzi: live laugh hill giant```",
"```Cajun: stay safe out there\nCajun: and whatever you do, don't nuke the hurricane\nWindy: Sorry, you said nuke the hurricane?\nWindy: I can't hear you over the hurricane```",
"```Pipsqueak: Matt, chugging expired milk: Glad I'm wearing this blindfold, otherwise this would be gross```",
"```Shifty: Expired milk shit #2```",
"```Satel: Actually using cumulative upkeep sounds cleaner```",
"```Cajun: is that saddam hussein in a santa costume giving the finger to jesus and some chinese soldiers\nEgg: It's...\nEgg: Yes?\nHoop_Thrower: it works for many settings!```",
"```Cajun: TIL i'm the yaoi fanset person\nCajun: now to figure out what yaoi is\nGateways: no dont```",
"```Kino: so yeah thats how the creator of steven universe introduced me to yaoi when i was 12```",
"```Matt: I just deep throated a dildo to the hilt```",
"```qui: woody could not be contained by pants\nmonger: oh pleasant surprise```",
"```Neo: In three years' time you should be able to legally profit from murdering Stephen King as long as he's fictional```",
"```Krow: ayn rand vs a stack of pancakes like god intended```",
"```Shifty: 1:49. Alexa is playing Africa by Toto. I am only just vertical. Goodnight all```",
"```Parasign: No, see, they're a hybrid race. Like Merfolk.\nParasign: Half human and half road```",
"```Windy: - Spider (state of being, subject)\nWindy: - What (question)```",
"```Matt: Quick Cajun\nMatt: Help\nMatt: you need to change the admin/mod's names to cheese cause I dont have permission```",
"```Herzi: things were better back in the days when gutter clowns ripped childrens' arms off```",
"```Cyber: They told me I might get to work with an oxygen atom someday. That'd be nice.```",
"```Amelia: I came up with the idea for that while on the toilet, and then I named it after my wi-fi network.```",
"```Krow: Feel like asking deviant art for art of a 14 year old child is like wading through radiation looking for super powers```",
"```Windy: Please don't, we have enough kittens already without our EPIC members getting pregnant with more of them```",
"```Herzi: handprint albino babies are a universal constant```",
"```Matt: 420 Maze It```",
"```Kayiu: also my giraffe parentage wasn't by choice```",
"```Schism: i stopped when he smothered a woman in her bed\nHerzi: yeah thats teddy bear in pool season```",
"```Schism: ah yes, the descent into darkness\nSchism: slutty chickens```",
"```Jacqui: English teachers think poetry is worthwhile so that's how you know they're liars\nFifth: i cannot describe in words how incredibly i disagree with you\nFifth: english teachers have PLENTY of other reasons they're liars```",
"```Fluffy: at least no one's getting vored or fattened into the shape of an orb\nFluffy: count ya blessings\nPopcornia: Im glad we all can sympathize with this problem```",
"```Grish: brb going to learn how to draw so I can flood the #tit tag on artstation with birbs```",
"```Kino: is it acceptable to have a card with decay in the name thats mono g if its about rapping gorrillas```",
"```Pipsqueak: Chalice becoming an Elk then becoming a farmer\nPipsqueak: Character arcs```",
"```Fluffy: guess I'm liveblogging reactions to the translation choices of a disney yaoi amv now```",
"```Herzi: its an unhealthy relationship but i keep coming back\nSchism: don't worry i have a safeword```",
"```Fluffy: I am speedrunning volaria, the category is donair%```",
"```Simon: If it were DeviantArt he would be pregnant and someone would be licking his feet.```",
"```Egg: I don't deserve this my puppets are cool```",
"```Herzi: google is in the pocket of big mana```",
"```Cajun: forgot what day it was until I went to taco bell and got nachos from sailor moon and a horse```",
"```Schism: the food network channel thinks i'm \nSchism: a) catholic\nSchism: b) old enough to die```",
"```Tyrant: I'm just waiting for LackeyBot's giant rant```",
"```Cyber: All right, time to print blue Valakut!```",
"```Windy: I mean\nWindy: The pikachu's head is inside a bird at the moment```",
"```Cyber: ... actually, there's a cleaner way to apply this effect with coin flips, hang on.```",
"```Cajun: do you wanna build a migraaaaine```",
"```Cyber: There's a recurring theme in my life where every time I think one of my problems cannot by solved by lasers, I'm abruptly reminded that with sufficient lasers in the right places, it can be.```",
"```Fluffy: when you fuck time you get pregnant pauses```",
"```morgan: the real treasure was the milk we lactated along the way```",
"```Herzi: OoOOooo one of your tentacles slipped past my defenses uguu~```",
"```Herzi: what kind of man needs four feet sprouting from his crotch. thats twenty toes. thats too many genital toes.```",
"```morgan: Norman Reedus pees everywhere```",
"```kino: you can stab a kraken you cant stab the abstract concept of theft```",
"```crush: I FINALLY DID IT CAJUN\ncrush: I FIXED THE DAMNED THING\ncrush: Apparently I didn't fix it @cajun```",
"```Cajun: shifty you gotta tobyfox it up\nPipsqueak: live in andrew hussies basement?\nFifth: I did that for a gap year before college```",
"```Cajun: Radical ({T}: This creature does an ollie.)```",
"```morgan: never mind! tahngarth is still not very good```",
"```Shifty: this implies that Grothama has fucked and that there may therefore be more than one Grothama out there\nShifty: I wonder how that makes Egg feel```",
"```Mako: i couldnt come up with a big brain sharuum quote at 3 am so my mind went \"what if vore humor\"```",
"```Pipsqueak: I'm somewhere between 2 and 4\nCajun: maybe one day science will invent such a number```",
"```Cajun: i don't think i want to eat the sun or moon```",
"```Emily: Is Baby Yoda a loli?```",
"```Shifty: A 90° angle from what\nOcco: (You know exactly what)\nFluffy: from me```",
"```Pipsqueak: I'm always a slut for a world record\nPipsqueak: I assume, at least\nPipsqueak: this is a largely hypothetical situation for me```",
"```Shifty: Ashiok deals damage to target Ashiok equal to Ashiok's seat number on the down with cis bus```",
"```Cyber: How do I sign up for the War on Christmas? Do I just buy a boombox and burn a CD of I Had A Little Dreidel [1hr Dubstep Edit] ?\nHerzi: you have to kill santa```",
"```Egg: that was actually the second forum rule ever\nEgg: no oil fracking```",
"```Cajun: all images of oil fracking are banned and he's UNHAPPY```",
"```Cyber: hrrgnh cyan im trying to design cards but im dummy thicc and my fifth through ninth lines of text keep alerting Reuben Covington```",
"```Windy: If you need to make some happy, send them fluorine. It's an oxidizing agent so it'll take all the negativity away.\nPipsqueak: Oh, wow, thanks. This is gonna solve the problems I've bene having with city government```",
"```Pipsqueak: I play with a trackpad\n 2wb: how\n2wb: this is a legitimate question \nPipsqueak: it's like rock lee with the weights```",
"```medusa: chandra likes decidedly male gideons \ndecidedly male gideon likes being indestructible \ndavid guetta and sia created the song \"titanium\" in 2011 which isn't indestructible but is close enough and decidedly male gideon likes it\n2011 is also the year new phyrexia came out with cards that depict robots also made of titanium maybe \nnew phyrexia gave us the infect mechanic which became the focus of a modern deck famously piloted by tom ross who also is decidedly male\ntom ross worked on modern horizons which was a mistake much like the war of the spark novels so far \nif you look at the lands in modern horizons and horizon canopy itself a majority of the lands tap for green mana\nnissa likes lands and green mana (so much that she pretty much ruined standard with them)\ntherefore chandra and nissa are still a thing guys greg weisman is a literary genius```",
"```Schism: from what i hear there's not a lot of subject matter in this book\nAmelia: Sure there is.  Lesbians aren't real, everyone is actually Lazav, and Kaya doesn't care about planeswalking rules.```",
"```Cyber: Every color gets a ten-drop!\nCyano: what are red and white's ten drops?\nCyber: Like I said, every color gets a ten-drop.```",
"```Schism: wolverine fought my dysphoria in a denny's parking lot```",
"```Pipsqueak: Ginger Ale is my friend\nPipsqueak: even if I only drink it when I'm ill or on an airplane\nSchism: same\nFluffy: me, currently snorting powdered ginger ale: can't relate```",
"```morgan: cajun and i are on the same wavelength re: fucking\nCajun: you can't just say these things morgan\nmorgan: listen, when i first entered this server you were talking about photoshopping diapers onto merfolk```",
"```Cajun: i'm glad i've been the diaper merfolk guy in your head for the last few months```",
"```Cajun: i'm not sure if the digivolving, the boomer, or the animorphs cover is supposed to be the desirable part of this```",
"```Cyber: Yeah, obviously. But \"this is what hellfire tastes like\" is an incredibly tempting sales pitch.```",
"```Herzi: in s6, Seinfeld sets out to recover the tome of al qurait```",
"```Cajun: all of the glass bowls in my house are missing\nCajun: i suspect mischief```",
"```Cyber: I need a site that's to artstation as artstation is to deviantart.\nSchism: i think that's going into an artist's house```",
"```Fluffy: those calves are real tho because his perpetual running from his responsibilities counts as leg day```",
"```medusa: when you die in magic you die in real life```",
"```Krow: Huatli, jumping through the color wheel with reckless abandon: parkour```",
"```kino: im sick of reds limited flavour expression so im expanding it with gnome tribal exhibitionism```",
"```kino: jerseys a channel island thats technically not part of the uk and yet my hentai countdown video is still blocked there```",
"```Tyrant: Are you calling Oko a thot?\nTyrant: Because, like, fair```",
"```Cyber: You and I remember Wikipedia very differently.```",
"```Cyber: Winter Veil will be responsible, in the early 2030s, for creating Winter Winter.```",
"```bagz: I tap my forest for a green and my honey for a yellow and i play silly old bear```",
"```Matt: I printed the pdf guys\nMatt: it broke a Staples photocopier\nMatt: My day couldn't have been better```",
"```Matt: Every day it's a miracle a child is not launched through a second story window```",
"```medusa: let's make boob banks a thing\nSchism: tits-for-tat```",
"```Cyber: The real question is, would you date the Wanderer?\nSchism: yes\nSchism: wait\nSchism: sorry i was thinking of the raven man\nSchism: who's the wanderer```",
"```Cajun: I mean the more accurate analogy would be 'I have a book from Buddha that's an account of the fall of the Martian civilization'```",
"```Schism: (now it's istanbul)\nShifty: (not Constantinople?)\nSchism: (been a long time gone, constantinople)\nPipsqueak: kills four dudes in a donut shop\nShifty: Man, that song goes way differently to how I remembered```",
"```Shifty: Creature - Motherfucker Unlimited```",
"```Kayiu: if you don't play by the rules Jim Uno teleports into your house and fucking stabs you```",
"```qui: I can't believe Sorin Markov is a lesbian```",
"```TEST: What the fuck is wrong with all y'all```",
"```Kafkaesque: why is the elephant Arnold Schwarzenegger```",
"```Pipsqueak: Well the good news is that isn't castable\nPipsqueak: The bad news is if Dredge ever casts it, I think they kill you instantly```",
"```Kafkaesque: i am not here to question the sexuality of fox-riding elves, i just know they charm me```",
"```Mako: disclaimer my art style is dA sonic erotica```",
"```Herzi: @Pipsqueak you're in the pocket of big tomato?```",
"```Schism: Also I feel the need to specify that Im talking about hot gay men```",
"```Windy: See, the pro strat is to study the use of the book as a blade```",
"```Windy: And the harmony says \"I'm Bb Major\" and the melody says \"I'm F Mixolydian\"\nWindy: And considering the two together says \"I'm a mess\"```",
"```Fluffy: and at what point will we begin the anal bead jumprope```",
"```Cajun: i'm too distracted by the alphabet```",
"```Emily: twas\nmedusa: brillig\nEmily: and\nGorg: the\nEmily: slithy\nmedusa: toves\nCyber: did\nWindy: not\nmedusa: kill\nWindy: any\nEmily: geese```",
"```Shifty: I didn't realise what that was for a moment and I thought the solution to green was \"make cars and be extremely racist\"```",
"```Windy: Not that anyone draws blondes that aren't in questionable positions anyways,  but the few that don't also don't draw them as cryomancers\nCajun: this is how i learned how to dye people's hair```",
"```Cajun: pretty sure you either transcend or die at that point\nHoop_Thrower: there's no downsides!```",
"```Schism: there are some things the squad needs to be here for and that's putting assholes in their place and omageverse jokes```",
"```Shifty: I thought you were talking about Ramona Flowers the band and briefly wondered why a Bristolian indie band was playing at a noted kink event and why this was relevant to Pip\nPipsqueak: ......there's a lot to unpack here\nShifty: I get that a lot```",
"```Cyber: ... I feel like there's something fundamentally wrong about a straight Jesus expy.```",
"```Cajun: i play the ace-until-proven-otherwise card\nShifty: Sir, I'm going to have to ask you to leave this casino```",
"```Krow: i've never even been to maine\nCajun: this is a lie, as texas has been owned by maine since 1973```",
"```Cajun: they make pot tokens\nPopcornia: We are not doing medical weed```",
"```Fluffy: furiously trying to come up with a hydra-based voting pun```",
"```Herzi: ive got a game concept to run by yall if thats alright\nSchism: shoot\nHerzi: a persona game but with the characters and aesthetic of animal crossing\nCajun: the characters and aesthetic of animal crossing can sell me many a pitch\nHerzi: fursona 6\nCajun: i'm out again```",
"```Schism: i acknowledge it, have a sensible chuckle, and then move onto the important stuff\nSchism: namely how can i make friends with as many animals as possible```",
"```Matt: The fires of revolution arrive with a resounding wet splat```",
"```Egg: my mom is uwu```",
"```Kevin: How many times has Norman Reedus pissed so far?```",
"```Pipsqueak: onsen episode in nicol bolas' meditation realm```",
"```Fluffy: what if we wanted to kiss... in the deadlock trap... but couldn't because we were running out of air... and we were both girls... and it was actually platonic all along...```",
"```Pip: Im on a bus\nPip: And its dark and raining outsid\nPip: And were just rolling through the Pacific Northwest\nPip: And I feel like Im a loading screen for something\nPip: Kinda love it```",
"```Schism: don't zombies fart tho```",
"```Schism: anyway if any of y'all listen to spotify and know what the podcast that talks about the racist origins of cheerleading is called please hit me up```",
"```Kevin: Actually wrong, she ended up rebounding with Dionysus, god of raves and lean```",
"```BluesEclipse: Huh... you'd think I'd notice these picotornados or zeptobales of cocaine hitting me every second.```",
"```Pipsqueak: kino, please don't make a horny set```",
"```Herzi: The fourth, the fifth, the minor fall and the major lift\nHerzi: The horny king composing Hallelujah```",
"```Shifty: You really gonna tell the tentacle lady not to be lewd```",
"```Popcornia: I just wanna see some middle aged lesbians kiss\nPipsqueak: and tentacles are good```",
"```Krow: Any child that gets carried off by a balloon deserves it```",
"```Neo: I haven't measured my height in years.\nAmelia: I would hope not.  You usually measure that in feet or meters.```",
"```Krow: \"ur feet, maam\" - the swamp```",
"```medusa: slimefoot: cocks fungun```",
"```Schism: i love this\nSchism: humans of new york\nWindy: I mean no, this is London\nWindy: And mice\nAndrea: venn diagram```",
"```Pipsqueak: Satel, your god is mostly mediocre```",
"```Grish: Tickets to a hatsune miku concert?\nWindy: Ticket singular but yes\nWindy: (So like, if you're trying to assassinate me, you know where I'll be)```",
"```Grish: I don't mind shitting myself here because I wasn't the funny part```",
"```Shifty: The crow to tangerine exchange rate is the new Big Mac Index```",
"```Cajun: escort missions probably get better when its your girlfriend but get far worse when she's panicking about commiting a double homicide```",
"```Matt: Sorry, normally I would but im in the middle of the jungle```",
"```Simon: Bow came out of the forehead of the larger and more powerful dad```",
"```Egg: we didn't come this far to care about the cow```",
"```Simon: Nebuchadnezzar implies the existence of a Nebuvirginezzar```",
"```Matt: what's wrong with vore```",
"```Herzi: the tornadoes are handing out fevers now?\nCajun: yea haven't you been hearing about the coriolis virus```",
"```Herzi: if i give a gaggle of preschoolers a series of increasingly sharp sticks and tell them to roam the halls i havent made an army\nHerzi: ive made a standing garrison and also a mistake```",
"```kino: sorry googlicker if you want my deviantart search history youll have to pry it from my cold dead hands```",
"```Herzi: what a practical mouth```",
"```Matt: phantom fucking cheetos\nPipsqueak: that's the one with the tarot cards, right?\nMatt: sure is```",
"```Andrea: Now to be fair\nAndrea: I do believe 1 cat could defeat me in single combat```",
"```Cajun: the virgin fblthp vs the chad humongulus```",
"```fluffy: or utilize the forbidden third technique of doing research on bars```",
"```Pipsqueak: also Schism when you flavor the furry, tell me what their skill set is```",
"```Simon: Mountain dew gives me the same symptoms as a fever```",
"```Simon: At the risk of sounding rude I doubt your local pizza hut gives a shit```",
"```Simon: she has a dangerous case of elf ears```",
"```LackeyBot: [Colorless] Multicolor Matters```",
"```medusa: I'm not sure if the chant was a murmur of protest or an incantation supposed to summon Sheldon to personally decapitate me.```",
"```Cajun: how does one become unstuck from canon\nkino: me after i light the fuse of my 18th century artillery before realising the cannonball has gotten caught around a loose thread from my waistcoat```",
"```TEST: You are besmirching the good name of gaussian mixtures with this```",
"```Shifty: Mario and Sonic now takes place in a divergent timeline\nAndrea: i enjoy the implication that it didn't before```",
"```Cyber: As a strange man once told me on a New York subway, all vampires are lesbians.\n```",
"```Shifty: Homestuck is responsible for my first relationship\nPipsqueak: same\nkino: homestuck is responsible for the dissolution of my first relationship```",
"```Calibur: \"Don't get TEST started on color spray....\"```",
"```Avery: I am in a weird state of mind. I'm looking at a homebrew Warlock patron called \"Senpai\" and it's not for a joke.```",
"```Fifth: i have no idea whats going on but it involves build optimizing and giant robots so im a fan```",
"```Popcornia: Essentially theyre debating how they want to make people catch fire\nPopcornia: By hacking them until their brains explode or with actual fire```",
"```Krow: Revenge of the Nazi Furries was not what I was expecting out of a Friday```",
"```Gateways: Fibonnacis Broken Draw Spell {U}\nGateways: Instant (rare)\nGateways: Draw a card.\nGateways: Draw a card.\nGateways: Draw two cards.\nGateways: Draw three cards.\nGateways: Draw five cards.\nGateways: Draw eight cards.\nGateways: Draw thirteen cards.\nGateways: Draw twenty-one cards.\nGateways: Draw thirty-four cards.\nGateways: Draw fifty-five cards.\nGateways: Draw eighty-nine cards.\nGateways: lol hope you have lab maniac loser```",
"```Avery: Do hellions have gender?\nPopcornia: They have one gender\nPopcornia: ANNIHILATION```",
"```Herzi: pip committed murder tonight\nPipsqueak: I didn't get the TPK```",
"```Simon: Unicorn llama you COWARDS```",
"```Cajun: players: we want the enemy bicycles\nCajun: wotc: i'm gonna do what's called a pro-gamer move```",
"```Fifth: Lady Gen deserves 6 points worth of ass. tell me she's not thicc to the gods```",
"```TEST: Antifascist furry for reference```",
"```TEST: But it has the properties of a potentially solvable game. And that's why you shouldn't use an NN to solve it.\nCyber: It's a solvable one but you need a bigger computer than anyone's yet been willing to throw at it.\n6000j: it is solvable, but it is complex enough it isn't reasonable to solve\nPipsqueak: Chess is trivially solved, you just punch your opponent and steal their pieces\nCyber: The four genders.```",
"```Shifty: Tamiyo didn't join the Gatewatch because she was banned after making Jace spell ICUP```",
"```Fifth: John Constantine and the jl dark has always been my fav part of dc\nFifth: Now that I know that hes canonically a bisexual sharkfucker\nFifth: I love him even more```",
"```Cyber: \"Of Course You Should Capitalize Keywords. You Should Capitalize Everything.\"\nJaya Ballard, Capitalist```",
"```Pipsqueak: what is a puca but a noggle of the mind```",
"```Schism: I need a heWo (wait shit)\nGatgeways7: i need a heWo! i'm holding out for a hero till the end of the night - damn it```",
"```Avery: \"Creatures you control in a band have Rampage X, where X is the number of creatures in that band.\"```",
"```Fifth: does anyone else occasionaly become seized with an overwhelming urge to purchase a hurdy-gurdy and learn medieval tavern songs.```",
"```Mako: Rotisserie draft sounds fun and im not just saying that bec it is a dream of mine to devour an entire slab of shawarma beef right off a rotisserie```",
"```Fifth: Lightning bolt is basically a prison piece because it stops them from casting spells\nGrish: Because they're dead?\nFifth: yeah\nFifth: very difficult lock to get yourself out of\nFifth: once they get you to 0 you should basically just concede an start a new game, its really difficult to win from there```",
"```Cajun: centaurs are like the mullets of the animal kingdom```",
"```Egg: should I take the furry avatar or the poorly-researched-depiction-of-slavery```",
"```medusa: my friends\nmedusa: *cracks knuckles*\nmedusa: I want to commit some fallacies```",
"```kino: use that moist mechanic that never made it into a set```",
"```Shifty: Well, not quite to the same extent. He started an initiative to teach kids about \"the dangers of technology\" and that was his goodbye post on the forums\nCajun: that would explain why they never got back to me about ekplo in Mainframe```",
"```Fluffy: subtextual storytelling in the chicken cavity industry```",
"```2wb: i do, indeed, refuse to commit anything to memory about bad manga that i don't have to. thanks, shifty!```",
"```Tyrant: Is this related or unrelated to muslim DBZ?```",
"```Schism: clearly kirby is going to eat naruto```",
"```Avery: God it's so hard to decide between twink art and actually accurate character art.```",
"```Cyber: Breaking: Godzilla kills several Londoners.\nShifty: Daily Mail leaps at the chance to blame all the country's problems on a Japanese immigrant```",
"```Tyrant: Young Bill Clinton always looks like uncooked dough and I hate it```",
"```Avery: Yeah suck it Krow. Your statement wasn't quite shittable.```",
"```Krow: im like cinderella but shittier```",
"```6000j: train boat plane car eldritch horror is my new favourite rps variant```",
"```Kevin: The B in LGBT+ stands for Banned in Commander```",
"```Cyber: Zero feet apart because they're making out at this very moment but, like, in a hetero way.```",
"```Matt: but I lick both a lot```",
"```Occo: breaking WotC precedent is now WotC precedent, do what you want```",
"```Shifty: draft #2 may be slightly postponed because I, a 23-year-old with a borderline IT job, accidentally reset my router while trying to turn off a lamp```",
"```Shifty: Gyruda burned my house down and fabricated evidence to get me fired\nKrow: He burnt my fries\nKrow: He burnt my shake\nFluffy: gyruda got my hopes up with emails about possible translation gigs and neglected to mention that those gigs are on-location in texas\nMako: Gyruda punched me in the face once\nShifty: Gyruda is a 419 scammer who only targets people who've been the victims of other 419 scams\nFluffy: gyruda plays hearthstone\nPipsqueak: Gyruda supports the reserved list\nChillbrain: I've come to make an announcement. Gyruda, Doom of Depths is a bitch ass motherfucker, and he pissed on my fucking wife.\nFluffy: gyruda plays cedh\nEmily: gyruda promises people hot singles in their area\nPipsqueak: Gyruda was let go from play design for pushing too many cards\nTyrant: This is all making Gyruda sound like an interesting guy with varied interests and lots of life experience\nSimonTheBrushwagg: found gyruda^```",
"```kino: i dont fuckin get hair\nkino: i had my hair super long and ppl kept mistaking me for a girl so i cut it then ppl kept mistaking me for a lesbian```",
"```Cyber: She traded wishes for tutors, tutors for tutors, tutors for cantrips. In the end, she traded cantrips for ants.```",
"```Grish: According to the comprehensive rules, other languages don't exist```",
"```Shifty: King John, wiping a tear from his eye as he signs the Magna Carta: peasant machine... broke...```",
"```Fifth: is this kerbal warlock simulator```",
"```6000j: i think the 12 is silent```",
"```morgan: Youre buck naked and also clearly proficient in either wrestling or theft```",
"```Emily: okay, am I the only one who finds Giraffes really fuckin creepy?```",
"```Avery: It's all a hoax by Big Binoculars to sell more binoculars.```",
"```Fifth: dont you touch my hot grandma```",
"```Cyber: Sid Meier's Karn's New Phyrexia```",
"```Mako: are you fighting a chair or having a boner\nMako: i cant tell```",
"```Amelia: I have a genderfluid catgirl vampire planeswalker in one file.```",
"```Cajun: rule one of custom card design, if you're using the DKA frame, don't```",
"```Fifth: @Pipsqueak YOU ARE A HYPOCRITE\nmorgan: Awesome!```",
"```Shifty: The quarantine weirdness level has officially reached \"someone I met once at a party is posting softcore tentacle porn on Facebook\" levels\nFluffy: only softcore?\nShifty: Give it another week or so```",
"```Pipsqueak: I personally treat Brainstorming in response to a Sylvan Library as Aggressive Behavior```",
"Herzi: https://cdn.discordapp.com/attachments/250273029920129025/719423530344644668/unknown.png",
"Mako: https://cdn.discordapp.com/attachments/250273029920129025/719423588146348083/20200608_133202.jpg",
"```Gateways: no problem, i make it a habit to notice conspicuous objects, including but not limited to muscle gourds```",
"```Krow: oh sure don't tag me as if i'd never want to see a fully caked up jace\nEgg: for some reason whenever I think of thicc males fifth is the first person that jumps to mind\nEgg: I'll get you next time david```",
"```Cajun: hm what's a name for a dogcatcher, but one that's like, part of the mafia```",
"```Cyber: Ignore jungles and pants, acquire Scotsmen.```",
"```Schism: ah yes, finally i can simulate watership down with magic cards```",
"```Windy: Finland is a lie propogated by the Finnish government```",
"```Cajun: being cute is an excellent manipulation tactic```",
"```Parasign: I assume in this scenario Godzilla is also the pope?```",
"```Herzi: in your hypothetical vampire godzilla fantasy land, the godzilla must first vore the dracula```",
"```Popcornia: Cant wait to have a dead goat infected with good vibes tested at my impenetrable fortress```",
"```Emily: re: #custom-card-talk\nGateways: he might be a furry but he's also an asshole```",
"```2wb: My eyes usage has much exploded from being on this server```",
"```Chillbrain: I guess having your house flooded takes precedence over Toto shitposting```",
"```Shifty: me: good morning! Let's see what's happening today\nShifty: news: Jason Derulo chipped his two front teeth trying to eat corn off a power drill\nShifty: me: well, that's enough for today! Goodnight, everyone```",
"```Shifty: \"No, you can't go around calling yourself the Doctor! You're ruining the timestreamerino!\"\nShifty: \"haha screwdriver goes brrrrr\"\nCyber: The Doctor: Noooooooo! You can't just claim you're a time-traveling ancient being!\nCyber: The Doctor: Haha electric screwdriver go brrrrrrrrrrrr\nCyber: OH SCREW YOU```",
"```Shifty: collect mail\nShifty: go to wash hands\nShifty: there are two pigeons in the bathroom\nMako: its their bathroom now```",
"```Krow: Tamiyo died bathed in moonlight, strangled to death by her own bra```",
"```Simon: That's a fuckable skeleton```",
"```Schism: some of us are fated to spew shit, some fated to enjoy it```",
"```morgan: how did lattice give you pregnant zangief```",
"```Cajun: the year is 2050\nCajun: there hasn't been a standard set in 20 years\nCajun: people fight in the street for the elusive last printings of Commander 2036\nCajun: Wotc announces thirty-seven Secret Lairs```",
"```kino: Landbound (Your lands can help you cast this spell. Each land you tap while casting it pays for one mana that that land could produce.)```",
"```Parasign: You shouldn't \"have\" bones because skeletons deserve to be free```",
"```morgan: what a wonderful horrible day to have functioning eyes```",
"```Egg: fumbles to find an ass-clap emoji online```",
"```Avery: This conversation is a trainwreck. Glad Im a part of this community.```",
"```kayiu: uwurza```",
"```Cajun: aren't programmer computer liches the uploading consciousness endgame```",
"```Kevin: don't denigrate Dr. Ooh Aah's degree```",
"```Pipsqueak: generally I'm a proponent of playing cards if you own them\nPipsqueak: controversial, I realize\nKayiu: apparently WotC agrees, given the Agent of Treachery bans```",
"```Cyan: \"good morning kids, today's class will be on the K-pop wars\"```",
"```Cyan: oh my god it was an ancient grudge reference\nCyan: i thought it was a kinky thing```",
"```Cajun: not sure if that's for or against brainwashing children to turn them into a lich army```",
"```Shifty: kill 6 billion Pickle Ricks```",
"```Cajun: we don't need the cops, we just need magical teenagers with attitude and deep seated anxiety\nWindy: Ah yes, the throw-youth-at-the-problem approach```",
"```Parasign: What in Velis Vel is that typeline```",
"```Gateways: can we get \"fingers in his ass\" pinned in general```",
"```Krow: yar har fiddle dee dee life on the poop sloop is alright with me```",
"```Cajun: why is the raven throwing spicy nuggets at my eyes```",
"```Herzi: 100 duck sized horses with human arms or 1 horse sized duck with human teeth```",
"```Herzi: how morally upright and anti capitalist are these kids```",
"```Cyber: ... is this a motherfucking Cats reference?```",
"```Cajun: you never know when you might need a player to have negative two billion mana\nKevin: Soul sisters mirrors man```",
"```Ehks: when will we get Yawgmoth's Used Car Deal\nEhks: (comes with a free oil change.)\nCajun: (the oil change is seven poison counters on etb)```",
"```Cajun: if you lose your bones are added to the pile\nTyrant: Oh I played that game in the mental hospital```",
"```Tyrant: Blood and skin are optional```",
"```Herzi: god this really is chopsticks drama```",
"```Emily: the 1800s called, it wants the fucking Mason Dixon Line back```",
"```Cyber: It's R-G-D both times.\nCyber: Ravnica: City of Guilds-Guildpact-Dissension;\nCyber: Return to Ravnica-Gatecrash-Dragon's Maze\nCyber: And then Guilds of Ravnica-Ravnica Allegiance-Damn shame WotC hasn't released any sets since.```",
"```Swampmist: onceler stans: \"he's hot so he can't be evil!\"\nSwampmist: Magic players looking at Oko: ??```",
"```Chill: here i was thinking the base requirement for being on the server was being well educated in the art of twinkology```",
"```Avery: Unfortunately, I was not swallowing acne face wash to try and get drunk```",
"```Chill: suckle from the bountiful teet of human toad```",
"```Popcornia: Some pirates are lesbians\nCyber: As I have said repeatedly.```",
"```Shifty: It's time to board the rowboats\nShifty: It's time to chant the rites\nShifty: It's time for Gitrog Monsters\nShifty: On the Muppet Show tonight```",
"```Pipsqueak: No magic player should be allowed to feel safe```",
"```Herzi: pip youve let us down\nHerzi: substandard meme\nHerzi: this is going into your quarterly```",
"```Matt: (To anonymous wolf and leopard, thank you)```",
"```Pipsqueak: bb8 is bbgr8, don't bbh8 bbm8```",
"```kayiu: who is this mysterious omnilingual saudi\nMatt: Google Translate in a Trenchcoat```",
"```Schism: also, oddly related\nSchism: if a penguin was wearing a ball glove would it have five fingers or one do you think?```",
"```Herzi: im experimenting rn by winding up with a funko pop```",
"```Krow: The knees are the source of magic in the body and that's why I brought my knee breaking stick```",
"```2wb: i don't know if i asked for that, walked into that, or jumped into that volcano headfirst```",
"```Mako: Art direction: oko's six pack ```",
"```Gateways: egg and avery fight\nAvery: Put 'em up Egg. I warn you, I do a mean crying fit.\nEgg: I have arms like wet noodles and the balance of a strand of yarn\nEgg: let's do this```",
"```Shifty: the Konami Code doesn't - fuck```",
"```Gateways:  be! trans! commit! arson!\nCajun: be ace, jaywalk```",
"```Shifty: If anyone printed an actual Sol Mox, I'd probably wake up three days later with somebody else's credit card in my fist and 27 missed calls from poison control```",
"```kino: when i was in year r (i think kindergarten for americans) i was home sick with a cold and when i came back everyone was doing a thing where they had to draw up a report on what they learned about bible stories but i didnt know what i was supposed to do because i missed it so my teacher said i could copy off of my friend conrad so i looked at conrads but i didnt really understand it and all i saw was him raging at some greedy people and knocking shit off of tables so in one hour i drew jesus throwing mcdonalds everywhere and wrote one sentence that i dont remember and the teacher yelled at me and i cried```",
"```Krow: why is it so hard to find a normal ass snake on artstation all these snakes are pregnant```",
"```Emily: The fuck is a wolf\ngynoidpoet: Dogs before they made what could be seen as their best decision or worst mistake.\nCajun: they specced out of most of the offensive and size tree but went all in mind control```",
"```Avery: How do I get less fragile opinions.\nHerzi: power armour```",
"```Grish: I'd try brewing this but I don't know anything about standard\nShifty: Neither do WotC and that hasn't stopped them```",
"```Cyber: ... are you spoiler tagging the Epic of Gilgamesh?```",
"```morgan: twaumatize me bwuvac```",
"```Fluffy: catch me fucking manaless dredging your six-year-old into submission```",
"```Schism: i feel like if there were taxes there would nevessarily be a tax themed pokemoon```",
"```Mako: I would inject a tub of greek yogurt right into my veins```",
"```Krow: leave rancor's feet out of this```",
"```Shifty: Pila can be exchanged for wounds and weaknesses```",
"```Medusa: i can think of some things better than drafting PTK\nMedusa: eating mud\nCajun: drafting ptk twice```",
"```Mako: i only want one cow for the express purpose of devouring it alive, and this is not the first time i've written this sentence, either```",
"```Krow: why is it so hard to find a normal ass snake on artstation all these snakes are pregnant```",
"```Schwa: once one draws an excellent mole, what else must they draw if not another excellent mole?```",
"```Simon: That name is making me think of a flavor town extended universe\nKayiu: did you mean: homestuck\nSimon: With millions of different versions of Guy Fi-\nSimon: Is THAT what Homestuck is?\nPipsqueak: yes, except it exists in an alternative universe where Guy Fieri is evil\nKayiu: and the president\nCajun: why does that sounds like the preferable universe rn```",
"```Shifty: Just noticed a cool interaction with Ugin: when you cast him, people concede```",
"```Shifty: We Reprinted Tarmogoyf But She's A Black Woman Now, That Will Be $300, Please Don't Ask About Our Hiring Practices```",
"```Cajun: i just call them giraffe images to upset the giffers, the jiffers, and the people who know that giraffes aren't real```",
"```Cajun: needs to pee is white/blue because it requires both civilization and enough respect for that civilization to not just pee wherever you are, or failing that, your workstation```",
"```Cajun: can you respond to what the rock is casting```",
"```Herzi: Enters Garfield's battlefield\nHerzi: the lasagne always claims its pound of flesh```",
"```Kayiu: Lucien is definitely the type to text you \"wyd?\" at 11:42 PM on a weeknight```",
"```Morgan: i see your knife monopoly and raise you chainsaw jenga\nHerzi: i raise you pictionary with the extended family```",
"```Pipsqueak: I refuse to believe that physics is real until physicists can give me gravitons that I can grind up into a fine powder and snort```",
"```Gateways: $mainframe\nGateways: $update\nGateways: $main\nGateways: $mse\nGateways: $2020\nGateways: $fuckin uhhhh\nGateways: $help```",
"```Cajun: i'm not gonna beat up a bunch of sick old guys and also obama```",
"```Shifty: While WotC releases Ravnica 5, in which the villain is a thinly veiled Boris Johnson analogue and every card has \"racism is bad\" as the flavor text despite the art budget being partly funded by Lockheed Martin, we'll be tripping in the eleventh dimension with Cretio / Stratopol / Rising Waters / Attack on Ravnica / Urban Wastelands Standard```",
"```Parasign: Love is basically a dungeon, right?\nWindy: That does describe my situations with romance yeah```",
"```Cajun: well i tried to set a card to mythic and mse crashed\nCajun: one way to abolish mythic```",
"```Chillbrain: God I was about to go to sleep but now I need to go outside and boot up my laptop to make an edit of \"LET'S FUCKING GOOOO\" with basking rootwalla```",
"```Pipsqueak: Maybe dont press the crash button\nOcco: (they're all crash buttons?)```",
"```Cajun: now it looks like a flesh muppet but somehow i hate it less```",
"```Gateways: the seven creature types: pincher, tetravite, cheese, token, tetravite 2, oozegerm, tetravite 3: oh shit not again```",
"```6000j: local series: australia\n6000j: it's just normal cards but all the wording is slang and the freed up space is alliterated with swears```",
"```Gateways: concept: booty shorts that say \"gremlin\" on the front and then on the left asscheek there's a qr code that takes you to an image of the art of territorial gorger```",
"```Fluffy: every card in my library is hidden in a different spot in the tournament area. whenever I draw I spend ten minutes searching for the card. I am on monoblue control and I have drafted five instant-speed cantrips```",
"```morgan: Im super into it Emily\nHerzi: the bubbles are eyes\nmorgan: Im extremely horrified by it herzi```",
"```Avery: I like the glowy eyes and the tendril bits.\nAvery: Therefore, cutie.```",
"```Cyber: A completely original setting that totally has nothing whatsoever to do with any of Tolkiens works.\nCajun: does such a fantasy world exist```",
"```Matt: She chucks the toddler to distract your spellcasting```",
"```Windy: I don't make a habit of punching animals```",
"```Krow: I just wanna die in space, Cajun\nKrow: Bathed in moonlight\nKrow: Strangled by my own bra```",
"```Tyrant: Werewolf is trash\nTyrant: Has the same problems as baseball```",
"```Herzi: til god is a slimegirl```",
"```Fleur: folklore is surprisingly good\nAvery: Folklore is cool.\nFleur: Like the Taylor Swift album\nAvery: Oh.\nAvery: I mean that's probably cool also.```",
"```Windy: You ever just stick your hand into a fish?```",
"```Popcornia: Stabbing is just slashing on the z-axis```",
"```Cajun: can't believe the wiki war of if Occupation: Dolphin is allowed or not is still going```",
"```Matt: Ooh do I finally also get to hit grandma```",
"```Tyrant: I've eaten so many chicken nuggets and I'm not happy yet\nTyrant: Help```",
"```Avery: That definitely is someone kinning a cloud.```",
"```Pipsqueak: Judge! Can I ante my girlfriend if I'm playing a deck without Lurrus?```",
"```Fleur: it's meat grinder time```",
"```morgan: Anyway I need to find that clip of twerking baby Superman```",
"```Matt: If you haven't seen supes butt cheeks, you haven't suffered as I have```",
"```Avery: Well I'm sure as hell not ealborating.```",
"```Onion Rings: what material do you want your statue made out of?\nAvery: Tissues.```",
"```cajun: dual land number 5\nmed: ladies and gentlemen...\ncajun: a little bit of savannah in my life\ncajun: a little bit of tundra by my side\ncajun: a little bit of badlands is all i need\ncajun: a little bit of taiga is what i see\ncajun: a little bit of scrubland in the sun\ncajun: a little bit of plateau all night long\ncajun: a little bit of tropical here i am\ncajun: a little bayou makes me your man```",
"```Tyrant: and don't give me that 'a roof is a hat for houses' shit houses don't have rights```",
"```Fifth: anyways i like lobster dinners because its me, a giant 8 gallon pot, and 3 bowls, and me with my sleeves rolled up and a set of 1400s torture devices arrayed next ot the butter```",
"```Cajun: two chicks in a card, standing six feet apart cause they're gay but practicing social distancing```",
"```Herzi: manga this manga that. how bout you expand your mind and read some real literature\nHerzi: like the hungry hungry caterpillar```",
"```Fifth: sorry was yelling at my idiot little brother Paris of Troy for fucking conquering the isle of Lesbos before i got there so i only have one of the provinces and can only make 2 of their incredible sexy powerful lesbian javelin throwers```",
"```morgan: Honestly it totally makes sense to me that weddings on Innistrad are just attended to by giant shapeshifting pipers```",
"```Cajun: unfortunately 2016 Cajun was eaten by a crocodile and is no longer with us```",
"```6000j: I can definitely throw a bird further than I can explode, so makes sense```",
"```Gateways: there is not a single card in egg's deck that should be legal to play in msem, island included```",
"```morgan: will you two stop mating each other```",
"```kayiu: me, sadly canceling my online bear order:```",
"```Herzi: cringe frogs for your fail detroit```",
"```Mako: Simon stop committing war crimes on main\nSimon: Too late, I just cleaned the cheese grater\nSimon: There's no going back```",
"```Herzi: what kind of lame power is heart anyway, the evil totalitarian government asked before being toppled by a 16 year old with emotional issues```",
"```Cyber: Mermaids are more like catgirls or platypi, yeah.```",
"```Cajun: i'll sign herzi's name on anything```",
"```Dodger: Wotc should ban cards in modern until grizzly bears is playable, then ban grizzly bears\nDodger: Thats how you fix the format```",
"```Gateways: the moose work for the bourgeois```",
"```Cajun: this card is nice, but it could really use more loyalty abilities\nCajun: yea i get its a sorcery, that's what makes it exciting```",
"```Matt: Art check. Is this doggo too sexy?```",
"```Cajun: Spawn\nCajun: The\nCajun: Biggest,\nCajun: Baddest,\nCajun: Nastiest,\nCajun: Gus\nCajun: Cow\nCajun: Lady\nCajun: of\nCajun: Proper\nCajun: Etiquette\nCajun: Chicken\nCajun: Demigod\nCajun: Slith```",
"```Cajun: everything i don't understand on the internet is inevitably a homestuck reference```",
"```Pipsqueak: You know\nPipsqueak: 2020 has put me through a lot of trials\nPipsqueak: And its fucked up legacy beyond repair\nPipsqueak: But ZNR did something I cannot forgive\nPipsqueak: It made DnT a deck I had to respect\nPipsqueak: And thats fucking bullshit```",
"```Cyber: Gravecast (You may sometimes cast this card from your graveyard. Its cost may change, and it may resolve to a different zone than expected.)```",
"```Cyber: Invasion of Kamigawa by Eldrazi\nCyber: (The sequel to Invasion block.)\nNazSmith: Ive seen that anime```",
"```Fifth: like i can mostly be fine with it if its more kidnapping with intent to eat```",
"```Grishnax: Is it really horny on main when it's actual cannibalism```",
"```cajun: Ancestral Recall but green {G}\ncajun: Instant\ncajun: Draw three cards, then discard three cards unless you control a creature or there's a creature card in your hand. (You don't have to prove there's a creature card in your hand.)```",
"```Medusa: I just woke up, it's 4:20 am, I have a fever, my head hurts, and what the FUCK is Jeweled Lotus```",
"```Cyber: Good news! My computer simulation of a quantum computer is now more broken.\nCyber: ... ah, wait, never mind, its not failing the way its supposed to.```",
"```Popcornia: Hey Mako guess what\nPopcornia: Uwubrask\nMako: im beautiful\nMako: oh```",
"```Orion Rings: tf is a salted nut roll\nKrow: well its when you\nOrion Rings: oh ok thanks```",
"```Kevin: I mean, I'm willing to die for character development.```",
"```Cyber: We're a Friendly Nonlocal Game Server!\nHerzi: we're a... fungus?```",
"```Cajun: Captain Mullet there is driving his disabled mom and the king of arcade games in his invisible mecha that can only be controlled by flipping the double bird```",
"```morgan: I mean, whats more traumatically spark-inducing than the literal plot Hour of Devastation\nMako: having to work on a weekend```",
"```Rosly: vote pokemon set so i can raichu a love song```",
"```Herzi: ever have those days where your just sharkboying it through the water and then youre lavagirl and your lava powers boil the water and solidify and you drop to the bottom of the ocean incased in a stone tomb of your own making```",
"```FifthDragon: panel 4 is implied to be just shooting straight into the atmosphere and dying of exposure above the cloud line right?\nCyberChronometer: (I cant find the original source but the person who posted it misquotes Taoists a lot.)```",
"```Timespiraled's cat: VVVVVVVVVVVVVVSNSSkooooooooooooooooooooooooooooo\nAvery: same```",
"```Morgan: Sock is far more valid a name than Vriska\nMorgan: Source: I have read homestuck```",
"```Avery: \"Oops, sorry copper. I was just trying to impale my own hand and his arm happened to be there. I swear.\"```",
"```Simon: My sin to blood ratio is way too high```",
"```Pipsqueak: Green: Embrace the natural way of life\nPipsqueak: Trans people: lol shut the fuck up boomer takes titty sprinkles and kills god```",
"```Mako: The Lion, the Witch, and the Wardrobe\nMako: Legendary Planeswalker - Ajani Liliana Tezzeret```",
"```jackgroks: My thanksgiving dinner ended with my dad referencing the Kraken and then getting throwing a tantrum about voter fraud\njackgroks: how was everyone else's```",
"```Herzi: there will be consequences\nHerzi: for this insolence\nHerzi: that last message was delayed cause i couldnt figure out how to spell insolence```",
"```Cajun: go my demented seuss character```",
"```Herzi: go find god in this un-mowed lawn, kid```",
"```Morgan: alright, i'll bite\nMorgan: how can you be immune to lasers\nCyber: Very shiny mirrors?```",
"```Cajun: like when red-the-color runs out of things to fight, does it\nCajun: a) find more things to fight anyway\nCajun: b) find something new to do\nCajun: c) sit on a mountain peak for 3 years until a random 10 year old kills you```",
"```Fleur: Heliod, Sun of a Bitch```",
"```medusa: imagine being such a dick you become a god\nAvery: POV: You're Jeff Bezos```",
"```Cajun: i don't see what's unbelievable about santa claus and his crocodile friend creating a theme park\nMedusa: the fact that they'd do it in indiana```",
"```Morgan: fifth i've never seen a piece of white bread i could describe as \"morally hazardous\" before```",
"```Fifth: tyrant, the secret is that the catholic curch is in fact a front for a very lucrative fabric hedge fund```",
"```morgan: ral went to an izzet school\nmorgan: he knows the boiling point of titanium but not what geese are```",
"```Espithel: Kinda hot tbh\nmedusa: not really no\nmorgn: not really, no\nWindy: It is once you start running that electricity for a bit```",
"```Windy: Electricity not known for being cold```",
"```Avery: They destroyed the Eldrazi through faith in the Bible and God```",
"```Herzi: partake of this dr. pepper, for it is His blood, and partake of these girl scout cookies, for they are Their flesh```",
"```Mako: Me: shut up kayiu ill do the gp poster for free\nMako: Also me: yes mmm pay me for ur shapesona mmm```",
"```Tyrant: I think about pillows in an abstract sense```",
"```Cajun: okay have located bolas meditation realm\nCajun: now scanning for herzi's catgirls```",
"```Chillbrain: having your discord status as 100 gecs is like the modern day equivalent of the lepers that would walk around ringing a bell and yelling \"UNCLEAN\"```",
"```morgan: oh i'll do anything to get a laugh out of someone\nGrishnax: Would you kill a man in cold blood\nmorgan: would it be funny```",
"```Cajun: how do you hate someone wth a hat three times the size of their head that's illegal```",
"```Krow: is this really mtg fanart if thalia's ass isn't facing the camera```",
"```Emily: My original plan was from Wookies to God```",
"```\nFifthDragon: what does john travolta have to do with toes```",
"```Emily: how good is stifling  a fetchland(edited)\nEmily: update:  I did it and my opponent conceded```",
"```Cajun: not sure if i'm more concerned about reverend guy fieri or the green m&m getting enough botox and hair implants to look like dr. phil```",
"```Kevin Norton: this sexy piece of twinkish man meat\nEmily: I dont hate any of those words but I sure do hate them in that order```",
"```\nAvery: The criminally under-represented canadian murderer teenage club demographic\nHerzi: it makes up a huge percentage of our population but you rarely see it in media```",
"```Gateways: how is it homophobic to support my gay dilf orc-murdering husbands hobbies```",
"```Avery: props to the forge bot\nAvery: They just killed me by countering their own spell with <<Countersquall>>\nLackeyBot: Countersquall    {U}{B}\nLackeyBot: Instant     CON U\nLackeyBot: Counter target noncreature spell. Its controller loses 2 life.\nAvery: wait```",
"```Cajun: aight so the kaldheim story is\nCajun: >vorinclex is doing stuff, tho we don't know what or why or how\nCajun: >kaya is hunting him, tho we don't know how or why\nCajun: >tibalt is doing something that involves stealing a sword, tho we don't know what or how (and why is For the Evulz)\nCajun: >all of the Kaldheim worlds get smashed into one, Alara style, tho we don't know why or how\nCajun: >also the king from shrek is here for some reason```",
"```morgan: Oh I thought you meant sending everyone except cajun to horny jail was the endgame of the Magic Set Editor community```",
"```Chillbrain: adults are just super babies when you think about it\n6000j: I would rather have not thought about it```",
"```morgan: fifth i've never seen a piece of white bread i could describe as \"morally hazardous\" before```",
"```morgan: You try to draw another card and she stabs you in the shins. Shes a no-shins thief```",
"```Mako: Write them on the wall\nMako: With pigsblood\nmedusa: sorry i don't have any other pigs nearby\nSchwa: if you seem to have misplaced your fresh pigs blood, store bought is fine```",
"```Emily: Man, designing warriors characters is hard\nAvery: aren't they just cats```",
"```Egg: if you're interested in hearing more about dinosaur dicks, look up \"Tyrannosaurus Sex\" on YouTube\nit's surprisingly informative```",
"```Cajun:\nJanuary: The Chiuaua antichrist reveals itself\nFebruary: Mars Attack 2 releases\nMarch: A \"cure\" for covid is found in highly irradiated soft drinks\nApril: Sports adapt to covid by having the players in giant bubbles.\nMay: New York Becomes A Literal Big Apple\nJune: Trump stows away on a space shuttle\nJuly: Halloween legally moved to July\nAugust: A music video with subliminal messaging cures diabetes\nSeptember: The coronavirus surrenders, deciding to colonize Mars rather than deal with us\nOctober: Michael J Fox reveals the Deloreon was a real time machine, but was lost during filming\nNovember: We find out the turkies had stolen the Deloreon and are back for revenge\nDecember: Our new turkey overlords allow us to achieve enlightenement```",
"```Grishnax: pops out of womb \"hey everyone this is my speedrun of Real Life any%\" clips into hospital bed to skip doctor cutscene```",
"```Orion: domri was rootin tootin entombed and shootin```",
"```fluffy: wotc please make secret lair: billionaires so I can Fling a goat at elon musk```",
"```Krow: Don't listen to babies they're famous liars```",
"```Dodger: I am a landlord\nDodger: I live rent free in y'all's brains```",
"```justnobody: Snakes wear boots the way shoelaces wear boots```",
"```Windy: Do you think aether dissolves plastics the way it destroys other organics?\nKrow: Blind eternities trash island```",
"```Pipsqueak: if you put a gun to my head and told me I had to give either blue or red lifegain, I would reach deep inside myself and find the strength to slap the gun out of your hand```",
"```Fleur: why go nwo when you could go OWO```",
"```FifthDragon: What demographic do you think i am\nFifthDragon: Why do you assume i demand transparent yield data about corn farms\nWindy: No, it's not an assumption, it's a declaration\nFifthDragon: Fuck i guess I am incensed at the vagueness of the corn industry then```",
"```Pipsqueak: that was a retcon actually when Home Depot bought the rights to the myth```",
"```Pipsqueak:\nI play Oko and Uro and Ice-Fang Coatl\nDrawing cards, gaining life, blue cards a-lot-al\nGood cards from this year and twenty nineteen\nThese are a few of my favorite things```",
"```Krow: I like the minimalist approach you got goin on\nKrow: It worked for munchkin and I hate that game```",
"```Emily: The three genders\nEmily: Pro hail\nEmily: Anti hail\nEmily: Alex Trebek```",
"```Krow: norse fanfiction is called christianity```",
"```Kevin Norton: also like, if a doctor can open up some dude's chest and just yoink out his heart, then shove another one in there, all with a mask on for several hours, you can wear one in a walmart for 15 minutes\nSchwa: never before have I heard \"yoink\" used to describe surgery\nKevin Norton: the ol' cardiovascular switcheroo```",
"```Avery: Just watched a warp world resolve for the first time\nPipsqueak: I'm so sorry```",
"```Isfendil: why art thou mad? Because my bf evadeth severely and thine own stabilizeth not?```",
"```Timespiraled: \"Mother, I wish to dress myself in these mammoth hides.\"```",
"```Avery: oh\nAvery: It just looks like gay screaming\nHerzi: please\nHerzi: i would never scream```",
"```Cajun: in the year 2100, superheros have to reach for hero names as all the good ones have been copyrighted and copyrighted for 250+ years. these are the adventures of Flying Through The Air Shouting Occasionally Man and his sidekick Babykicker```",
"```Mako: Koth, Ovaricider Thot-Hunk```",
"```Kevin Norton: Battlebots and Blaseball, the sports for our modern era```",
"```medusa: imagine being such a dick you become a god\nAvery: POV: You're Jeff Bezos```",
"```justnobody: Rune-Scarred is a key card in the \"Infinite Shadowborn Apostles and Swamps at a 3:2 ratio\" deck```",
"```Cajun:\nlike when red-the-color runs out of things to fight, does it\na) find more things to fight anyway\nb) find something new to do\nc) sit on a mountain peak for 3 years until a random 10 year old kills you```",
"```Krow: like the japanese honey bees our community surrounds the intruder and vibrates at a frequency high enough to melt them from the discord```",
"```Cyber: A... texas carbon?\nAvery: It's like normal carbon, but with guns, and steak, and racism.```",
"```Cajun: i don't make the rules except for the times i do```",
"```Isfendil: the  reason why this card is uncommon  is because everyone gets the damage calculation wrong\nIsfendil: it proves that honor overcomes math```",
"```Isfendil:\n{10}\ninstant\ntutor any cube (yes, the whole cube) from outside the game. You get an emblem with \"you have no maximum handsize.\"```",
"```Herzi: go find god in this un-mowed lawn, kid```",
"```Mako: The Lion, the Witch, and the Wardrobe\nMako: Legendary Planeswalker - Ajani Liliana Tezzeret```",
"```Pipsqueak: Green: Embrace the natural way of life\nPipsqueak: Trans people: lol shut the fuck up boomer takes titty sprinkles and kills god```",
"```Popcornia: Kaya is a reverse Danny Phantom. She makes her friends Go Ghost instead.\nAvery: no that's called murder```",
"```Simon: My sin to blood ratio is way too high```",
"```Dodger: *im not actually a furry\nPipsqueak: $x\nkayiu $x\nAvery: $x```",
"```Avery: Ill join your hideous union, but only if I get a great 401k.\nDodger: We have about 401k souls already!\nScribbl: you americans with your numbers```",
"```Windy: Now I'm imagining fancy noble-types talking about how poggers their wine is\nmorgan: \"I say, Poggifers, fetch our most distinguished Mountain Dew from the cellar.\"```",
"```Simon: Why the Christ does it look like they have four eyes\n6000j: Because they're Australian```",
"```morgan: Sock is far more valid a name than Vriska\nmorgan: Source: I have read homestuck```",
"```Pipsqueak: fun fact: three people in the history of this server have used the memetic phrase I'm always a slut for X\nCajun: what is X and why are people sluts for it```",
"```InfinityChef: I'm a simple person, I see a planeswalker, I pick a planeswalker\nInfinityChef: didn't even read it lmao\nInfinityChef: oh it kind of sucks```",
"```morgan: oh, to be a small bunny delicately handled by a pair of tongs```",
"```Schwa: pip dies to removal\nPipsqueak: I absolutely dont. I always have interaction```",
"```Schwa: don't love this being class-less?\nHerzi: okay capitalist```",
"```Herzi: ever have those days where your just sharkboying it through the water and then youre lavagirl and your lava powers boil the water and solidify and you drop to the bottom of the ocean incased in a stone tomb of your own making```",
"```6000j: companion format was wild. imagine telling your kids in the future \"oh yeah aggro decks were all odd because you just doubled your damage and they weren't even the best deck because people brought decks larger than a new player who shuffled their first packs into their intro deck and those decks got a on rate flyer for free and yet the most busted one wasn't even that it was a dumbass cat that just rummaged through your garbage```",
"```Parasign: Huh, this is the first cult I've heard of with a female leader\nParasign: Go equality I guess?\nPipsqueak: ??More??women??in??leadership??positions??\nPipsqueak: ??More??women??committing??human??rights??abuses??```",
"```Avery: how do you have fun help\nOrion: rule 1: no standard\nChillbrain: rule 2: no horniness\nChillbrain: the two rules for life\nMako: guess thats why im dead```",
"```Schwa: Cajun, bold of you to assume we can read```",
"```morgan: I mean, whats more traumatically spark-inducing than the literal plot Hour of Devastation\nMako: having to work on a weekend```",
"```Simon: We know they won't give Miku some wack past where she thought eugenics was 'poggers in theory'```",
"```Isfendil: Mako rode a mouse into battle with nought but canvas and paint in hand```",
"```Grishnax: Australia is weird\n6000j: Nah\n6000j: We're intriguing\nGrishnax: You have TREES that EXPLODE```",
"```FifthDragon: I say y'all constantly but thats a gay thing not a southern one```",
"```Schwa: Europe looks like a disappointed seahorse```",
"```Dodger: Oh man I know I'm gonn get got... but I'm gonn get mine fore my get got don't```",
"```TEST: That doesn't make sense; Fairies are supposed to be weak to bread```",
"```Avery: Oh wait the rat increases exponentially```",
"```Simon: I should change my name\nSimon: I don't want to be associated with myself```",
"```Herzi: cthulu holds me oh so tender and puts a little bandaid on my booboo```",
"```Krow: girlboss victim of capitalism's work or die```",
"```Cajun: that would require us to reanimate 1.2 billion corpses\nCajun: which might be worse than the 4 billion babies```",
"```Cajun: fun fact, there's no horse phobia because all fear of horses is rational```",
"```Windy: Tentacles included?```",
"https://www.youtube.com/watch?v=lRMWBvVh8u8&t=246s",
"```Gateways: a vicious cycle of peevery```"
]