{
	"Savrios' Timeshifter": "As you cast an instant or sorcery spell, you may exile cards with reprise from your graveyard and pay their reprise cost. If you do, add this card's effects to that spell.",
	"Accursed Existence": "Cards exiled with one Accursed Existence can't be cast through another Accursed Existence's second ability.\n_ Accursed Existence has a linked ability, meaning if it exiles a card in a way other than its first replacement effect, that card can't be cast with the second ability.",
	"Cannon Fodder": "The source of the damage is the artifact or creature card in the graveyard.",
	"Dashing Rager": "Any abilities of the Equipment, such as \"Whenever equipped creature attacks\" triggers, are controlled by the Equipment's controller.",
	"Fadefeather Griffin": "If you control no other creatures when Fadefeather Griffin enters the battlefield, it will have no time counters, and so the \"When the last time counter is removed, sacrifice it.\" trigger will not occur unless it somehow gets a time counter from somewhere else.",
	"Feral Cleaver": "Feral Cleaver's ability triggers after blockers have been declared.",
	"Ficklewing Elemental": "If you have no cards in hand when Flickerwing Elemental enters the battlefield, it will have no time counters, and so the \"When the last time counter is removed, sacrifice it.\" trigger will not occur unless it somehow gets a time counter from somewhere else.",
	"Formidable Bulkvine": "Tapped creatures can't be tapped as a cost.",
	"Mental Supremacist": "The ability losing effect is a static effect, so the creature can't gain other abilities. It's power and toughness can change.",
	"Tharyen's Machinations": "A card is engorged when it is exiled by an engorge keyword ability.",
	"Soulstone Servant": "Soulstone Servant's ability checks if you control a creature with toughness 4 or greater when it triggers and when it resolves.",
	"Bloodchill Risen": "Bloodchill Risen's ability checks if the card engorged by it is an instant card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Risen Looter": "Risen Looter's ability checks if the card engorged by it is a noncreature, nonland card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Blood Servant": "Blood Servant's ability checks if the card engorged by it is a creature card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Abhorrent Exhumer": "Abhorrent Exhumer's ability checks if the card engorged by it is a creature card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Scourge of the Deadlands": "Scourge of the Deadlands's ability checks if the card engorged by it is a creature card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Bane of Sanity": "Bane of Sanity's ability checks if the card engorged by it is a creature card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Subturgian Proliferator": "Subturgian Proliferator's ability checks if the card engorged by it is a creature card when it triggers and when it resolves. If the card is no longer in exile at either point, the ability will have no effect.",
	"Beragnian Intimidator": "Beragnian Intimidator's ability checks if it is equipped when it triggers and when it resolves.",
	"Fortress Sentinel": "Fortress Sentinel's ability checks if you control a creature with toughness 4 or greater when it triggers and when it resolves.",
	"Wolfbriar Sapling": "Wolfbriar Sapling's ability checks if you control seven or more lands when it triggers and when it resolves.",
	"Hordedriver Enthusiast": "Hordedriver Enthusiast's ability checks if it is equipped when it triggers and when it resolves.",
	"Garrison Mobilizer": "Garrison Mobilizer's ability checks if that creature's toughness is greater than its power when it triggers and when it resolves.",
	"Magus of Memories": "Magus of Memories's ability checks if there are five or more instant or sorcery cards in your graveyard when it triggers and when it resolves. If you control multiple Magus of Memories, you will only return cards as long as there is still at least five instant or sorcery cards.",
	"Danuri Custodian": "Danuri Custodian's ability checks if you control a creature with toughness 4 or greater when it triggers and when it resolves.",
	"Khaliz-Dorahn Restored": "Khaliz-Dorahn Restored's ability checks if you control fifteen or more lands with different names when it triggers and when it resolves.",


	"Gao'Wu, Master Soothsayer": "Gao'Wu does not prevent creatures that enter the battlefield tapped and attacking, or creatures that have greater power after they were declared attackers, from attacking.",
	"Heping, Master Arbitrator": "If the target of Heping's -2 can't be enchanted by the Aura token, the Aura will never enter the battlefield.\n_ Heping's emblem causes you to gain or lose the appropriate amount of life, which may be prevented or replaced by other effects such as glory counters.",
	"Master of Tranquility": "You can choose to let the pt switch occur first if you would like the Master to die.",
	"Shigurei, the Floodbringer": "Lands retain their names and legendary or basic status, but have no subtypes except \"Island\" and have no abilities except \"{T}: Add {U} to your mana pool.\" Lands that enter the battlefield after the ability is activated won't be Islands.",
	"Mieng, Who Dances With Dragons": "Mieng's type becomes \"Creature - Dragon\", retains her supertypes, and overwrites any other type changes.",
	"Battering Swine": "If you control Battering Swine and it is able to attack, alpha creatures you control will be unable to attack unless they similarly must attack if able.",
	
	
	"Azuma Hashiro, the Thronebreaker": "Azuma's ability doesn't target the cards. They are chosen on resolution. You can't attempt to cast lands this way.",
	"Masked Impersonator": "If Masked Impersonator becomes a copy of a creautre, it will lose its unblockable ability.",
	"Lord Asharo": "Instants inscribed on Lord Asharo with its exile ability are not copied and cast on attack, unless they are Inscriptions, which will be cast.\n_ Lord Asharo can cast a copy of any exiled card inscribed on any creature.",
	"Miyoga Firebird": "Miyoga Firebird will see spells cast this turn before it was put into the graveyard.",
	"Sankataar Nightbringer": "If your opponents manage to purge all their poison counters before Sankataar Nightbringer's ability tries to resolve, it won't resolve.",
	"Serpent's Grasp": "The caster of the spell chooses whether that player loses life or gets a poison counter.",
	"Taiyohata Champion": "If you cast Taiyohata Champion during your declare attackers step, it will not trigger any \"Whenever a creature attacks\" abilities.",
	"Festival of Fading Lights": "This will not destroy non-enchantments that happen to have the same name.",
	"Festival of Winter's Night": "This will return lands that happen to have the same name as the target to their owner's hands.",
	"Kiyomi's Yoroi": "The buff applies to all creatures you control that are equipped, not just equipped creature.",
	"Asharo's Yoroi": "The buff applies to all creatures you control that are equipped, not just equipped creature.",
	"Festival of Roaring Dragons": "This will not destroy non-artifacts that happen to have the same name.",
	"Miyoga Dragonsoul": "Miyoga Dragonsoul's type becomes \"Creature - Dragon\", overwriting any other type changes.",
	"Bind in Jade": "Inscriptions in exile will still be inscribed, but will temporarily not have their triggered ability.",
	"Festival of Spring Blossoms": "The buff does not apply to noncreatures that happen to have the same name, such as unanimated Vehicles and Animus.",
	"Dragonwall Fragment": "Dragonwall Fragment's ability checks if you control at least twenty creatures named Dragonwall Fragment when it triggers and as it resolves.",
	"Aghavaan's Wound": "Aghavaan's Wound's ability checks if you control at least five creatures that are Nagas and/or Snakes when it triggers and when it resolves.",


	"Barge Engulfer": "If Barge Engulfer gains defender after it enters the battlefield, such as through the Guard Duty Aura, it will lose defender, then gain defender. If it gains it through a static ability that began applying before it entered the battlefield, such as \"Creatures you control have defender\", it will gain defender, then lose defender.",
	"Eidetic Memory": "Cards exiled with one Eidetic Memory can't be cast through another Eidetic Memory's second ability.\n_ Eidetic Memory has a linked ability, meaning if it exiles a card in a way other than its first replacement effect, that card can't be cast with the second ability.",
	"Repressed Potential": "The ability losing effect is a static effect, so the creature can't gain other abilities. It's power and toughness can change.",
	"Vaertris' Master Plan": "Cards exiled with one Vaertris' Master Plan can't be cast through another Vaertris' Master Plan's second ability.\n_ Vaertris' Master Plan has a linked ability, meaning if it exiles a card in a way other than its first replacement effect, that card can't be cast with the second ability.",
	"Bonespitting Monstrosity": "The ability triggers after blockers are declared.",
	"Reflected Grandeur": "A token's name is its subtypes unless specified.",
	"Tender of the Land": "Tender of the Land's ability checks if you control four or more lands when it triggers and when it resolves.",
	"Vorreia, Farseer": "The value of X is determined as the ability resolves.",
	"Artificer's Workshop": "Artificer's Workshop's ability checks if an opponent controls more creatures than you when it triggers and when it resolves. If you control multiple Artificer's Workshop, you will only create Thopters until you have the same number of creatures as the opponent that controls the most.",
	"Monument of the Masses": "If Monument of the Masses is destroyed in response to the trigger, but no devotion counters are removed from it, the player still wins the game. Better deal with it before then.",


	"Battle for the Shield": "These are anchor words, and not modes.",
	"Elementalize": "The ability losing effect is a static effect, so the creature can't gain other abilities. It's power and toughness can change.",
	"Evil One's Mind Tricks": "These are anchor words, and not modes.",
	"Unstable Experiment": "Any copies of Unstable Experiment are considered \"reverberated\", even if they weren't copied by the reverberate ability.",
	"Violent Spasm": "Any copies of Violent Spasm are considered \"reverberated\", even if they weren't copied by the reverberate ability.",
	"Battle the Evil One": "These are anchor words, and not modes.",
	"Surge of the Fellors": "These are anchor words, and not modes.",
	"Exodus of the Khalizors": "These are anchor words, and not modes.",
	"Shared Vigor": "The value of X and Y are determined after all changes to base power and toughness have been applied, and before increases/decreases in power and toughness.",
	"Terrenal Might": "The value of X is determined as the ability resolves.",
	"Chain of Command": "If Chain of Command can't become attached to that creature, it will remain in the graveyard.",
	"Sellsword Contraption": "It's no longer a Construct.",
	"Amber Hills": "You can search for any card with the subtypes Forest and/or Plains.",
	"Flooded Depths": "You can search for any card with the subtypes Island and/or Swamp.",
	"Grim Bastion": "You can search for any card with the subtypes Swamp and/or Forest.",
	"Magmatic Torrent": "You can search for any card with the subtypes Island and/or Mountain.",
	"Sunlit Highland": "You can search for any card with the subtypes Mountain and/or Plains.",
	"Deadly Manipulation": "You still pay the mana cost and any additional costs of the copied instant or sorcery spell.",

	"Angelic Destiny": "If Angelic Destiny is no longer in a graveyard when its triggered ability resolves, it won't be returned to its owner's hand.",
	"Embodiment of Order": "When Embodiment of Order turns face up and becomes a creature, its no longer an enchantment.",
	"In the Face of Divinity": "In the Face of Divinity prevents creatures that are neither Angels nor Gods from attacking, not creatures that aren't Angel Gods.",
	"Oppressive Tithes": "Your opponents can still attack fortresses and/or planeswalkers you control.",
	"Eternal Recurrence": "If Eternal Recurrence is no longer in a graveyard when its triggered ability resolves, it won't be returned to its owner's hand.",
	"Gusma's Artisan": "You can't fail to find \"a card.\"",
	"Shaper of the Formless": "When that creature is turned face up, it will remain a copy of Shaper of the Formless (or the creature it is copying). It will trigger any \"When this creature is turned face up\" abilities.",
	"Taker of Tithes": "Whether you scry 1 or scry 100, Taker of Tithes will only get +1/+0.",
	"Crisis of Body": "You chose targets before your opponent decides to pay the life.",
	"Excise from Existence": "Noncreature permanents that share a name with the target won't be exiled, but nonland cards that do will.\n_ In the case of multiple libraries, this will search all starting and additional libraries.",
	"Mortality Keeper": "Mortality Keeper's ability checks if that player has 10 or less life when it triggeres and when it resolves.",
	"Unwavering Questant": "A trial is failed when an opponent doesn't pay life as a spell with the keyword trial is cast.",
	"Combatant Conflagration": "A trial is failed when an opponent doesn't pay life as a spell with the keyword trial is cast.",
	"Planar Conflagration": "You lose (or gain) the appropriate amount of life. This can be modified or replaced, such as by glory counters.",
	"Weavetide Militia": "Weavetide Militia's mana cost isn't reduced by creatures that attacked and died earlier in the turn.",
	"Worldsculpt": "A card you own from outside the game is a card in your sideboard.",
	"Bahet, God of Destruction": "When you turn Bahet face up, it stops being an enchantment.",
	"Gusma, God of Creation": "When you turn Gusmaface up, it stops being an enchantment.",
	"Ifram, God of Chaos": "When you turn Ifram face up, it stops being an enchantment.",
	"Ni'Ama, God of Adversity": "When you turn Ni'Ama face up, it stops being an enchantment.",
	"Sha'Iv, God of Order": "When you turn Sha'Iv face up, it stops being an enchantment.",
	"Silence of the Guilty": "You chose targets before your opponent decides to pay the life.",
	"Protector of the Innocent": "Protector of the Innocent's ability checks if that player has the lowest life total when it triggers and when it resolves.",
	"Angeltouched Cavern": "You can use the mana to cast a colorless spell.",
	"Angeltouched Crag": "You can use the mana to cast a colorless spell.",
	"Angeltouched Garden": "You can use the mana to cast a colorless spell.",
	"Angeltouched Marsh": "You can use the mana to cast a colorless spell.",
	"Angeltouched Saltflat": "You can use the mana to cast a colorless spell.",
	"Provoke the Gods": "Cards revealed this way that are exiled with prophecy will not be exiled with Provoke the Gods, so you will not lose life for those cards.",

	"Channel the Mirror": "Numbers include 1, 2, 3, etc., values include a, one, two, three, etc.. Mana symbols are neither and not affected by Channel the Mirror.\n_ This will increase the size of any token or counter created by it. +2/+2 and -2/-2 counters do not remove each other.",
	"Chantwood Channeler": "Chantwood Channeler ability will only trigger if it entered the battlefield under its owner's control. It does not need to enter due to its destiny ability.",
	"Ada's Mischief": "The spell effect added will occur after any effects the spell already has. Notably, if the spell would prevent all damage that would be dealt to its controller, it prevents the damage that will be dealt by itself.",
	"Dawn Chord": "A Dawn Chord on the battlefield has protection from cards and tokens named Dusk Chord in all zones.",
	"Dusk Chord": "A Dusk Chord on the battlefield has protection from cards and tokens named Dawn Chord in all zones.",
	"Shield of the Lha": "You can't tap an tapped creature as a cost, see rule 117.3.",
	"Elusive Fatecrafter": "If the damage can't be prevented, the exchange will still occur first.",
	"Arroyo, the Bound": "If Arroyo leaves the battlefield, the cards exiled by it can't be drawn by another Arroyo. Their owner can still look at them longingly.",
	"Alyss, Lawweaver": "If an effect can't be duplicated, such the attachment of an Aura or a card with fabled as it enters the battlefield, its controller chooses one of those targets for that part of the effect.",
	"Tempt Fate": "You can secretly name a card in Lackey by \"/secret <name>\" and reveal it with \"/reveal\".",
	"Firing Blind": "You can secretly name a card in Lackey by \"/secret <name>\" and reveal it with \"/reveal\".",
	"Ada, the Free": "The new target has the same restrictions as the original, and can't be the same target. If there is only one legal target, Ada's second ability does nothing.\n_ If an effect can't be duplicated, such the attachment of a card with fabled as it enters the battlefield, choose one of those targets for that part of the effect.",
	"Study Habitats": "You can fail to find the second creature, but the first will go on the bottom of your library.",
	"The Erased": "The Erased will interfere with any effect that cares about card types in these zones, for example Tarmogoyf will find zero card types, and Enlightened Tutor can't find an enchantment card.\n_ The Erased will prevent any abilities that function in these zones, such as Destiny, Engorge, Erratic, Inscribe, Purge, Prophecy, and Reprise.",
	"Forgotten Lessons": "You can fail to find the other two cards.",
	"Starwing Nebula": "Like prophecy, the effects that reveal cards exiled with Starwing Nebula retain relevant information but not the card.\n_ Cards exiled with one Starwing Nebula's first effect can't be cast through another Starwing Nebula's second ability.",
	"The Sun's Last Setting": "No lands are sacrificed, even if they are artifacts, creatures, enchantments, or planeswalkers as well.",
	"Bygone Blade": "You can't unequip Equipment.",
	"Bottled Fate": "Neither of the cards are drawn. If you have multiple libraries, you choose one library to take the top and bottom cards of.",
	"Mark of Majesty": "You can still activate the last ability if you control no untapped creatures.",
	"Lha Maria": "The power and toughness change is permanent until Lha Maria blocks again.",
	"Lha Sha'rador": "Sha'rador's emblem prevents you from sacrificing tokens or otherwise moving them from the battlefield to pay costs or as spell effects. If a player casts an Edict effect against you, you must sacrifice a nontoken creature if you have one.",
	"Lightcrafter": "Creature tokens created with a shimmer ability will still be exiled at end of turn.",
	"Manifest Memories": "Manifest Memories creates multiple delayed triggers similar to shimmer. Tokens created by it will attempt to be exiled at every end step.",
	"Sha's Summons": "State-based effects are checked during resolution. If there are no static buffs, the tokens will revert to 0/0 during the turn's first cleanup step. Any abilities that occur due to them dying occur during the current turn.",
	"Spellwoven Monster": "No matter what zone Spellwoven Monster is in, it can't be the target of spells or abilities.\n_ If a combination of text-adding and text-changing effects creates an instruction that's impossible to perform, such as \"Exchange control of two each lands\" or \"Destroy each artifact or enchantment\", that part of the instruction is ignored, see rule 101.3.",
	"Cavern Monstrosity": "An exiled split card's converted mana cost is equal to the sum of both its side's converted mana costs.",
	"Clawing Shaman": "Clawing Shaman's ability will only trigger if it enters the battlefield under its owner's control. It does not need to enter due to its destiny ability.",
	"Reflected Worldwalker": "The cards aren't exiled. They can only be retrieved by cards that can interact with your sideboard, such as Wishes.",
	"Fine Craftsmanship": "This can enchant an artifact creature, but the only useful effect will be giving it indestructible. If it stops being a creature, it will become an axe.",
	"Fueled Flame": "The catalyze occurs on resolution. If you cast multiple Fueled Flames, they do not count the catalyzes of unresolved Fueled Flames.",
	"Noirohpo Renegade": "The token will not retain previous prowess triggers.",
	"The Warrior Within": "Creatures with shimmer will only trigger the {0} ability once.",
	"Mirage Keeper": "If Mirage Keeper makes a copy of a token created with a shimmer ability, its copy will not be exiled at the beginning of the end step.",
	"Open the Wilds": "You cast it during resolution and have to pay for it if you do. If you don't, or if it's a noncreature, it will be exiled.",
	"Trade Blows": "State based effects aren't checked in between the fights, so neither creature will die until both have happened.",
	"Wild Hermit": "Wild Hermit will not make a Cat token if destiny exiles it.",
	"Mei Liva, the Forsaken": "When a card with Madness is discarded, it will be exiled, trigger it's own cast ability, and then trigger Mei's emblem. If the emblem's controller casts that spell, it can't be cast for its madness cost.",
	"Mental Meltdown": "If an Aura is entering the battlefield and it wasn't cast or given a target, you enchant it to any object it can enchant. It does not target if it attaches this way.\n_ Mental Meltdown overwrites the text of the spell, including characteristic defining abilities other than color indicators. It does not overwrite the card's name, type or mana cost, or any information on how the spell was cast, such as if it was kicked or cast for its prophecy cost. It also does not overwrite any non-text changing abilities acting on a card, notably, a card cast for its prophecy cost still can't be countered if it is enchanted by Mental Meltdown.",
	"Mirage Master": "Tokens created by a shimmer ability and Mirage Master's replacement effect will still be exiled.",
	"Curious Statue": "The ability checks the types when it triggers and when it resolves. If the bottom card doesn't share a type at either time, the ability won't resolve.\n_ If The Erased is on the battlefield, the second ability will never trigger.",
	"Shard Flower": "The trigger is not optional.",
	"Shimmersting": "Shimmersting creates multiple delayed triggers similar to shimmer. Tokens created by it will attempt to be exiled at every end step.",
	"Pristine Prison": "Your opponents can still attack any fortresses and/or planeswalkers you control.\n_ If you lose life after Pristine Prison's ability triggers and before it resolves, you will not get a glory counter.",
	"Singer of Songs": "If your life total becomes lower than your life total when the turn began after Singer of Song's ability triggers and before it resolves, you will not get a glory counter.",
	"Rite of Retribution": "If your opponent's no longer have more life than you after Rite of Retribution's ability triggers and before it resolves, you will not create an Elemental.",
	"Dwarven Twinslinger": "If Dwarven Twinslinger's power becomes less than the spell converted mana cost after its ability triggers and before it resolves, you will not copy the spell.",
	"Endless Reverie": "If multiple permanents are put into a graveyard at the same time, the triggered abilities can target the other card. For example, if two creatures you control die at the same time, you can return both of those cards to your hand.",
	"Chew the Scenery": "You may play lands this way if you have land drops remaining.",
	"Aleud Scorn": "The triggered ability is not a mana ability.",

	"Angel of Sands": "Angel of Sands counts any permanent with the subtype Plains.",
	"Avatar of Senmut": "Avatar of Senmut counts any permanent with the subtype Island.",
	"Sphinx of Riddles": "You can secretly name a card in Lackey's chat with \"/secret [name]\" and reveal it with \"/reveal\".",
	"Life-Giving Waters": "Both lands become the one chosen type. Those lands lose all abilities except for the mana ability given by their new basic land type.\n_ The lands enter the battlefield as they are printed, then change types. Normally you will be unable to activate those lands mana abilities before they change types.",
	"Adept Necromancer": "Adept Necromancer counts any permanents with the subtype Swamp.",
	"Warrior's Pride": "Warrior's Pride counts any permanents with the subtype Mountain.",
	"Antithesis": "If cast for its mirage cost, Antithesis will still be on the battlefield after the cleanup step removes any toughness-boosting effects. State-based actions will be checked before the mirage ability triggers to sacrifice it.",


	"Sythian Scripture": "Once Sythian Scripture has been cast, it is too late to remove the legendary creature or planeswalker.",
	"Entelan Erasure": "Once Entelan Erasure has been cast, it is too late to remove the legendary creature or planeswalker.",
	"Spellbane's Strike": "Once Spellbane's Strike has been cast, it is too late to remove the legendary creature or planeswalker.",
	"Electrical Eradication": "Once Electrical Eradication has been cast, it is too late to remove the legendary creature or planeswalker.\n_ Electrical Eradication is the source of the damage in both cases.",
	"Elemental Envelopment": "Once Elemental Envelopment has been cast, it is too late to remove the legendary creature or planeswalker.",


	"Seto San, the Sacred Hand": "The value of X is determined as the ability resolves.",
	"Swift Savior": "Swift Savior's ability checks if you control another legendary creature when it triggers and when it resolves.",
	"Astute Prophet": "Astute Prophet's ability checks if you control another legendary creature when it triggers and when it resolves.",
	"Kan'Gi, the Reverent": "Kan'Gi only checks the creature's power when that creature becomes its target.",
	"Patient Orchestration": "The sacrifice isn't optional. The rest of the effect only happens if you sacrifice Patient Orchestration on resolution.",
	"Strike Out": "You can't cast Strike Out unless it has three spells to target.",
	"Swelling Sea": "Swelling Sea will bounce itself with six or more counters.",
	"Depraved Imp": "Depraved Imp's ability checks if you control another legendary creature when it triggers and when it resolves.",
	"Ha'Eng, Figure of Greed": "You can still cast the cards if Ha'Eng leaves the battlefield.",
	"Infernal Portal": "Infernal Portal just cares if you lost the life, and will still trigger if you gained it back.",
	"Malefic Portal": "Malefic Portal checks what the last creature card that was put into your graveyard was as it resolves. If that card is no longer in your graveyard, Malefic Portal does nothing.",
	"Majestic Monitor": "Majestic Monitor's ability checks if you control another legendary creature when it triggers and when it resolves.",
	"Perplexing Turmoil": "The targets still have to be legal, and a spell with no legal targets still can't be cast.",
	"Zhenya, the Draconic": "Zhenya's ability will trigger if you don't control a creature with power 4 or greater, but if you still don't control one as it resolves, it won't deal damage.",
	"Attuned Ancient": "Attuned Ancient's ability checks if you control another legendary creature when it triggers and when it resolves.",
	"Resurging Rhino": "The tokens make tokens. Be careful out there.",	
	

	"Akrianos' Command": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	"Iridescent Familiar": "Iridescent Familiar checks if you control another creature with flying when it triggers and when it resolves.",
	"Merkurio's Command": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	"Vedalken Machinist": "Vedalken Machinist checks if you control three or more artifacts when the ability triggers and when it resolves.",
	"Kevthra's Command": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	"Seven Deadly Sins": "Seven Deadly Sins uses a conditional-when trigger, meaning that any time its condition is true and the ability is not on the stack, the ability will trigger. If you counter the ability, it will simply retrigger immediately after.",
	"Jeska's Command": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	"Violent Offensive": "Violent Offensive counts creatures that attacked, even if they are no longer on the battlefield.",
	"Fatresya's Command": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	

	"Paragon of Virtue": "The creature's controller gains the life.",
	"Publicly Disgraced": "If you cast Publicly Disgraced at the beginning of a player's upkeep, they won't skip a step due to Kept Under Watch.",
	"Kept Under Watch": "If you cast Publicly Disgraced at the beginning of a player's upkeep, they won't skip a step due to Kept Under Watch.",
	"Publicly Disgraced//Kept Under Watch": "If you cast Publicly Disgraced at the beginning of a player's upkeep, they won't skip a step due to Kept Under Watch.",
	"Mismatched Bandit": "Mismatched Bandit's ability checks if an opponent has more cards in hand than you when it triggers and when it resolves. If you control multiple Mismatched Bandits, you will only draw until you have the same amount of cards in hand as the opponent with the most.",
	"Generous Offer": "If you pick a targeted mode and a nontargetted mode and the target becomes illegal, the entire spell will be countered.",
	"Harmonized Intellect": "The spell effect added will occur after any effects the spell already has. Notably, if the spell would prevent damage that would be dealt to the target, it prevents the damage that will be dealt by itself.",

	"Banish the Impure": "If you didn't draft and note a number of cards for any cards named Banish the Impure, X is 0.",
	"Eternity Witch": "If you didn't draft any cards named Eternity Witch or exile any cards before the game started, X is 0.",
	"Gana-Mali Elite": "Don't cheat pls.",
	"Mentor of Champions": "Cards that are copies of creature tokens aren't tokens.",
	"Mentor of Generations": "If you didn't draft any cards named Mentor of Generations or note any names for cards named Mentor of Generations, you will still search and shuffle your library whenever it untaps.",
	"Nayando Greatwarden": "If your life total becomes less than your starting life total after Nayando Greatwarden has been assigned to block two creatures, it will still be blocking those two creatures.",
	"Omensoul": "The return is not optional. You will have to bounce Omensoul if you have no other creatures.",
	"Prairie Companions": "If you didn't draft and note names for a card named Prarie Companions, its abilities will do nothing.",
	"Savanna Warden": "If you didn't draft and note players for a card named Savanna Warden, its hunt abilities will do nothing.",
	"Temple Tender": "If you didn't draft and note players for a card named Temple Tender, its abilities will do nothing.",
	"Cliffshard Serpent": "Cliffshard Serpent can't attack unless you drafted and noted a player for a card named Cliffshard Serpent. It can still block, and attack planeswalkers or fortresses.",
	"Crovoan Storyteller": "If you didn't draft and remove cards from the draft with cards named Crovoan Storyteller, X is 0.\n_ If a card you remove requires you to reveal it as you draft it, do so and follow any additional instructions it may have related to drafting it. However, if a card you remove instructs you to draft it face up, it has no effect while face up and can't be turned face down to use an ability.\n_ Some cards allow you to exile other cards you've drafted that aren't in your deck before the game starts. Cards you removed from the draft with Crovoan Storyteller can't be exiled this way because they aren't in your card pool.",
	"Dreamstrider": "If you didn't draft and note players for a card named Dreamstrider, its hunt abilities will do nothing.",
	"Ixolti the Enigma": "You have to exile spells you cast from your hand that share a converted mana cost with a spell exiled with Ixolti's abilities, even if you do not want to or can't cast the spell you will copy. You must also cast the spell if it has legal targets.",
	"Leyline Guide": "If you didn't draft and note players for a card named Leyline Guide, its hunt abilities will do nothing.",
	"Mystic Meddling": "In a Constructed tournament, \"outside the game\" refers to that player's sideboard. In a Limited game, \"outside the game\" refers to all cards that player drafted that aren't in that player's deck or removed from that player's card pool. Otherwise, it refers to any card in MSEM.",
	"Reduce to Myth": "If you didn't draft and not players for a card named Reduce to Myth, it will have no legal target and can't be cast, or will be countered as it tries to resolve if you copied or gained control or it.",
	"Rhythmic Mystic": "During an end step, any \"At the beginning of the end step\" abilities trigger. Damage remains on permanents, players do not discard down to their maximum hand size, and the turn doesn't end.\n_ If you didn't draft and note a step for a card named Rhythmic Mystic, its extra step ability will do nothing.",
	"Ashen Antiquity": "If you target a card in a graveyard with flashback and it's owner flashes it back, Ashen Antiquity will be countered as it tries to resolve and that player won't lose life.",
	"Catacomb Skulkers": "Vehicles and Animus aren't creature cards.",
	"Choir of Wails": "If you put a creature card put into your graveyard with Choir of Wails back on top, it will still create a Zombie.\n_ If you have multiple libraries, you will choose one of them and both parts of the spell will use that library.",
	"Court Insanity": "Multiple players may choose the same creature. The effect is cumulative.",
	"Dread Resurrection": "You must choose Dead Resurrection's target before you pay its cost. You can never put one of the creatures sacrificed to pay its flashback cost onto the battlefield with it.",
	"Foul Cure": "If you didn't draft and note a number for a card named Foul Cure, it will reveal 0 cards and do nothing.",
	"Gifter of Lineages": "You can turn more than one Gifter of Lineages face down as you draft cards from a booster pack, after the first they will replace one of the cards drafted with the first Gifter of Lineages. You may use this to draft a card you put back with another Gifter of Lineage if you have buyer's remorse.",
	"Grave Defiler": "If you did not draft and exile creature cards for a card named Grave Defiler, its ability will trigger and create 0 Zombies.",
	"Molder": "If Molder's target has become black (or stopped being a creature or planeswalker) as it tries to resolve, it will be countered.",
	"Obligate": "After the last card has been drafted from a pack, look at each card a player you noted for Obligated drafted this round. You choose up to one card per player, and that player looks at the cards you drafted this round and chooses a card that doesn't share a color with that card. You may then make the exchange.\n_ If you would exchange with multiple players, exchange in the passing order of the round that just ended.",
	"Offering Quetzal": "The card only needs to be revealed for as long as the player you pass the pack to has the pack.",
	"Soulfire Rogue": "As Soulfire Rogue's ability resolves, you must sacrifice it if able. If you can't, the rest of the ability will not happen.",
	"Stonecur Cursemonger": "This uses the value of its toughness as it died, which may not be 4.",
	"Blaze Devastator": "If you did not draft and note a name for any cards named Blaze Devastator, it's ability will do nothing.\n_ As this ability does not occur during the draft, Tome of Ideals will not allow you to note any additional names.",
	"Firesong Dancer": "If you did not draft and note a number of cards for any cards named Firesong Dancer, X is 0.",
	"Forging the Sun": "Copying a spell is not casting a spell unless the effect specifically says \"cast\".",
	"Infectious Aggression": "That creature can still attack a planeswalker or fortress you control.",
	"Magma Veil Agressor": "If you didn't draft and note a player for any cards named Magma Veil Agressor, its ability will do nothing.",
	"Prey Stalker": "If you didn't draft and note a player for any cards named Prey Stalker, its ability will do nothing.",
	"Pyre Intimidator": "If you didn't draft and note a player for any cards named Pyre Intimidator, its damage doubling ability will do nothing.",
	"Recollection Ritualist": "If you didn't draft and note a name for any cards named Recollection Ritualist, its ability will do nothing.",
	"Swarm of Malice": "Swarm of Malice and the creature tokens will not be on the battlefield at the same time.",
	"Unstable Ground": "Glory counters do not prevent damage.",
	"Call to the Wilds": "If you didn't draft a card named Call to the Wilds or remove any cards from the draft with one, you can still search for a creature with converted mana cost 0.",
	"Catacomb Spider": "This ability does not target those cards.",
	"Cavern Excavation": "You can return a land card put into your graveyard by Cavern Excavation's derange ability.",
	"Elusive Chimera": "If you didn't draft a card named Elusive Chimera and note a number of times you returned Elusive Chimera to the draft, creature spells you cast with converted mana cost 0 can't be countered.",
	"Feral Challenger": "If you didn't draft and note a player for any cards named Feral Challenger, its ability will do nothing.",
	"Grove Strider": "You chose the value of X as the ability triggers, but you won't pay that mana until the ability resolves. You may be unable to pay for the ability at that time.",
	"Nayando Lost": "Nayando Lost's ability checks if there is a creature card in your graveyard as it triggers and as it tries to resolve.",
	"Runed Elk": "If you did not draft and note basic land types for any cards named Runed Elk, you will search your library, be unable to find any cards, and shuffle your library.",
	"Sage of All": "If you didn't draft and note players for cards named Sage of All, its power and toughness will be 0.",
	"Stumble Upon": "You don't have to find two land cards to put into your graveyard.",
	"Vibrant Vigor": "If you didn't draft and note colors for cards named Vibrant Vigor, X is 0. It will still untap the creature.",
	"Alpha Packleader": "If you didn't draft any cards named Alpha Packleader or remove any creature cards from the draft with it, its abilities will do nothing.",
	"Answer by Fire": "Answer by Fire doesn't need to target a planeswalker, but it does need to target a creature. If all of its targets are illegal as it tries to resolve it will be countered.",
	"Atzol Sandskitter": "If you didn't draft and note a player for any cards named Atzol Sandskitter, its ability will do nothing.",
	"Atzol Surveyor": "If you didn't draft and note names for any cards named Atzol Surveyor, you can still exile cards with converted mana cost 0 from a graveyard.",
	"Callous Dredging": "You can return a card put into your graveyard by Callous Dredging's derange ability to your hand.",
	"Constant Discharge": "If you didn't draft and note names for any cards named Constant Discharge, its graveyard ability will do nothing.",
	"Fateweave Mystic": "If you didn't draft and note names for any cards named Fateweave Mystic, its graveyard ability will do nothing.",
	"Frantic Delving": "You may put a card put into your graveyard with Frantic Delving's derange ability on top of your library.\n_ These are two separate effects, so in the case of multiple libraries, you can choose a different library for the effect and the Derange ability.",
	"Gana-Mali Forces": "If you didn't draft or note any colors for any cards named Gana-Mali Forces, its ability will do nothing.",
	"Mariette, the Overseer": "Creatures that are 1/1 because of a characteristic-defining ability (usually templated as \"This creature's power and toughness are each equal to ...\") or due to having their power decreased can still attack. Creatures with printed power and toughness or overwritten base power and toughness (such as caused by Mariette's activated ability) 1/1 can't attack even if their power or toughness is changed by a +N/+N effect or counters.",
	"Mariette's Obtainers": "If you didn't draft and note names for any cards named Mariette's Obtainers, it's last ability will do nothing.",
	"Mystic Quetzal": "If you didn't draft or note any names for cards named Mystic Quetzal, its last ability will only trigger when it enters the battlefield.",
	"Nayando Lightcrafter": "This allows you to target creatures with protection or hexproof, but, for example, also allows you to target creatures with flying with noncreature spells that say \"target creature without flying.\"\n_ This will allow you to target creatures with Auras that you normally could not, however if the Aura can't enchant that creature, possibly due to a protection ability, the Aura will never enter the battlefield and instead be put directly into its owner's graveyard.",
	"Stampeding Baloth": "If you didn't draft and note any players for cards named Stampeding Baloth, its ability will do nothing.",
	"War-Call Rallier": "If you didn't draft and note names for any cards named War-Call Rallier, then its second ability will do nothing.",
	"Zeolatra Elder": "Zeolatra Elder's ability checks if you have 10 or less life as it triggers and as it tries to resolve.",	
	"Tome of Ideals": "This will not apply to any abilities that happen after the draft, namely Blaze Devastator.",
	
	"Absolve": "Any abilities that work \"as long as that card remains exiled\", including inscribe and prophecy, stop working because the card becomes a new object even though it remains in exile.\n_ When it becomes a new object, it gets a new timestamp.",
	"Senaturian Legion": "An EDH deck can also have any number of creatures named Senaturian Legion.",
	"Betrayal of Steel": "The Equipment will remain attached to any creature it is attached to, but you will control all its abilities, including its equip ability.",
	"End of the Empire": "End of the Empire's last ability will trigger at any point it has no fate counters on it and the ability is not already on the stack. If it is countered, it will simply trigger again.\n_ As End of the Empire's ability resolves, you must sacrifice it if able. If you can't, for example you no longer control it as the ability resolves, the rest of the ability does nothing.",
	"Light Within Shadow": "Effects that set a player's life total higher than it current is actually cause that player to gain that much life",
	"Iaijutsu": "The creature won't be sacrificed if you no longer control it.",
	"Kasai, Asharo's Legacy": "If multiple replacement effects are applied to the same permanent, that permanent's controller decides the order that they apply.",
	"Way of the Dragon": "Any currently inscribed cards will stop being inscribed as they are exiled.",
	"Yamisaran Bladedancer": "You can attach an Equipment you control to a creature you don't control. You will still control the abilities of that Equipment.",
	"Mana Ascetic": "Mana Ascetic is being exiled from your graveyard.",
	"Moranai Paragon": "Moranai Paragon will know how many reinforcement counters were on it if it dies.",
	"Scion of Scales": "Once blockers have been declared, it doesn't matter if the creature's power becomes greater than 2, it will still be blocking.",
	"General Takaki": "If multiple replacement effects are applied to the same permanent, that permanent's controller decides the order that they apply. in particular that means you can apply General Takaki's ability before any abilities that add or double damage apply.\n_ General Takaki's ability works unintuitively with trample. Lethal damage is determined by the amount of damage a creature assigns (usually with its power) and not the amount of damage it will deal due to replacement effects. If you attack with a 1/1 trampler it will deal 3 damage to its blocker and no damage to the defending player.",
	"Imako, Ninefingers": "\"cards exiled with Imako\" refers to cards exiled with its 'becomes tapped' ability. If Imako somehow exiles cards another way, those are not linked to its printed abilities.",
	"Asahi Yoroi": "The buff applies to all creatures you control that are equipped, not just equipped creature.",
	"Eternal Inheritance": "Eternal Inheritance's ability checks if you control a Samurai as it triggers and as it tries to resolve.",
	"Kiri Yoroi": "The buff applies to all creatures you control that are equipped, not just equipped creature.",
	"Setsui Yoroi": "The buff applies to all creatures you control that are equipped, not just equipped creature.",
	"Anzen, Beyond the Sea": "If Anzen becomes a basic land type (even Island), it will lose the ability that causes every land to be an Island and it will not apply.",
	"Dragonwall Gates": "Dragonwall Gates doesn't have a power or toughness unless it is a creature.",
	"Kurayami Shrine": "Kurayami Shrine doesn't have a power or toughness unless it is a creature.",
	"Unzari Ruins": "Unzari Ruins doesn't have a power or toughness unless it is a creature.",
	"Asharo's Handmaiden": "The timing of this triggered ability is as follows: The target is chosen as the ability triggers. You choose whether or not the Inscription will be exiled when the trigger resolves. If you do and that creature is no longer on the battlefield when that Inscription resolves, the Inscription will be exiled but not inscribed onto anything. Once the ability has triggered, removing Asharo's Handmaiden has no effect on the ability's resolution (unless it happens to be the target).",
	
	"Liguno, Who Transcends All": "If Liguno and one or more other permanents you control would be put into a graveyard simultaneously, they are all exiled instead.\n_ All cards exiled by Liguno will return to the battlefield simultaneously. Starting with the active player and proceeding in turn order, each player decides the order of any abilities they control that trigger this way and puts them on the stack.",
	"Moonshadow Remnant": "If the target of Moonshadow Remnant's ability isn't tapped as it tried to resolve, it will be countered.",
	"Wehre-District Patrollers": "Wehre-District Patrollers will get this bonus whether or not it is also attacking or blocking.",
	"Fleeting Memory": "Fleeting Memory will attempt to exile itself every end step, even if the ability is countered, exiled, or avoided by ending the turn.",
	"Fractal Findings": "Fractal Findings doesn't care how you sacrifice a Clue.",
	"Remy, Last of Evanescier": "Remy has protection from any object that has the subtype Illusion, including any abilities with an Illusion object as their source. In practice, Remy has protection from everything but Remy and emblems, but it also won't have protection from anything that loses the Illusion subtype.\n_ Remy's ability that adds Tribal - Illusion uses timestamps. If a permanent loses all creature types before Remy enters the battlefield, it will be an Illusion, if it loses all creature types after Remy enters the battlefield, it will not.",
	"Callous Ritualist": "You can't exile the creature you sacrificed or a creature card you discarded to activate Callous Ritualist's ascend ability to pay for the exile portion.",
	"Deformed Vagrant": "If the creature blocking Deformed Vagrant's becomes greater than it's after the block has been assigned, it's still blocking Deformed Vagrant.",
	"Stay Determined": "If one or more replacement effects are being applied to you, for example Stay Determined and glory counters, you choose the order that they apply.\n_ This card uses a replacement effect. This means the player who chooses which library will be affected in the case of multiple libraries can be messy to determine.\n_ Life loss caused by combat damage has no controller. The player affected by the replacement effect will choose which libraries will be affected.\n_ Life loss caused by spells and abilities either by direct life loss or by damage has the same controller as the spell or ability. That player will choose which libraries will be affected.",
	"Wanderer of Oblivion": "You can only play cards exiled with Wanderer of Oblivion's ability, not with cards exiled with Leyline Tracer's ability. This is true even if it transforms without leaving the battlefield.",
	"Loresprout": "Loresprout's ability checks if you control another creature as it triggers and as it tries to resolve.",
	"The Midwife": "You can choose 0. The creature the target you contro becomes will likely die the next time state-based actions are checked.",
	"Bestial Mob": "If the target's toughness is greater than or equal to Bestial Mob's toughness as its ability tries to resolve, the ability will be countered.",
	"Border Guardian": "The return is not optional, and you will have to bounce Border Guardian if you control no other creatures.",
	"Rheila Rachy": "An emblem outside the command zone ceases to exist.",
	"Doctored Trail": "If the Clue is not on the battlefield when Doctored Trail tries to resolve, you will not draw a card. If that Clue is still on the battlefield but has indestructible or it is regenerated, you will draw a card.",
	"Skull of the World": "You can discard a hand of no cards, but the ability will do nothing. Once you have activated Skull of the World, it is too late to draw or discard cards to change whether or not you discarded a card to activate it.",
	"Abandoned Forge": "If Abandoned Forge enters the battlefield simultaneously with another nonbasic land and you don't control any nonbasic lands, it will enter the battlefield untapped.",
	"Abandoned Hideout": "Abandoned Hideout enters the battlefield simultaneously with another nonbasic land and you don't control any nonbasic lands, it will enter the battlefield untapped.",
	"Abandoned Laboratory": "Abandoned Laboratory enters the battlefield simultaneously with another nonbasic land and you don't control any nonbasic lands, it will enter the battlefield untapped.",
	"Abandoned Preserve": "Abandoned Preserve enters the battlefield simultaneously with another nonbasic land and you don't control any nonbasic lands, it will enter the battlefield untapped.",
	"Abandoned Shores": "Abandoned Shores enters the battlefield simultaneously with another nonbasic land and you don't control any nonbasic lands, it will enter the battlefield untapped.",
	"Embrace Samang": "Embrace Samang doesn't count itself when counters are placed on it.\n_ This is not a mana ability.",

	"Volta's Toolbox": "Your initial hand is the hand you draw before taking any mulligans, or apply any affects that allow you to draw additional hands, such as Backup Plan or another Volta's Toolbox. In these cases you should make sure you make your starting hands clear, such as using your hand and your Hidden zone to keep the hands seperated.",

	"Fjorda of Jorundar": "Creatures have to be both the chosen type and the chosen color to get +1/+1",
	"Helvalla, God of Glory": "Helvalla doesn't mind if all those creatures were exerted anyway, you will still get the token.",
	"Mountainside Watcher": "If Mountainside Watcher enters the battlefield as a snow permanent, its snowfall ability will trigger.",
	"Steadfast Footing": "If Steadfast Footing enters the battlefield as a snow permanent, its snowfall ability will trigger.",
	"Crawling Glacier": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Dawn of the Lights": "If Dawn of the Lights enters the battlefield as a snow permanent, its snowfall ability will trigger.",
	"Ebilir, God of the Depths": "You can exert one creature or no creatures.",
	"Frontier Survivalist": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Irrblossom": "The draw is not optional. If the ability is not countered and the draw is somehow replaced, you will still discard a card.",
	"Snowsculptor": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Endless Journey": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Glory Bound Brawler": "If Glory Bound Brawler dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Hand of Ravenwood": "If Hand of Ravenwood enters the battlefield as a snow permanent, its snowfall ability will trigger.",
	"Jorundar Infiltrator": "If Jorundar Infiltrator dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Mead-made Bruiser": "If Mead-made Bruiser dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Necrotic Diviner": "Necrotic Diviner has to still be in your graveyard when its ability resolves in order to exile it.",
	"Nehel, God of Shadow": "Once Nehel has attacked or blocked, removing creature cards from graveyards won't be able to prevent it from attacking or blocking.",
	"Rising Snowbanks": "You can sacrifice a creature that has more than X counters on it.",
	"Stormtide Siren": "If Stormtide Siren dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Stonework Vagrant": "Stonework Vagrant's ability will be countered if the targetted creature no longer has a counter on it as it tries to resolve.",
	"Uloff, the Winter Hunt": "Uloff's ability will be countered if the targetted creature no longer has a counter on it as it tries to resolve.",
	"Uloff's Assertion": "Uloff's Assertion uses the converted mana cost of the named card, not of the permanent activating the ability. This is mostly relevant for revive tokens.",
	"Fjall Scavenger": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Imitater of Forms": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Inner-Fire Dwarf": "If Inner-Fire Dwarf dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Kindle Strikers": "If Kindle Strikers dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.\n_ This mana is very easy to lose. Mana pools empty in between first strike damage step and the normal damage step, and between the normal damage step and end of combat step.",
	"Last Lash": "Damage has to be assigned before it is doubled. This is most relevant with trample and multiple blockers, which still have to be assigned as normal.",
	"Valley Raiders": "If Valley Raiders dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Hanatun Hydra": "If Hanatun Hydra dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.\n_ Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Looming Threat": "If Looming Threat enters the battlefield as a snow permanent, its snowfall ability will trigger.",
	"Peerless Brawler": "The effects don't end at end of turn.",
	"Snowswell Troll": "You can't sacrifice the permanents even if you really want to.\n_ Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Virida Avenger": "If Virida Avenger dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Fjall Huntmaster": "If Fjall Huntmaster dies at the same time as a creature it dealt damage to this turn, its brutalize ability will still trigger.",
	"Vantage Bridge": "Vantage Bridge may trigger multiple times at once. Each of these triggers checks the converted mana cost of the top card of your library *only* when it triggers. You will reveal each card drawn with Vantage Bridge but the draw is not conditional on those card's converted mana cost.\n_ If you have multiple libraries, Vantage Bridge will trigger once if a creature with the power less than the converted mana cost of any of your libraries attack you or a planeswalker you control.",
	"Frozen Expanse": "Snow mana is the same as generic mana, with the restriction that the mana be produced by a snow permanent.",
	"Amil the Seeker": "Amil can block for herself if she's a creature.",
	"Impulsive Plan": "If you have fewer than two cards in your hand, you will still have to exile as many cards as you can. You will only draw three cards if you exile two cards.",
	
	"Untouched Duelist": "Menace and engage can interact weirdly. If there are multiple requirements on how creatures can block, the maximum amount of requirements must be obeyed. If Untouched Duelist attacks...\n_ vs. 1 creature, that creature blocks as normal.\n_ with another engage creature vs. 2 creatures, either of your creatures can be blocked.\n_ with two other engage creature (or a creature that all creatures must block) vs. 2 creatures, Untouched Duelist can't be blocked.",
	"Figures in the Mist": "Once blockers have been declared, changing their power won't prevent those blocks from happening.",
	"All or Nothing": "If a card with prophecy is revealed this way, it will be exiled and not put into your hand. You will still lose life equal to its converted mana cost.",
	"Nataila, Raven's Repented": "Nataila checks if it is the only creature attacking or blocking when damage is dealt. This also checks if other players creatures are attacking or blocking in multiplayer games.",
	"Master of Disorientation": "If you can't target a spell when Master of Disorientation enters the battlefield, the ability will be countered and you won't proliferate.\n_ If you chose not to change the target spell's targets, you will still proliferate.",
	"Heedless Lovers": "If Heedless Lovers is in your graveyard by the time its ability triggers (for example, if it entered the battlefield with 0 toughness), it can target itself.",
	"Vigilante's Cowl": "If a creature's power and/or toughness is defined by its own ability, losing that ability will cause those values to become 0.",
	"Arctic Mine": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Crystal Cavern": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Forgotten Steppe": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Nomad's Township": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Shifting Glade": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Crumbling Precipice": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Rampant Summit": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Resplendent Substratum": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Sedate Tundra": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Murmuring Falls": "You can get additional basics onto the battlefield in response to the trigger in order to avoid life loss.",
	"Serene Prayer": "If you also have glory counters, you choose which replacement effect to apply first.",

	"Daybreak": "This means they pay mana equal to the number of creatures attacking, not mana equal to the number of attacking creatures for each creature.",
	"Devoted Dancer": "The shuffle isn't optional.",
	"Gift of Eternity": "Setting your life to a number means gaining or losing the amount of life necessary to have that much life. If you have glory counters, you will lose them first and end up with more than 5 life.",
	"Starglare": "You may still target a creature even if you do not pay {R} to cast Starglare",
	"United Force": "Once United Force has been cast, it is too late to change the colors among permanents you control.",
	"Aerolius": "Standard searching rules still apply. That player can fail to find even though their hand is revealed.",
	"Dodgy Infant": "The target must still be legal. For example, you can't redirect the target of an opponent's spell to a creature with hexproof you control.",
	"Monkeyshines": "You put both cards in your graveyard or back on top, you can't split them.",
	"Orria Mirrorpelt": "Each other creature means for each creature that isn't Orria Mirrorpelt. Her copies won't naturally target herself.",
	"Slippery Capuchin": "The target must still be legal. For example, you can't redirect the target of an opponent's spell to a creature with hexproof you control.",
	"Thunderstride": "Thunderstride counts itself the turn it was cast.",
	"Heart of the Deadwood": "If there is not a creature and a creature card to target when the ability is put on the stack, it will be countered. If both of them are targetted, making only one target illegal will not counter the rest of the ability.",
	"Whispers of the Dark": "If it's a nonland permanent or a spell you decided not to cast, put it into your hand.",
	"Feathered Warden": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Cloudstep Capuchin": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Pelt Mystic": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Stinging Hunter": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Ralora Adept": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Pond Tenders": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Gim-Chimya, the Invisible": "This effectively means players have no maximum hand size.",
	
	"Chief Striking Dawn": "Dawn's ability doesn't target. The card she reanimates will be chosen on resolution.",
	"Bearidge Marshall": "If the target of the ability can't be enchanted by the Aura, the Aura will never enter the battlefield.",
	"Lone Stranger": "Lone Stranger's ability will check if you control no other creatures as it triggers and as it tries to resolve.",
	"Ride into the Sunset": "If an ability creates multiple tokens, the ability will trigger multiple times.",
	"Uncommon Grit": "The creature won't get the counter until after the damage is dealt.",
	"Warning Shot": "Warning Shot checks your graveyard on resolution.",
	"Aetherite Slugs": "If Aetherite Slugs enchants a spell, it will be put into its owner's graveyard as a state based action when that spell leaves the stack, even if it becomes a permanent.",
	"Cage the Mind": "The target of Cage the Mind's first mode must already have been detained before it is cast. If it somehow stops being detained, it will no longer be a legal target.",
	"Fool's Gold": "If Fool's Gold's target has become multicolor as it tries to resolve, Fool's Gold will be countered.",
	"Winning Hand": "Winning Hand doesn't count towards the number of cards in your hand.",
	"Window Shopping": "If you draw two cards, the rest of the piles is both piles.",
	"Graygulch Revenant": "If multiple players lose life simultaneously, the triggers will be put on the stack in turn order starting with the active player, meaning the active player (or next player who lost life in turn order) will end up with the Revenant.",
	"Howler Sellout": "You can't target a creature multiple times with this trigger.",
	"Wendigo": "The sacrifice isn't optional. If you don't feed the Wendigo, it will eat itself. It will do so before any +1/+1 counters are put on it.",
	"Brazen Drifter": "Brazen Drifter doesn't care who or what those creatures attack.",
	"Open Road": "Open Road checks if that permanent has the greatest converted mana cost before it will trigger and as it tries to resolve.",
	"Tavern Brawl": "Tavern Brawl will trigger before the active player has an opportunity to activate loyalty abilities of a planeswalker that entered the battlefield.",
	"Mistbreaker": "This includes effects on Mistbreaker, such as detain, and evasion abilities, such as flying or menace.\n_Mistbreaker is still unable to attack or block if it is tapped or block multiple creatures without additional effects.\n_ Mistbreaker can still be forced to attack or block a certain way. Effects such as \"All creatures able to block this creature do so.\" or \"Creatures your opponents control attack this planeswalker if able.\" will still affect Mistbreaker.\n_ Effects are ignored only if they would be legal without Mistbreaker. If an opponent controls a Ghostly Prison, you must still pay {2} for each creature that's attacking that player other than Mistbreaker. Mistbreaker and another creature can both block a creature that can only be blocked by one creature.",
	"Stickup": "You will cast the card after any triggers caused by discarding the card, but before they resolve. Notably, a card stolen with Stickup can't be cast for its madness cost.",
	"Unassuming Swineherd": "This means abilities that trigger on creatures dying or cards entering a graveyard will not trigger.",
	
	"Holy Reverence": "Holy Reverence does not prevent damage. It causes some damage to be unable to lower your life total. So any damage rendered useless by Holy Reverence was still dealt and is counted by effects that track the amount of damage done to a player. In addition, Holy Reverence does not prevent loss of life, so loss of life bypasses Holy Reverence.",
	"Scout the Sands": "This counts Desert lands twice.",
	"Survival Instincts": "Enchanted creature does not have protection from instant or sorcery cards, only from spells on the stack.",
	"Sandstorm Ascendant": "The lands will be Deserts as they enter the battlefield.",
	"Interplanar Lens": "That cards converted mana cost has to be exactly the number of counters removed from Interplanar Lens.",
	"Fateshaper": "This ability doesn't trigger for cards discarded as a cost.",
	
	"Mirai, Spring's Promise": "If the same planeswalker is somehow the target of Mirai's first ability twice in one turn, you won't be able to activate loyalty abilites of that planeswalker more than twice in one turn.",
	"Enlightenment": "Enlightment's ability will not trigger or resolve if you have already chosen to exile a permanent with its ability this turn.",
	"The Serpent Throne": "The Serpent Throne's ability will not trigger or resolve if you have already chosen to create a token with its ability this turn.",
	"Abscond": "The target's converted mana cost has to be exactly X.\n_ Most tokens, including those created by Revive, have no mana cost. Tokens that are exact copies of cards will retain their mana cost.",
	"Arcane Strategist": "Arcane Strategist's ability will always trigger when you cast a spell. It only checks if there is a card with the same name in your graveyard as the ability resolves.",
	"Daughter of Suisei": "Daughter of Suisei's ability will always trigger when you cast a spell. It only checks if there is a card with the same name in your graveyard as the ability resolves.",
	"Hisano the White Lion": "This includes the spirited ability of the permanent.",
	"Stonework Infantry": "Stonework Infantry's triggered ability won't resolve if Stonework Infantry leaves the battlefield while the ability is on the stack.",
	"Past, Present, Future": "In the case of multiple libraries, Past, Present, Future's controller will choose one of their libraries. The card will be exiled from that library and be put on top of that library.",
	"Spirit Script": "If Spirit Script becomes a copy of a card and then leaves the graveyard, it will stop being a copy of the card. However, if it left the graveyard due to an ability allowing you to cast it (such as flashback or conjure) it will keep that ability.\n_ If an effect moves a Spirit Script that is copying a card from your graveyard and then asks for characteristics of that card (for example: Exile target card from a graveyard. If it was an instant, draw a card.) it will use the characteristics of the card Spirit Script was copying.",
	"Ginjiro Chimei": "If an effect moves a card that is copying another card from your graveyard and then asks for the characteristics of that card (for example: Revive), it will use the characteristics of the card it was copying.\n_ When the card leaves the graveyard, it will stop being a copy. If an effect was allowing you to cast that card due to one of its characteristics (for example, having the name chosen for Chigau, the Red Market) that card will be illegal to cast and remain in your graveyard. However, if the card copied an ability that allowed it to be cast, it will keep that ability as you cast it. For example, you can cast a spell for its copied Conjure cost as the card it's printed as (and in this case, if that spell becomes a permanent, it will be exiled when it enters the battlefield as normal.)\n_ If the copied creature has an ability that moves it from the graveyard to the battlefield (for example: Unearth), the card will attempt to enter the battlefield no longer as a copy of that card. If it is not a permanent card, it will remain in your graveyard.",
	"Soulkindle Lantern": "Soulkindle Lantern only reduces the cost of activated abilities. Abilities such as flashback, reprise, and conjure are not reduced by this effect.",
	"Chigau, the Red Market": "Chigau will allow you to cast a spell with that name each turn, but does not bypass timing restrictions. A creature with flash can be cast on your opponent's turns but one that doesn't can't.",
	"Thunderlash Mystic": "Inscribed cards will not be case when Thunderlash Mystic unless those cards have inscribe.",
	
	"Shatter Facade": "Shatter Facade doesn't care how it was cast from exile, only if it was or not.",
	"Sigil of Radiance": "This prevents cards from being exiled from graveyards as a cost, such as Roggar's Frenzy and Cranial Violation.",
	"Disruptive Echoes": "Disruptive Echoes doesn't enter the battlefield tapped.",
	"Aether Ascendant": "If you have Aether Ascendant become a copy of an instant or sorcery spell, it will no longer be a creature spell and won't enter the battlefield.\n_ Aether Ascendant will be a creature spell until its cast trigger resolves.",
	"Confirm Hypothesis": "If this copies an orchestrate triggered ability, you will cast the card from exile and the original ability will be unable to.",
	"Rahit, Immaculate Architect": "A spell with {X} in its mana cost uses the value of X to determine its converted mana cost. A discarded card with {X} in its mana cost uses X=0 to determine its converted mana cost.",
	"Rahit's Prodigy": "If you can't target an instant or sorcery card in your graveyard, the ability will be removed from the stack and you won't discard a card.",
	"Salva Tore's Study": "Salva Tore's Study's defines which library you draw from. You can't draw from another library with its ability.\n_ If you don't own the archived library (for example, you gained control of the Study), the ability will still trigger. No one will draw a card from the archived library, but you will still lose 1 life.",
	"Arpechian Tiger": "You choose the target when Arpechian Tiger attacks, but you decide whether to sacrifice the land when the ability resolves.",
	"Cavorting Beauty": "Cavorting Beauty's ability checks if the spell's converted mana cost is less than its power as the ability triggers and as it tries to resolve. If its power is less than or equal to that spell's converted mana cost at either point, it won't resolve.",
	"Exhilarating Prescience": "You still pay the mana costs of those cards. You can pay any alternate costs.",
	"Prismatic Leyline": "Prismatic Leyline doesn't care if there are any restrictions on casting or spending that mana. Mana produced by Prismatic Leyline won't have those restrictions.\n_ If that land can't produce colored mana, Prismatic Leyline won't produce mana.",
	"Reckless Festivities": "Passing for Reckless Festivities lasts through the entire spell, not just that process.",
	"Misleading Tactics": "Blockers will have already been declared by the time you can cast Misleading Tactics.",
	"Mechanized Ideal": "If you control multiple Mechanized Ideals (or other creatures who's base power or toughness depends on other creatures), their base power and toughnesses will be applied in timestamp order after all others have been determined. If you have two Mechanized Ideals, the one that was played later will have 1 more power and toughness than the other.",
	"Possibility Matrix": "You choose which card to cast as the ability resolves.",
	"Spellslinger's Gauntlet": "You can't pay any alternate costs for the copy, but you can pay any additional costs.",
	"Lunar Arbiter": "If a player is simultaneously dealt combat damage by multiple creatures, that player will lose life only once (and thus lose only 3 life).\n_ If a player simultaneously gains life from multiple sources (such as lifelink), the replacement effect will still apply to each instance of life gain.",
	
	"Cranial Archive": "In the case of multiple libraries, the controller of Cranial Archive's activated ability as it resolves chooses which library the graveyard will be shuffled into, even if it targets an opponent.",
	"Telling Time": "In the case of multiple libraries, Telling Time's controller as it resolves will choose one library for this effect, the cards that go on the top and bottom of the library will go on the top and bottom of the same library.",
	"The Tideshift": "In the case of multiple libraries, The Tideshift's controller as it resolves will choose one library for each player. The creatures' controllers which choose if they go on the top or bottom of that library.",
	"Sudden Flourish": "In the case of multiple libraries, Sudden Flourish's controller as it resolves will choose one library for each player.",
	"Rallios' Return": "Rallios' Return will trigger no matter which library the cards were originally in. Those cards can be put back on top of another library.",
	"Norwood Allure": "In the case of multiple libraries, Norwood Allure's controller as it resolves does not have to search the same library the creature card was revealed from.",
	"Forced Penance": "In the case of multiple libraries, Forced Penance's controller as it resolves will choose which library the card will be put back on top of before the targetted player chooses which card they will put on top of their library.",
	"Glittering Funeral": "In the case of multiple libraries, you can shuffle a library other than the one you scried from because they are two separate spell effects.",
	"Mull Over": "If you chose to repeat the process while having multiple libraries, you will repeat the process on the same library.",
	"Walking with Ancients": "In the case of multiple libraries, this will check all of your libraries to see if the spell's cost will be reduced, but it will only be reduced by {1} even if two or more cards that share types with it are revealed.",
	"Mysteries of the Ulek": "In the case of multiple libraries, the controller of the triggered ability as it resolves (usually the player who controlled the spell as it resolved) will decide which library the card is shuffled into.",
	"To Say Farewell": "In the case of multiple libraries, the controller of the triggered ability as it resolves (usually the controller of the creature as it attacks) will decide which library to exile cards from.",
	"Revoke": "In the case of multiple libraries, this can search any number of starting and additional libraries.",
	"Unorthodox Tutelage": "In the case of multiple libraries, the controller of Unorthodox Tutelage's triggered ability as it resolves chooses which library will be affected for each player. All three of the cards will come from the same library.",
	"Wait//See": "In the case of multiple libraries, each spell effect can choose a different library.",
	"Tides of Chaos": "In the case of multiple libraries, Tides of Chaos's controller will choose the libraries before the coin is flipped.",
	"Camouflaged Sprareos": "You can only cast it from the library you are searching.",
	"The Last Sacred Gate": "You can only play it from the library you are searching.",
	"Dwindling Memories": "In the case of multiple libraries, Dwindling Memories's controller will choose one of that player's libraries. The cards will be removed from and put back on top of that library.",
	"Spawn from the Void": "In the case of multiple libraries, Spawn from the Void's controller will choose one of their libraries. The cards will be from the bottom and put back into that library.",
	"Merchant's Guile": "In the case of multiple libraries, you can put the cards back on top of a library you didn't draw from.",
	"Topaz, the Dragon's Hand": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.\n_ In the case of multiple libraries, you can put the cards back on top of a library you didn't draw from.",
	"Ing'Wei's Crystal Top": "In the case of multiple libraries, if you own Ing'Wei's Crystal Top, you will scry from the same library you put Ing'Wei's Crystal Top on top of.",
	"Portent of the Long Winter": "In the case of multiple libraries, {X} will be equal to the total converted mana cost of all the cards on top of your libraries.",
	"Evolving Elemental": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Strength from Chaos": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Summer's Approach": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Move with the Tides": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Terrifying Ankh": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Inspiring Melodies": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Spell Dilution": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Judge Unworthy": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Adept Electromancer": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Morning's Rise": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Hunter's Instinct": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Sylvan Vitality": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Non-Stop Production": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"King Visserine of Daeland": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Topaz, the Dragon's Hand": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	"Aiel's Fury": "In the case of multiple libraries, the same library will be used for the scry and reveal effects.",
	
	"Virtuous Angel": "It doesn't matter if you lost life as long as you gained at least 4 life.",
	"Blow Away": "If there are no creatures on the battlefield, neither player has dominance.",
	"Dragon Queen's Hoard": "If there are no creatures on the battlefield, neither player has dominance.",
	"Gale Murmurer": "This only applies once per turn, not once per permanent.",
	"Hat Trick//Okus Pokus": "You can activate the loyalty ability granted by Okus Pokus twice the turn you play it if you haven't activated any loyalty abilities of that planeswalker this turn.",
	"Invocation Circle": "Cards with prophecy that are revealed still count towards the two instants and/or sorceries, but if the prophecy cards are exiled they can't be cast with Invocation Circle.",
	"Lose Composure": "If there are no creatures on the battlefield, neither player has dominance.",
	"Wave of Ice": "If there are no creatures on the battlefield, neither player has dominance.",
	"Saffrisa's Touch": "It doesn't matter if you lost life as long as you gained at least 4 life.",
	"Skhorvall Eternal": "This ability will only trigger in Skhorvall Eternal is already in the graveyard when the embattled creature dies.",
	"Scornful Flames": "If there are no creatures on the battlefield, neither player has dominance.",
	"Twilight Delirium": "The spell works if either player controls no creatures.",
	"Bestial Harmony": "The sacrifice isn't optional. If the ability triggers multiple times at once, you will only draw the cards during the resolution of the ability that causes you to sacrifice it.",
	"Crash of Hooves": "If there are no creatures on the battlefield, neither player has dominance.",
	"Lands Untrodden": "If there are no creatures on the battlefield, neither player has dominance.",
	"Forest Fellowship": "Starting with the next opponent in turn order, each opponent may put a permanent card onto the battlefield. If any of those players does, the process repeats, even if you don't have any more permanent cards to play.",
	"Mammoth Crab": "Mammoth Crab's ability only checks the power of creatures as the ability resolves.",
	"Dragon Queen's Pupil": "Dragon Queen's Pupil's ability only checks the power of creatures as the ability resolves.",
	"Viking Packleader": "Viking Packleader's ability only checks the power of creatures as the ability resolves.",
	"Highlands Champion": "Highlands Champion's replacement effect only applies if it's on the battlefield. It can't save itself from being discarded.",
	
	"Birth of Whispers": "The effects aren't optional.",
	"Edith Waunt": "Edith doesn't lose loyalty and can't be attacked while she's not a planeswalker.",
	"Blood Harvest": "If a land enters the battlefield tapped, Blood Harvest won't trigger.\n_ If you can't sacrifice the land when the trigger resolves, (for example, it isn't on the battlefield anymore), you'll have to lose the life.",

	"Omenreaper": "If you draw multiple cards at once, you will reveal each as you draw it. Omenreaper's triggers will be put on the stack in the order the cards were drawn, not all at once.",
	"The Lonely Prophet": "In Constructed, \"outside the game\" is your sideboard, in Limited, it is all cards in your cardpool that aren't in your deck, including an unlimited number of Plains, Island, Swamp, Mountain, and Forest cards.",
	"Dimensional Isolation": "This isn't hexproof. If this enchants an opponent's creature, they will be unable to target that creature.",
	"Antimagic": "Antimagic can't counter colorless spells, even if colorless mana was spent to cast it.",
	"Harbinger of Inversion": "If multiple replacement effects are affecting a player, that player chooses the order those effects apply in.",
	"Twist the Threads": "That creature does not retain any of the states of the original creature, such as if it was tapped, enchanted, or attacking.\n_ The exchanged creatures leave and enter the battlefield, respectively.",
	"Brutish Champion": "The fight isn't optional.",
	"Wandering Domoroi": "This only triggers on effects that use the word 'prevent.' It does not trigger on effects such as Serene Prayer, Stay Determined, and glory counters.",
	"Nexus of Possibilities": "This only affects spells and abilities that tell you a player to \"choose N\" from a bulleted list. This does *not* include anchor words such as Moonlight Sanctum that ask you to choose a word.\n_ If you choose an additional mode for a spell with escalate, you will still have to pay the escalate cost for it. This is because escalate is a cost that is paid for each mode chosen beyond the first, it does not care what allows you to choose the extra modes.",
	
	"Power Gate": "Once a creature has been declared an attacker, changing the number of cards in your hand won't stop it from attacking.",
	"Crossing the Fog": "Journey is a keyword action. To journey, exile the top card of your library face up and it becomes journeyed.\n_ Whenever a creature you control deals combat damage to an opponent, put a journeyed card you own from exile into your hand.",
	"Spectrum Archmage": "If you can't target a spell for Spectrum Archmage's triggered ability, you won't be able to abound.",
	"Spike Wall Trap": "It doesn't matter who activated the ability, just that an ability of that permanent was activated and an opponent controls that permanent.",
	"Beckon of the Wild": "\"Sleight\" means \"You may cast this spell as though it had flash if you pay {1} more to cast it.",
	"A Whole New World": "You don't have to search for basic lands.",
	"Penny and Pete": "This doesn't trigger any \"When this creature attacks\" abilities.",
	"Rose of Fretport": "If Rose is the only permanent with the greatest converted mana cost among permanents, you won't be able to choose a permanent.",
	
	
	"Azamir, Wayward Titan": "You can't activate Azamir's -3 unless you can target two nonland permanents.",
	"Golden Company Tactics": "If you control a Soldier and a Knight, you'll get +1/+1 counters three times.",
	"Icy Secrets": "Icy Secrets is not an Archive. If Icy Secrets leaves the battlefield, the cards it exiled will be stranded and you won't be able to draw them anymore.",
	"Outsmart": "The number of cards both players have in their hands is checked while Outsmart is resolving.",
	"Berbarus Unsealed": "Additional costs (such as kicker) count to the amount of mana spent to cast the spell.",
	"Embrace Madness": "Normally this is not a mana ability. The exception is when the card is discarded as a cost to activate a mana ability, such as Ahl's Study.",
	"Just Business": "You can't sacrifice a nonlegendary planeswalker.",
	"Aquilifer Axelius": "Aquilifer Axelius can still attack or block alone.",
	"Captain Mattias Ochre": "Mattias will buff itself if its still a Soldier.",
	"Finale of Cinders": "While you will pay for the triggers while Finale of Cinders is still resolving, you will not choose any targets for those triggers until after the spell has left the stack and state based actions have been checked. Then you will choose targets for each of the triggers you have paid for, then the active player gains priority.",
	"Overclock": "Copied spells aren't cast unless the effect explicitly says they are.",
	"Backwood Rangers": "This includes Snow-Covered Forests and Dry Forests, but not nonbasic lands that have been turned into Forests.",
	"Emperor Tzhai": "You control that player for the rest of the game, starting from the point the ability resolves.\n_ If Tzhai's last ability is copied and redirected at the player who controls the original ability, the controller of the ability that resolves first will control both players.\n_ If another player-control effect is applied to a controlled player, the controller of the most-recent control effect will control that player during that effects duration. If that effect doesn't have a duration (such as another Tzhai), the newer control effect will always prevail.",
	"Voidlife Orbs": "You can spend as much colorless mana as you like to activate this ability.",
	"Mirrorgate": "This does not continuously unapply and reapply due to the land being named \"Mirrorgate\" due to layers.",
	"Titan's Palace": "This can cast a split card if the half of the split card you are casting costs 5 or more, or you are fusing a split card with a combined converted mana cost of 5 or more.",
	"Jara Champion": "If a player lost life before Jara champion was on the battlefield, it cannot gain a counter this turn.",
	
	"Chronovore Clock":"Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety.\n_ If any triggered abilities do trigger during this process, they're put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends.\n_ Though spells and abilities that are exiled won't get a chance to resolve, they don't count as being \"countered.\"\n_ If Chronovore Clock's ability is ends the turn before the end step, any \"at the beginning of the end step\"-triggered abilities won't get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps (except upkeep).",
	"Eternity Pendant": "If you have multiple Eternity Pendants and lose the game, you can apply the order they will replace that loss in any order. Once the loss has been replaced by the first one, the others will be unable to until you lose again.",
	"Seer's Sphere": "To fateseal 3, look at the top three cards of an opponent's library, then put any number of them on the bottom of that player's library and the rest on top in any order.",
	"Steamquiver Strix": "Some effects (such as Green Sun's Zenith) tell a player to shuffle multiple times. Even if the player shortcuts to use one shuffle, Steamquiver Strix will trigger twice.",
	"The Stranger's Play": "If you cast a card for an alternative cost of {0}, you can't pay any other alternative costs, such as flashback costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card.",
	"Sundial of the Infinite":"Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety.\n_ If any triggered abilities do trigger during this process, they're put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends.\n_ Though spells and abilities that are exiled won't get a chance to resolve, they don't count as being \"countered.\"\n_ If Sundial of the Infinite's ability is activated before the end step, any \"at the beginning of the end step\"-triggered abilities won't get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps (except upkeep).\n_ The earliest that you can activate Sundial of the Infinite's ability is during your upkeep step, after abilities that trigger \"at the beginning of your upkeep\" have been put onto the stack but before they resolve.",
	"Walking Armory": "If the returned Equipment can't be attached to Walking Armory for some reason, it is still returned to the battlefield.",
	
	"Amulet of Loyalties": "You can't {T} a creature that hasn't been under its controller's control since that player's last upkeep.\n_ You can't sacrifice permanents you don't control.\n_ Each permanent can only activate one loyalty ability per turn, no matter who activated it.\n_ Effects such as The Chain Veil and Teferi, Temporal Archmage's emblem that affect planeswalkers you control won't allow you to activate multiple abilities of a planeswalker you don't control.",
	"Buttress Formation": "Once a creature has been declared as an attacker, removing Buttress Formation won't stop the creature from attacking.",
	"Golden Touch": "This counts both zones as a whole, so the most it can give is +5/+5.",
	"Cadalon Outfitter": "Cadalon Outfitter will know if you activated an ability before it entered the battlefield.",
	"Shoreline Temptress": "Being marked isn't an ability. Creatures that have lost their abilities are still marked.",
	"Unraveling": "If you cast Unraveling from your graveyard, it will not count itself when choosing modes.\n_ If you somehow have more than three Unraveling cards in your graveyard, you will choose all four modes once.",
	"Eldritch Egg": "Eldritch Egg won't be legendary unless the card it copied was legendary.\n_ If Eldritch Egg copies a Saga, lore counters won't be placed on it as your precombat main phase begins, and it won't be sacrificed due to having lore counters. Its chapter abilities will still trigger if you manage to add lore counters to it another way.\n_ Eldritch Egg will lose its ability when it becomes a copy. However, you can activate the ability multiple times in response to each other and it will become a copy each time.\n_ Cards, numbers, and names tracked by linked abilities (two or more abilities that reference each other or their effects) will not carry over as Eldritch Egg copies and uncopies.\n_ Cards, numbers, and names tracked by duration abilities (such as an effect that lasts \"until ~ leaves the battlefield\") will carry over as Eldritch Egg copies and uncopies.",
	"Night on Flayed Mountain": "If the player has no cards in hand, they must sacrifice a creature, and if they control no creatures, they must discard a card. If they don't have either, they get off easy this time.",
	"Troupe Smuggler": "Troupe Smuggler's ability won't trigger or resolve if you've already produced mana with its ability this turn.",
	"Upstage": "This isn't optional. If you control the only creature with a lesser converted mana cost, you must target it.",
	"Audition": "You choose to sacrifice the creature or pay for it when the end step trigger resolves.",
	"Life's Work": "This isn't optional.",
	"Performer of Desire//Pyrus, the Undying Flame": "You don't lose the mana as turns end.",
	"Reprising Bard": "If Reprising Bard enters the battlefield and then immediately leaves the battlefield (perhaps because it was aetherized), you will be able to order the triggers in any order you choose.",
	"War's Sorrow": "Starting with the active player, each player decides if they will let War's Sorrow deal damage to them or not.",
	"Into the Woods": "It doesn't have to be a basic Forest.",
	"Cornrose, the Mighty": "You can put loyalty counters on a creature or +1/+1 counters on a planeswalker if you really want to.",
	"Curtain Call": "If the current turn ends before the end step, the delayed trigger will trigger during the next end step still. If the turn ends while the ability is on the stack, or the ability is countered, it will not trigger again.",
	"Kiku, the Gadgeteer": "If you cast an artifact spell or activated an ability of an artifact before Kiku, the Gadgeteer enters the battlefield, the reductions won't apply to the second.",
	"Lucien, the Grifter": "Lucien stops being a planeswalker during its second [+1], and doesn't lose loyalty while he's not a planeswalker.",
	"Qililia, the Saboteur": "Qililia will not replace her own Fish token.\n_ If an opponent creates multiple tokens at once, they will get a Fish token for each one.\n_ If you and an opponent control a Qililia, each of you create a Fish token and the original player creates the initial token.\n_ If multiple opponents control a Qililia, the owner of the spell or ability will determine which order they are applied.\n_ If you somehow control two Qililia, you will create the original token and a Fish, and your opponent will create a Fish.",
	"Squid Pro Quo": "You can target a permanent you control to get the Squid for yourself. If you targeted a creature you temporarily controlled, you will still control it when the temporary effect wears off.",
	"Timid Thunderhorn": "The creature's power is checked as Timid Thunderhorn's ability resolves.",
	"Duelist's Choice": "If Duelist's Choice equips a creature with menace, that creature can't be blocked.",
	"Platinum Colossus": "This is checked after all PT modifications from layers have been applied.",
	"Talent Pool": "Abilities that check what mana a land could produce will know what types Talent Pool can currently tap for based on the creatures you control.\n_ If the enchanted permanents mana cost is {2}{W}{U}, add {C}{C}{W}{U}. If its mana cost is {X}{G}, add {G}. If its mana cost is (W/U)(W/U), Talent Pools controller chooses whether to add {W}{W}, {W}{U}, or {U}{U}. The choice may be different each time the ability resolves.",
	"Chi Lee of the Underworld": "If simultaneous combat damage causes Chi Lee to die and one of her Demons's ability to trigger, that trigger can target Chi Lee, as the trigger will not be put onto the stack until a player gains priority.",
	"Glistening Chalice": "If you cast a nonartifact spell without paying its mana cost, the {1} tax from Glistening Chalice's second mode still needs to be paid.",
	
	"Imperial Titan": "Imperial Titan can't be cast from your hand. It can't be cast from any zone other than your graveyard, even if an effect would otherwise allow you to.\n_ If you cast Imperial Titan from your graveyard through another effect, its cast trigger will still trigger.",
	"Throne of the West": "Throne of the West's last level doesn't cause you to regain control of any permanents that were stolen before it reached 5 progress.",

	"Congruous Simulacrum": "You can't spend {C} to cast Congruous Simulacrum.",
	"Iekin's Portal//Iekin, God of Wisdom": "If an effect says that an opponent wins the game, Iekin, God of Wisdom's effect doesnt apply.\n_ If you somehow win the game and lose the game simultaneously (for example, having 0 life and ten poison counters while controlling Iekin), you lose the game.",
	
	"Consuming Knowledge": "If another player gains control of Consuming Knowledge after it is cast, they will not get the additional effect even if the bloodprice was paid.",
	"Beckon the Shadows": "If another player gains control of Beckon the Shadows after it is cast, they will not get the additional effect even if the bloodprice was paid.",
	"Aelani, Mother of All": "This means noncreature permanents will never enter the battlefield.",

	
	"Paragon of Purity": "Bloodprice, coalesce, conjure, cripple, fabled, flashback, mirage, paranoia, primal, prophecy, quickdraw and casting a card with morph face down are alternative mana costs. Paying {1} to exile a revealed card with prophecy is not an alternative mana cost.\n_ Inscribe, orchestrate, and turning a card with metamorph face up are not alternative mana costs and can still be paid, but players will be unable to play the card without paying its mana cost still.\n_ Mana symbols that can be paid in multiple ways, such as hybrid mana, are not alternative costs.\n_ Effects that reduce the mana cost of a spell without a new cost (such as harvest, enspirit, and delve) or that add additional costs to cast without a new cost (such as snowfall, reverberate, and jump-start) are not alternative costs.",
	"Master of Masks": "You may pay any additional or alternative costs that creature may have.\n_ It remains a copy of that creature as it enters the battlefield.\n_ You can cast Master of Masks with abound as a copy of any creature as long as that creature's cmc is within the abound's converted mana cost limit.",
	"Root Dancer": "If a card is being affected by multiple replacement effects, the controller of the card chooses the order that the replacement effects are applied in.",
	"Equilibrium Paladin": "This ability will affect the creature while it is entering the battlefield, so it will lose abilities such as 'This creature enters the battlefield tapped.' and 'As this creature enters the battlefield' abilites.",
	"Rubble Tender": "The sacrifice isn't optional. If you can't sacrifice a land, you can still search.",
	"Aeridas Assistant": "You can pay 'Discard your hand' even if your hand has no cards in it.",
	"Artists Vista": "Those players choose the color of mana.",

	"Faradia, Honored Sovereign": "This cost is paid each time as attackers or blockers are declared.",
	"Lazaires Conjuring": "You can choose any creature you control each time, whether or not it has been flickered by Lazaires Conjuring.",
	"Sporeflow Propagator": "A token copy of Sporeflow Propagator will cause its own ETB to trigger.",
	"Parish Paragon": "If you conntrol two Parish Paragons and damage is dealt to one of them, the damage will really be dealt to that creature.\n_ If you control more than one Parish Paragon, all damage that would be dealt at once to other creatures you control is dealt to one of them of your choice, and the damage that would be dealt to that Parish Paragon is dealt to the second. Otherwise you cant split the damage between them, and it's not dealt to each of them. The next time damage would be dealt to creatures you control, you may choose a different one of those Parish Paragon's to be dealt that damage.",
	
	"Grand Expeditions": "Grand Expeditions will count creatures that entered the battlefield before it did to check for the first creature.",
	"Phantom Threader": "If there is nothing the token can enchant, it will not be created.",
	"Prismatic Champion": "If there is nothing the token can enchant, it will not be created.",
	"Silkweaver Matron": "If there is nothing the token can enchant, it will not be created.",
	"Seeker of Lost Secrets": "If there is nothing the token can enchant, it will not be created.",
	"Ageless Weaver": "If there is nothing the token can enchant, it will not be created.",
	"Far-Realm Blademaster": "If there is nothing the token can enchant, it will not be created.",
	"Relentless Pathcutter": "If there is nothing the token can enchant, it will not be created.",
	"Rootbound Awakener": "If there is nothing the token can enchant, it will not be created.",
	"Saddlesaur Guide": "If there is nothing the token can enchant, it will not be created.",
	"Akkrixian Ambassador": "If there is nothing the token can enchant, it will not be created.",
	"Journeying Giftbearer": "If there is nothing the token can enchant, it will not be created.",
	"Mausoleum Suffragan": "If there is nothing the token can enchant, it will not be created.",
	"Zhedina Valiant": "If there is nothing the token can enchant, it will not be created.",
	"Benthic Thaumaturge": "The name change is a text-changing effect.",
	"Isolated": "The name change is a text-changing effect.",
	"Bleak Channeler": "The name change is a text-changing effect.\n_ If there is nothing the token can enchant, it will not be created.",
	"Foul Swathe": "The name change is a text-changing effect.",
	"Portal Inhibitor": "Aetherized tokens will still be immediately exiled.",
	"Amber Reserves": "This creates a land named Plains Island, Island Swamp, Swamp Mountain, Mountain Forest, Forest Plains, Plains Swamp, Island Mountain, Swamp Forest, Mountain Plains, or Forest Island.",
	"Interplanar Raid": "If the creature that triggered Interplanar Raid has left the battlefield by the time the trigger resolves, Interplanar Raid will use the power that creature had as it left the battlefield.",
	"Kilnsoul Adept": "Kilnsoul Adept will lose all its other creature types when it becomes a Dragon.",
	"Possibility Engine": "If you have four or more differently named lands, play a card with Possibility Engine, and temporarily no longer have four or more differently named lands, you wont be able to play another card with the same Possibility Engine that turn.",
	"Voliv Ritualist": "This creates a land named Plains Island, Island Swamp, Swamp Mountain, Mountain Forest, Forest Plains, Plains Swamp, Island Mountain, Swamp Forest, Mountain Plains, or Forest Island.",
	"Planar Genesis": "This creates lands named Plains Island, Island Swamp, Swamp Mountain, Mountain Forest, Forest Plains, Plains Swamp, Island Mountain, Swamp Forest, Mountain Plains, and Forest Island.",
	"Sowing Spring": "The name change is a text-changing effect.",
	"Verdant Renewal": "An activated ability is a mana ability if it meets all of the following criteria: it doesnt require a target, it could add mana to a players mana pool when it resolves, and its not a loyalty ability.\n_ A triggered ability is a mana ability if it meets all of the following criteria: it doesnt require a target, it triggers from the resolution of an activated mana ability  or from mana being added to a players mana pool, and it could add mana to a players mana pool when it resolves.",
	"Worldshaping": "This creates a land named Plains Island, Island Swamp, Swamp Mountain, Mountain Forest, Forest Plains, Plains Swamp, Island Mountain, Swamp Forest, Mountain Plains, or Forest Island.",
	"Aether Road Caravan": "If Aether Road Caravan isnt on the battlefield when the ability resolves, youll never gain control of the permanent.",
	"Blossoming Inspiration": "When those Aura tokens enter the battlefield, attach them to anything they can enchant. This is able to bypass hexproof. If there is nothing the token can enchant, it will not be created.",
	"Caldera Crawlers": "This is a mana ability.",
	"Iknan, the Last Gildmane": "Iknan can be either target for the activated ability.",
	"Morphic Verge": "This creates a land named Plains Island, Island Swamp, Swamp Mountain, Mountain Forest, Forest Plains, Plains Swamp, Island Mountain, Swamp Forest, Mountain Plains, or Forest Island.",
	"Shifting Canyon": "This creates a land named Plains Island, Plains Swamp, Mountain Plains, or Forest Plains.",
	"Shifting Cascade": "This creates a land named Plains Island, Island Swamp,  Island Mountain, or Forest Island.",
	"Shifting Crag": "This creates a land named Mountain Plains, Island Mountain, Swamp Mountain, or Mountain Forest.",
	"Shifting Grove": "This creates a land named Forest Plains, Forest Island, Swamp Forest, or Mountain Forest.",
	"Shifting Morass": "This creates a land named Plains Swamp, Island Swamp, Swamp Mountain, or Swamp Forest.",
	"Urban Plaza": "You can spend this mana to cast face down spells.",

	"Align the Astrolabe": "This is rounded down. If Align the Astrolabe has two counters, you wont create any Construsts, if it has five counters, youll create one, and so on.",
	"Artistic Vision": "This triggers on your first spell thats an artifact or an enchantment. If you cast an artifact and an enchantment, it will only trigger once.\n_ Artisitc Vision will check the whole turn for the spells you have cast, so if you cast Artistic Vision this turn, it wont trigger.",
	"Mastery of the Veil": "This is an additional cost. Youll still pay it if you cast the spell without paying its mana cost.",
	"Reclamation Grovesculptor" :"The growth counter only serves as a reminder. If it is removed, the the permanent remains a Forest.",
	"Exuberant Inventor": "The additional end step occurs before the cleanup step, so damage wont wear off, until end of turn and this turn effects wont end, and players wont discard down to their maximum handsize between the end steps.",
	"Arcane Chronometer": "This includes mana abilities of artifacts.",
	"Secret Thief": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	"Ambitious Necromancer": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	"Beckon Darkness": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	"Mirrocast Battlemage": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	"Artisan of Brutality": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	"Iken Troubleshooter": "If an opponent or permanent is chosen multiple times as a target for a single spell or ability, (for example, an escalated Isolation), the sabotage ability will only trigger once for that player or permanent. If different opponents or permanents are being targeted, the sabotage ability will trigger for each one.",
	
	"Champion of Destinies": "The monarch draws a card at the beginning of their end step. Whenever the monarch is dealt combat damage by a creature, its controller becomes the monarch.",
	"Wunderkind Devising": "Wunderkind Devising's final ability will override the base PT of Vehicles.",
	"Ammbradu Goliath": "Ammbradu Goliath's toughness will only be checked before each player gains priority. This means an effect such as 'Draw two cards, then discard two cards' won't result in it having 0 toughness in the middle of the spell resolution.",
	"Xanigan, the Darkened Cloud": "The emblem trigger will resolve before the loyalty ability does.",
	"Bow or Burn": "Bow or Burn doesn't care how it was cast from a graveyard, only that it moved to the stack from the graveyard.\n_ Copies of cards are cast from the same zone that the original card was in.",
	"Nova, Skyship Captain": "If you reveal a creature card with converted mana cost 1 or less and prophecy, you can exile it with prophecy and create a token copy of it with Nova.",
	"Starjump": "If you cast the card from the second pile, it will no longer be in the second pile and won't be put into your graveyard.",
	"Twisting Memories": "If Twisting Memories triggers multiple times in a turn, you will be able to cast one card from each of the exiled pairs.",
	"Raloran Tidecaller": "Merfolk Wizards will only have one instance of the trigger.\n_ Raloran Tidecaller also has the trigger as long as it remains a Merfolk or a Wizard.",
	"Cross Boundaries": "Cross Boundaries only considers the greatest number of lands you control with the same name. If you control four lands each with a different name, it will only deal 1 damage.",
	"Ephemeral Adept": "Substantiate is not an alternate mana cost, so you will be able to pay any alternate mana costs of that spell.",

	"Singer of Calamities": "If you target an Aura this way, it will be put into its owners graveyard as a state-based effect once Singer of Calamities ability has worn off.",
	"Forager's Lore": "If there is exactly one card in your hand and graveyard when you attempt to reappropriate, you will not exile any cards and the second ability will not trigger.",
	"Makias, Marked Marauder": "You do any one of the four things. Makias doesn't care what you're paying with, as long as it's something.",
	
	"Howling Alpha": "Other creatures you control can still be sacrificed, and have to be if you must sacrifice a creature.",
	"Strategizing": "Strategizings first mode doesnt target any permanent or player. You choose a source of damage as it resolves.",
	"Fighter's Arena": "This effect applies to each type of token created. For example, Celestial Army says \"Create three 1/1 white Soldier creature tokens, two 2/2 white Knight creature tokens with vigilance, and a 4/4 white Angel creature token with flying.\" If you control Fighter's Arena when it resolves, you will create four Soldiers, three Knights, and two Angels.",
	
	"Aureate Panorama": "Aureate Panorama can fetch a land that has an ability that, if it resolved at this moment, could add mana of any color, or has one or more abilities that collectively add all five colors of mana. Do not consider any restrictions on the use of the mana or the activation of the ability, but do consider any replacement effects that would apply to that mana.\n_ The ability that adds mana does not have to be a mana ability. For example, Crumbling Vestige and Art Studio can be fetched.\n_ If a land's ability depends on a choice that hasn't been made yet, such as Desert Palace or Nebula of Empty Gold, it can't be fetched.\n_ The ability considers the board state during the resolution of the fetch. For example, you can only fetch Chroma, the Faerie Circle during an opponent's turn, or Leyline Alignment Field while you have cards of all five colors in your graveyard, and you will be unable to find any lands if a Rylei Wakebreaker is on the battlefield.\n_ Remember that the ability is checked while the card is still in your library. You won't be able to find a basic Forest even if you control Chromatic Lantern, and you won't be able to find anything if The Erased is on the battlefield.\n_ Lands that provide access to five colors without explicitly adding mana, such as \"Target land gains all basic land types,\" \"{C} can be spent as though it were mana of any color,\" lands that create Treasure tokens, etc. can't be fetched.",
	
	"Infestation": "Targets are chosen as a spell is cast, so Infestation's +1/+1 counters can't be placed on one of the tokens it creates, and the spell can't be cast if you don't control a creature to target.",
	"Battle for Msuji Highlands": "The second chapter which have each of the creatures you control individually fight the creature you control simultaneously.",
	"Trials of Ndengo": "A creature survives a fight if, after the next time after the fight state-based effects have been checked, it is still on the battlefield. If exactly one of those creatures is still on the battlefield, four +1/+1 counters will be placed on that creature, and then state-based actions will be checked again. (This is unlikely to change anything, unless for example there is an effect that replaces +1/+1 counters with -1/-1 counters.",
	"Butcher of Shallow Graves": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost.",
	
	"Gavis the Stalwart": "Gavis's emblem will trigger if that permanent entered an opponents graveyard as long as you controlled that permanent.",
	"Gavis's Dragoons": "If Gavis's Dragoon's ability is copied, spells with the same name as any of the cards exiled with its enters the battlefield ability will be exiled.",
	"Spirit Drain": "You can't cast Spirit Drain if you don't control a creature you can target.",
	"Aeon's Hand Cutthroat": "If Aeon's Hand Cutthroat is already blocked, activating it's ability won't make it unblocked.",
	"Wailing Soul": "Creatures remain attacking or blocking during the entire combat phase.",
	"Death Strike": "You can't cast Death Strike unless it has four targets.",
	"Erase From Existence": "You will only search the zones of the targetted creature's controller, but all other creatures with the same name on the battlefield will be exiled, regardless of controller.",
	"Leech Soul": "If you sacrifice Leech Soul's target to cast it, it will be countered as it tries to resolve.",
	"Sagi Aysan": "You do not need to have a creature card in your graveyard to activate Sagi Aysan's +1, and you may cast a creature card that is put into your graveyard this turn after you activate it.",
	"Magmatic Ravager": "If you somehow only control one land you can target, the ability will be countered.",
	"Rule of Nature": "If there are no other creatures and you give a creature +1/+1, it will fight itself, dealing damage equal to twice its power to itself.",
	"Skavi Behemoth": "If a spell or permanent has become green as it tries to resolve, Skavi Behemoth will be an illegal target and the spell or ability will be countered.",
	"Unhallowed Concordant": "This card uses a replacement effect. This means the player who chooses which library will be affected in the case of multiple libraries can be messy to determine.\n_ Life loss caused by combat damage has no controller. The player affected by the replacement effect will choose which libraries will be affected.\n_ Life loss caused by spells and abilities either by direct life loss or by damage has the same controller as the spell or ability. That player will choose which libraries will be affected."	
}