{

	"Daybreak": "This means they pay mana equal to the number of creatures attacking, not mana equal to the number of attacking creatures for each creature.",
	"Devoted Dancer": "The shuffle isn't optional.",
	"Gift of Eternity": "Setting your life to a number means gaining or losing the amount of life necessary to have that much life. If you have glory counters, you will lose them first and end up with more than 5 life.",
	"Starglare": "You may still target a creature even if you do not pay {R} to cast Starglare",
	"United Force": "Once United Force has been cast, it is too late to change the colors among permanents you control.",
	"Aerolius": "Standard searching rules still apply. That player can fail to find even though their hand is revealed.",
	"Dodgy Infant": "The target must still be legal. For example, you can't redirect the target of an opponent's spell to a creature with hexproof you control.",
	"Monkeyshines": "You put both cards in your graveyard or back on top, you can't split them.",
	"Orria Mirrorpelt": "Each other creature means for each creature that isn't Orria Mirrorpelt. Her copies won't naturally target herself.",
	"Slippery Capuchin": "The target must still be legal. For example, you can't redirect the target of an opponent's spell to a creature with hexproof you control.",
	"Thunderstride": "Thunderstride counts itself the turn it was cast.",
	"Heart of the Deadwood": "If there is not a creature and a creature card to target when the ability is put on the stack, it will be countered. If both of them are targetted, making only one target illegal will not counter the rest of the ability.",
	"Whispers of the Dark": "If it's a nonland permanent or a spell you decided not to cast, put it into your hand.",
	"Feathered Warden": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Cloudstep Capuchin": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Pelt Mystic": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Stinging Hunter": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Ralora Adept": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Pond Tenders": "The colors are compared once the spell is cast. After that point changing colors won't trigger or counter the ability.",
	"Gim-Chimya, the Invisible": "This effectively means players have no maximum hand size.",
	
	"Chief Striking Dawn": "Dawn's ability doesn't target. The card she reanimates will be chosen on resolution.",
	"Bearidge Marshall": "If the target of the ability can't be enchanted by the Aura, the Aura will never enter the battlefield.",
	"Lone Stranger": "Lone Stranger's ability will check if you control no other creatures as it triggers and as it tries to resolve.",
	"Ride into the Sunset": "If an ability creates multiple tokens, the ability will trigger multiple times.",
	"Uncommon Grit": "The creature won't get the counter until after the damage is dealt.",
	"Warning Shot": "Warning Shot checks your graveyard on resolution.",
	"Aetherite Slugs": "If Aetherite Slugs enchants a spell, it will be put into its owner's graveyard as a state based action when that spell leaves the stack, even if it becomes a permanent.",
	"Cage the Mind": "The target of Cage the Mind's first mode must already have been detained before it is cast. If it somehow stops being detained, it will no longer be a legal target.",
	"Fool's Gold": "If Fool's Gold's target has become multicolor as it tries to resolve, Fool's Gold will be countered.",
	"Winning Hand": "Winning Hand doesn't count towards the number of cards in your hand.",
	"Window Shopping": "If you draw two cards, the rest of the piles is both piles.",
	"Graygulch Revenant": "If multiple players lose life simultaneously, the triggers will be put on the stack in turn order starting with the active player, meaning the active player (or next player who lost life in turn order) will end up with the Revenant.",
	"Howler Sellout": "You can't target a creature multiple times with this trigger.",
	"Wendigo": "The sacrifice isn't optional. If you don't feed the Wendigo, it will eat itself. It will do so before any +1/+1 counters are put on it.",
	"Brazen Drifter": "Brazen Drifter doesn't care who or what those creatures attack.",
	"Open Road": "Open Road checks if that permanent has the greatest converted mana cost before it will trigger and as it tries to resolve.",
	"Tavern Brawl": "Tavern Brawl will trigger before the active player has an opportunity to activate loyalty abilities of a planeswalker that entered the battlefield.",
	"Mistbreaker": "This includes effects on Mistbreaker, such as detain, and evasion abilities, such as flying or menace.\n_Mistbreaker is still unable to attack or block if it is tapped or block multiple creatures without additional effects.\n_ Mistbreaker can still be forced to attack or block a certain way. Effects such as \"All creatures able to block this creature do so.\" or \"Creatures your opponents control attack this planeswalker if able.\" will still affect Mistbreaker.\n_ Effects are ignored only if they would be legal without Mistbreaker. If an opponent controls a Ghostly Prison, you must still pay {2} for each creature that's attacking that player other than Mistbreaker. Mistbreaker and another creature can both block a creature that can only be blocked by one creature.",
	"Stickup": "You will cast the card after any triggers caused by discarding the card, but before they resolve. Notably, a card stolen with Stickup can't be cast for its madness cost.",
	"Unassuming Swineherd": "This means abilities that trigger on creatures dying or cards entering a graveyard will not trigger.",
		
	"Chronovore Clock":"Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety.\n_ If any triggered abilities do trigger during this process, they're put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends.\n_ Though spells and abilities that are exiled won't get a chance to resolve, they don't count as being \"countered.\"\n_ If Chronovore Clock's ability is ends the turn before the end step, any \"at the beginning of the end step\"-triggered abilities won't get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps (except upkeep).",
	"Eternity Pendant": "If you have multiple Eternity Pendants and lose the game, you can apply the order they will replace that loss in any order. Once the loss has been replaced by the first one, the others will be unable to until you lose again.",
	"Seer's Sphere": "To fateseal 3, look at the top three cards of an opponent's library, then put any number of them on the bottom of that player's library and the rest on top in any order.",
	"Steamquiver Strix": "Some effects (such as Green Sun's Zenith) tell a player to shuffle multiple times. Even if the player shortcuts to use one shuffle, Steamquiver Strix will trigger twice.",
	"The Stranger's Play": "If you cast a card for an alternative cost of {0}, you can't pay any other alternative costs, such as flashback costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card.",
	"Sundial of the Infinite":"Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety.\n_ If any triggered abilities do trigger during this process, they're put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends.\n_ Though spells and abilities that are exiled won't get a chance to resolve, they don't count as being \"countered.\"\n_ If Sundial of the Infinite's ability is activated before the end step, any \"at the beginning of the end step\"-triggered abilities won't get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps (except upkeep).\n_ The earliest that you can activate Sundial of the Infinite's ability is during your upkeep step, after abilities that trigger \"at the beginning of your upkeep\" have been put onto the stack but before they resolve.",
	"Walking Armory": "If the returned Equipment can't be attached to Walking Armory for some reason, it is still returned to the battlefield.",
	
	"Amulet of Loyalties": "You can't {T} a creature that hasn't been under its controller's control since that player's last upkeep.\n_ You can't sacrifice permanents you don't control.\n_ Each permanent can only activate one loyalty ability per turn, no matter who activated it.\n_ Effects such as The Chain Veil and Teferi, Temporal Archmage's emblem that affect planeswalkers you control won't allow you to activate multiple abilities of a planeswalker you don't control.",
	"Buttress Formation": "Once a creature has been declared as an attacker, removing Buttress Formation won't stop the creature from attacking.",
	"Golden Touch": "This counts both zones as a whole, so the most it can give is +5/+5.",
	"Cadalon Outfitter": "Cadalon Outfitter will know if you activated an ability before it entered the battlefield.",
	"Shoreline Temptress": "Being marked isn't an ability. Creatures that have lost their abilities are still marked.",
	"Unraveling": "If you cast Unraveling from your graveyard, it will not count itself when choosing modes.\n_ If you somehow have more than three Unraveling cards in your graveyard, you will choose all four modes once.",
	"Eldritch Egg": "Eldritch Egg won't be legendary unless the card it copied was legendary.\n_ If Eldritch Egg copies a Saga, lore counters won't be placed on it as your precombat main phase begins, and it won't be sacrificed due to having lore counters. Its chapter abilities will still trigger if you manage to add lore counters to it another way.\n_ Eldritch Egg will lose its ability when it becomes a copy. However, you can activate the ability multiple times in response to each other and it will become a copy each time.\n_ Cards, numbers, and names tracked by linked abilities (two or more abilities that reference each other or their effects) will not carry over as Eldritch Egg copies and uncopies.\n_ Cards, numbers, and names tracked by duration abilities (such as an effect that lasts \"until ~ leaves the battlefield\") will carry over as Eldritch Egg copies and uncopies.",
	"Night on Flayed Mountain": "If the player has no cards in hand, they must sacrifice a creature, and if they control no creatures, they must discard a card. If they don't have either, they get off easy this time.",
	"Troupe Smuggler": "Troupe Smuggler's ability won't trigger or resolve if you've already produced mana with its ability this turn.",
	"Upstage": "This isn't optional. If you control the only creature with a lesser converted mana cost, you must target it.",
	"Audition": "You choose to sacrifice the creature or pay for it when the end step trigger resolves.",
	"Life's Work": "This isn't optional.",
	"Performer of Desire//Pyrus, the Undying Flame": "You don't lose the mana as turns end.",
	"Reprising Bard": "If Reprising Bard enters the battlefield and then immediately leaves the battlefield (perhaps because it was aetherized), you will be able to order the triggers in any order you choose.",
	"War's Sorrow": "Starting with the active player, each player decides if they will let War's Sorrow deal damage to them or not.",
	"Into the Woods": "It doesn't have to be a basic Forest.",
	"Cornrose, the Mighty": "You can put loyalty counters on a creature or +1/+1 counters on a planeswalker if you really want to.",
	"Curtain Call": "If the current turn ends before the end step, the delayed trigger will trigger during the next end step still. If the turn ends while the ability is on the stack, or the ability is countered, it will not trigger again.",
	"Kiku, the Gadgeteer": "If you cast an artifact spell or activated an ability of an artifact before Kiku, the Gadgeteer enters the battlefield, the reductions won't apply to the second.",
	"Lucien, the Grifter": "Lucien stops being a planeswalker during its second [+1], and doesn't lose loyalty while he's not a planeswalker.",
	"Qililia, the Saboteur": "Qililia will not replace her own Fish token.\n_ If an opponent creates multiple tokens at once, they will get a Fish token for each one.\n_ If you and an opponent control a Qililia, each of you create a Fish token and the original player creates the initial token.\n_ If multiple opponents control a Qililia, the owner of the spell or ability will determine which order they are applied.\n_ If you somehow control two Qililia, you will create the original token and a Fish, and your opponent will create a Fish.",
	"Squid Pro Quo": "You can target a permanent you control to get the Squid for yourself. If you targeted a creature you temporarily controlled, you will still control it when the temporary effect wears off.",
	"Timid Thunderhorn": "The creature's power is checked as Timid Thunderhorn's ability resolves.",
	"Duelist's Choice": "If Duelist's Choice equips a creature with menace, that creature can't be blocked.",
	"Platinum Colossus": "This is checked after all PT modifications from layers have been applied.",
	"Talent Pool": "Abilities that check what mana a land could produce will know what types Talent Pool can currently tap for based on the creatures you control.\n_ If the enchanted permanent’s mana cost is {2}{W}{U}, this Aura’s controller adds {C}{C}{W}{U} to their mana pool. If its mana cost is {X}{G}, this Aura’s controller adds {G} to their mana pool. If its mana cost is (W/U)(W/U), this Aura’s controller chooses whether to add {W}{W}, {W}{U}, or {U}{U} to their mana pool. The choice may be different each time the ability resolves.",
	"Chi Lee of the Underworld": "If simultaneous combat damage causes Chi Lee to die and one of her Demons's ability to trigger, that trigger can target Chi Lee, as the trigger will not be put onto the stack until a player gains priority."
}